const List pathToAllahOne =
[
  {
    "id": 1,
    "question": " أولى خطوات سلوك الطريق إلى الله تحقيق ....",
    "options": [
      'الصدق',
      'لامانة',
      'الحب',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "ينحصر الالتزام في اللحية والنقاب فقط؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "إذا حقق الإنسان الصدق في طلب الالتزام فقد لا يُوفق ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "على قدر ......يكون الوصول إلى المراد والانجاز في الطريق إلى الله.",
    "options": [
  'الصدق',
  'الفقر إلي الله',
  'الإجابتان معآ',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "كثرة معاهدة الله على فعل طاعة أو ترك معصية ثم عدم الالتزام بالعهود قد يكون هذا سبب في الحرمان من الإلتزام إلى الأبد؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "لا يُشترط مع تحقيق الصدق أن تأخذ بالاسباب؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من أسباب الحرمان من الهداية ؟",
    "options": [
  'السرقة',
  'كثرة الذنوب',
  'ترك الصلاة',
  'الاستهتار بالعهد',
    ],
    "answer_index": 3,
  },
  {
    "id": 8,
    "question": "من علامات النفاق ؟",
    "options": [
  'أن تدَّعي شيئا وتطبقه',
  'أن تدَّعي في الناس شيئا وهو ليس فيهم',
  'أن تدعي شيئا ولا تطبقه',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "معني (اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ) أن تطلب من الله ....",
    "options": [
  'الهداية للإسلام',
  'التوفيق للعمل الصالح',
  'الزيادة والثبات',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "فساد النية سبب لبطلان العمل حتي لو كان العمل صالحاً؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "من دلالات النبوة......",
    "options": [
  'أكل الصدقة وعدم أكل الهدية وخاتم النبوة',
  'أكل الهدية وعدم أكل الصدقة وخاتم النبوة',
  'خاتم النبوة وأكل الهدية',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "الثلاثة الذين سدت الصخرة عليهم الغار نجوا بــ .....",
    "options": [
  'بقوة أجسادهم في إزاحتها',
  'بصدقهم في دعائهم لله بصالح أعمالهم',
  'بكثرة بكائهم',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "(وَلَوْ أَرَادُوا الْخُرُوجَ لَأَعَدُّوا لَهُ عُدَّةً) قيلت هذه الآية في .......",
    "options": [
  'المنافقين',
  'المؤمنين',
  'اليهود',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahTwo =
[
  {
    "id": 1,
    "question": "إذا اجتمعت الرؤية مع الخبر تحول اليقين من علم إلي حق؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "القوة التي تدفعك للسير إلي الله هي ...",
    "options": [
  'الشك',
  'اليقين',
  'الصدق',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "إذا تزوج الصبر مع اليقين ولد بينهما ....",
    "options": [
  'النبوة',
  'الإمامة',
  'الشهادة',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "الدرجة العليا من اليقين هي ..",
    "options": [
  'الإيمان',
  'الإسلام',
  'الإحسان',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "يصل الإنسان لليقين بـــ",
    "options": [
  ' بكثرة الدعاء',
  ' بكثرة قراءة القرآن بتدبر',
  ' بكثرة مطالعة سيرة النبي والسلف والتشبه بأخلاقهم وافعالهم',
  ' جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "تذكر الجنة والنار من الأسباب التي تجعلك تخشع في الصلاة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "يأتي علم اليقين بكثرة..",
    "options": [
  'الرؤية',
  'العلم',
  'الطمأنينة',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "كثرة الصدقة سببا لزيادة الرزق؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "قد يكون الإنسان صادق في طلبه سلوك الطريق إلى الله ولكن قد يعطله ضعف اليقين؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "اليقين يعينك على ..",
    "options": [
  'الصبر عن المعصية',
  'الصبر على الطاعة',
  'الصبر على أقدار الله',
  'جميع ماسبق',
    ],
    "answer_index": 3,
  },

  {
    "id": 11,
    "question": "من أسباب زيادة اليقين كثرة الدعاء والإكثار من قراءة القرآن بتدبر؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "من الأشياء المُعِينة لك لتكون سريع في الطاعة وبطيئ في المعصية ...",
    "options": [
  'قراءة قصص حسن الخاتمة',
  'قراءة قصص سوء الخاتمة',
  'الإجابتان صحيحتان',
  'لا توجد إجابة صحيحه',
    ],
    "answer_index": 2,
  },
  {
    "id": 13,
    "question": "على الإنسان أن يُزيد يقينه حتى يوزن الأمور بميزانها الحقيقي فيرى صفحة القرآن خير من الدنيا وما فيها ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "يقيننا أن الله هو الرزاق يجعلنا نُعرض عن العمل والسعي ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "قول الله تعالى: (نَحْنُ قَسَمْنَا بَيْنَهُم مَّعِيشَتَهُمْ فِي الْحَيَاةِ الدُّنْيَا) يجعلك تترك الحسد وتعلم بأن القسمة من عند الله ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahThree =
[
  {
    "id": 1,
    "question": "العزيمة في سلوك الطريق إلى الله تأتي من اليقين؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "الحل الوحيد لأن تَسلم في طريقك إلى الله ان يكون عندك دقة مع نفسك؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "كل إنسان غافل عن محاسبة نفسه سيخسر؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من يترك نفسه ولا يتابعها تكون نفسه حينئذٍ....",
    "options": [
  'لوامة',
  'أمارة بالسوء',
  'مطمئنة',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "بداية التغير تبدأ من الاعتراف ان هناك خلل؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "إن أحسست بالرضا عن نفسك في أداء عبادتك فاعلم انك ستزيد ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "معرفة أن النفس غير جديرة بالجنة تعينها علي التوبة ....؟؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من مفسدات العمل الصالح بعد عمله ....",
    "options": [
  'العُجب',
  'المن',
  'الكبر',
  'جميع ماسبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": "إحسان الظن بالنفس بداية لطريق إصلاحها..",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "في محاسبة نفسك قبل العمل لابد ان تختار العمل...",
    "options": [
  'الصالح',
  'المباح',
  'الأهم',
  'الإجابتان الأولي والثالثة',
    ],
    "answer_index": 3,
  },

  {
    "id": 11,
    "question": "مما يعين على محاسبة النفس الصاحب الصالح الذي لا يدلك على عيوبك؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "في عمل المباحات كالأكل والنوم مثلا لابد من احتساب نوايا صالحة كي تتحول المباحات إلى عبادات تُؤجر عليها؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "عندما تقيم أداء نفسك بعد العمل الصالح لا بدّ من إعطائها علامة كاملة حتي تستجيب لغيرها من الأعمال...",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "العاجز هو ..",
    "options": [
       'من اتبع هوي نفسه',
       'من دان نفسه وعمل لما بعد الموت',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "النفس تميل لإيثار الدنيا علي الآخرة ..",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahFour =
[
  {
    "id": 1,
    "question": "مما يساعد علي المحاسبة ،  ذكر خصال النفس الحسنة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " لابدّ عند محاسبة النفس أن نهلكها في المحاسبة كي تتقدم وتعمل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "التوبة ليس لها مكان محدد في الطريق إلي الله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": " التألم من الذنب يدل علي",
    "options": [
  'نعمة الله عليك',
   'سخط الله عليك',
   'سوء خاتمتك',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": " الندم أول طريق للتوبة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " أكمل درجات الذكر",
    "options": [
  'القول باللسان',
  'القول بالقلب',
   'القول بالقلب ثم يتبعه اللسان',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "عندما تعزم علي التوبة من الذنب وتحدد ميعاد الرجوع إليه هل توبتك تكون كاملة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "الدافع الأساسي للتوبة ",
    "options": [
      ' تحقيق السعادة',
      '. ابتغاء وجه الله',
      'تحقيق الغني في الرزق',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "الذي يعينك علي التوبة",
    "options": [
      ' التأمل في عظمة الله',
      'استصغار الذنب',
      'الاستهتار بالذنب',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "تذكر حلاوة الذنب شرط لقبول التوبة ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },

  {
    "id": 11,
    "question": "من آداب التوبة أن نتهم أنفسنا بعدها ولا نركن لها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "الاستهتار بالذنب كبيرة من الكبائر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "وقوع العبد في الذنب مرارا بعد التوبة تدل على عدم قبول التوبة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": ".من كان يعتقد بصلاح نفسه وحسن الظن بها فهو",
    "options": [
  'علي خطر',
  'علي خير كبير',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahFive =
[
  {
    "id": 1,
    "question": "أكبر ذنب بعد الكفر هو ....",
    "options": [
      'الزنا',
      'القتل',
      'الربا',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "عندما يهديك الله لطريقه لا بدّ من التدرج في الطاعة والتدرج في ترك المعصية ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "قصة الرجل الذي قتل مائة نفس تفتح باب....",
    "options": [
      'الطموح',
      'الرجاء',
      'الكرم',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "العامل المشترك للتائبين هو....",
    "options": [
  'قيام الليل',
  'حفظ القرآن',
  'الإجابتين معآ',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "قصص التوبة تعلمك اسم الله ",
    "options": [
  'الغفار',
  'الستير',
  'الحليم',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "من الاشياء التي تساعدك على التوبة قيام الليل؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من علامات قبول التوبة ان يكون العبد بعد التوبة خير مما كان قبل التوبة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "المواظبة على قيام الليل علامة التائبين؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "الدنيا سجن المؤمن؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "أي إنسان يشعر انه سيموت قبل موته؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },

  {
    "id": 11,
    "question": "رُب طاعة ادخلت صاحبها النار، ورُب معصية ادخلت صاحبها الجنة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "أنجح حالات التوبة هي التي كانت حاسمة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "لو رأيت ان الله وفقك للصلاة  والتوبة فاعلم انه يريدك؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "من قام الليل بـ........لم يُكتب من الغافلين",
    "options": [
      'مائة آية',
      'عشر آيات',
      'ألف آية',
    ],
    "answer_index": 1,
  },
];
























const List pathToAllahSix =
[
  {
    "id": 1,
    "question": "التوبة تأتي بعد محاسبة النفس علي ترك الفروض وارتكاب المحرمات ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "لا بد من بدء الطريق بعبادة قوية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "إذا صلحت الصلاة صلح سائر العمل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من شروط جملة العمل عبادة أن ...",
    "options": [
  'العمل يكون حلال',
  'النية في العمل تكون صالحة',
  'أن يمنع العمل من الصلاة',
   '1، 2 معا' ,
    ],
    "answer_index": 3,
  },
  {
    "id": 5,
    "question": "ذروة سنام الإسلام....",
    "options": [
      'الجهاد',
      'الصلاة',
      'الزكاة',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " في الإسلام تشرع صلاة الخوف؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "القيام إلي الصلاة بكسل هو من صفات ......",
    "options": [
      'المؤمنون',
      'المنافقون',
      'المشركين',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "اهم العبادات التي لابد ان نبدأ بإصلاحها والالتزام بها هي الصلاة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "في الطريق إلى الله نبدأ ب...",
    "options": [
      'التخلية ثم التحلية',
      'التحلية ثم التخلية',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "اتفقت كلمة المسلمين على ان تارك الصلاة المفروضة عمدا اشد عند الله من الزاني والسارق وشارب الخمر؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "من صلى لله ......يوما في جماعة يدرك التكبيرة الاولى كُتبت له براءتان؛ براءة من النار وبراءة من النفاق.",
    "options": [
      '20',
      '30',
      '40',
    ],
    "answer_index": 2,
  },
  {
    "id": 12,
    "question": "الالتزام بالصلاة سبب للحفظ من الشيطان؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "بدأ الطريق إلى الله بالالتزام بالصلاة وإصلاحها يختصر الطريق جداا؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "أثقل صلاة على المنافقين؟",
    "options": [
     ' الفجر والعصر',
     ' الفجر والعشاء',
      'المغرب والعشاء',
     ' الفجر والظهر',
    ],
    "answer_index": 1,
  },
];
















const List pathToAllahSeven =
[
  {
    "id": 1,
    "question": "إذا أحسنت الوضوء أحسنت الصلاة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "من توضأ وأحسن وضوءه و صلي صلاة خاشعة فإن ثوابها هو....",
    "options": [
      ' كفارة لما قبلها',
      'وجبت له الجنة',
      'كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "صلاح صلاتك تعني صلاح الأمة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "الأصل في صلاة الجماعة الإطالة وعندما ننفرد بالصلاة نخفف؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من الأسباب التي تعينك علي الخشوع في الصلاة .....",
    "options": [
   'ذكر الموت قبل الصلاة',
  'التدبر في السور التي تحفظها',
  'التغيير في الأدعية والسور',
   'كل ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "علي حسب إقبالك علي الله في الصلاة يكون إقباله عليك ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "قول الله تعالي : (مالك يوم الدين) يفيد",
    "options": [
   'تمجيد وتعظيم الله ',
   'الثناء علي الله بقدرته',
   'طلب الاستعانة بالله',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "تكبيرة الإحرام تطهر قلبك من الكبر ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "أولى الانطلاقات العملية في الطريق إلى الله هي",
    "options": [
      'الصدق',
      'الصلاة',
      'اليقين',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "حركة البدن في الطريق إلى الله هي فرع عن قوة إنطلاقة القلب؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "اول نصيحة للخشوع في الصلاة هي الطمأنينة والتأني؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "مفتاح الصلاة الوضوء؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "من الممكن ان تخرج من الوضوء وقد غُفرت جميع ذنوبك ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": ".........تصرف عنك المانع من الفهم والتدبر ،و .........تجلب لك العون على الفهم والتدبر",
    "options": [
      'البسملة ،الاستعاذة',
      'الاستعاذة ،البسملة',
    ],
    "answer_index": 1,
  },
];
















const List pathToAllahEight =
[
  {
    "id": 1,
    "question": "كلما ضعف الفقر إلي الله ...",
    "options": [
      'تأخر الأداء',
      'زاد انكسارك لله',
      'وصلت إلي مرادك',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "معني قضي نحبه في الآية * مِّنَ ٱلْمُؤْمِنِينَ رِجَالٌ صَدَقُواْ مَا عَٰهَدُواْ ٱللَّهَ عَلَيْهِ ۖ فَمِنْهُم مَّن قَضَىٰ نَحْبَهُۥ وَمِنْهُم مَّن يَنتَظِرُ ۖ وَمَا بَدَّلُواْ تَبْدِيلًا *",
    "options": [
      ' توفاهم الله',
      ' وفوا بما عاهدوا',
      'أخلفوا وعدهم',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "تفسير العلماء لقول رسول الله صلي الله عليه وسلم *أفلح إن صدق*",
    "options": [
  ' لو عمل بما قال سيفلح',
   'لو صدق في الفرائض سيوفق في النوافل',
  ' كل ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "مَن الثلاثة الذين خُلفوا عن غزوة ..... هم .....",
    "options": [
  ' تبوك ، كعب بن مالك وهلال بن أمية وسلمان الفارسي',
   'تبوك ، هلال بن أمية وكعب بن مالك ومرارة بن الربيع',
  ' بدر ، كعب بن مالك وهلال بن أمية ومرارة بن الربيع',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "كثرة عملك لله تدل علي قوة صدقك معه؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "لكي تلتزم بكل معاني الدين لا بدّ من...",
    "options": [
      'الإخلاص',
      'الصدق',
      'كل ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "إذا خالف الإيمان بالغيب رؤيتك للشئ يجب أن تصدق رؤيتك",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "عندما تلامس الشئ وتتحقق منه يسمي حينئذ",
    "options": [
      'حق اليقين',
      'عين اليقين',
      'علم اليقين',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "اليقين يعينك علي .....",
    "options": [
      'الصبر',
      'الثبات',
      'كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "قصص السلف تعلمك ألا تقع في الفتنة بل تري ما وراءها من العقوبة ..",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "اليقين في وصف بن القيم * هو من الإحسان بمنزلة الروح من الجسد* العبارة",
    "options": [
      'صحيحة',
      'خاطئة',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": " اليقين سببا للهم والحزن؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "الاعتراف بالذنب في الآخرة أهون من الدنيا؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "محاسبة النفس ومعرفة قصورها من أسباب استقامتها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "استحضار نتيجة المحاسبة في الدنيا سبب من أسباب الإعانة علي محاسبة النفس",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "شُرع لنا الشكر بعد الصلاة ....",
    "options": [
      'لتيسير المزيد من الأعمال الصالحة',
      ' لتقصير النفس',
    ],
    "answer_index": 0,
  },
  {
    "id": 17,
    "question": "من أسباب دمار الأعمال الصالحة ...",
    "options": [
  ' العجب',
  ' الكبر',
  ' المن',
  ' كل ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 18,
    "question": " لا بدّ من تجديد النوايا في الأعمال المباحة حتي تصبح عبادات لا عادات؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 19,
    "question": "ترفع الأعمال إلي الله يومي الاثنين والخميس؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "عندما يوفقك الله لمن يدلك علي الطريق إليه تكون هذه من علامات رضاه عنك ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 21,
    "question": "من علامات قبول التوبة أن تكون قبل التوبة خير مما بعد التوبة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 22,
    "question": "ينزل الله إلي السماء الدنيا في",
    "options": [
  ' الثلث الأول من الليل',
  ' عند الشروق',
  ' الثلث الأخير من الليل',
    ],
    "answer_index": 2,
  },
  {
    "id": 23,
    "question": "من الأمور التي تساعدك علي التوبة ...",
    "options": [
  ' قيام الليل',
  ' تري ثمار الطاعة وثمار المعصية',
  ' الإحسان إلي الناس ونفعهم',
  ' جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 24,
    "question": "إذا أردت أن تسلك طريق التوبة عليك مجالسة ",
    "options": [
  ' المذنبين',
  ' التائبين',
  ' كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 25,
    "question": "من رحمة الله بالعباد التائبين أن يبعث إليهم بالمبشرات التي تثبتهم ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 26,
    "question": "الصلوات الخمس لا تكفر عن الذنوب السابقة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 27,
    "question": "أحب شئ إلي الله القيام بالفرائض",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 28,
    "question": "إلي حديثي العهد بالالتزام لا بد من تركيزه علي القرآن فقط",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 29,
    "question": "تارك الصلاة أهون عند الله من الزاني والسارق؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 30,
    "question": " من لحق الصلاة من التكبيرة الأولي لمدة أربعين يوما أخذ ...",
    "options": [
  ' براءة من النار',
  ' براءة من النفاق',
  ' كلاهما',
    ],
    "answer_index": 2,
  },

  {
    "id": 31,
    "question": "إذا نجيت من النفاق في الدنيا سيكون من المستحيل أن تسجد لله تعالي يوم القيامة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 32,
    "question": "من هم المعذبون في سقر؟",
    "options": [
  ' الزناة'
  ' تاركين الصلاة '
  ' السارقين'
    ],
    "answer_index": 1,
  },
  {
    "id": 33,
    "question": "إذا أحسنت الوضوء أحسنت الصلاة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 34,
    "question": "صلاتك تؤثر علي أهلك وأولادك ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 35,
    "question": "لابد لك من تحقيق الصدق ان تكون فقير إلي الله ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahNine =
[
  {
    "id": 1,
    "question": "خشوع النفاق ان يكون الجسد خاشع والقلب ليس بخاشع ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "خشوع القلب لابد ان يكون معه خشوع الجوارح؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "يتفاوت الخشوع في القلوب بحسب تفاوت معرفتها لله وصفاته؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "لا يكتب من صلاة المرء إلا ما عقل منها؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": ".......يدمر الصلاة قبلها ، و ....... يدمر الصلاة بعدها",
    "options": [
  'الرياء ، العُجب',
  'العُجب ، الرياء',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "ما هي السورة التي يجيبك فيها رب العزة؟",
    "options": [
  ' البقرة',
  ' الفاتحة',
  ' السجدة',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "*الرحمن الرحيم* هذه الآية مقام",
    "options": [
  ' الخوف',
  ' الرجاء',
  ' إجلال وتعظيم',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "*إياك نعبد* هذه الآية علاج لـ",
    "options": [
  ' الكبر',
  ' الرياء',
  ' العُجب',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "الذين علموا الحق وتركوه علي علم قال عنهم النبي أنهم",
    "options": [
  ' النصاري',
  ' اليهود',
  ' المنافقين',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "أشرف مقامات الصلاة هي",
    "options": [
  ' الركوع',
  ' السجود',
  ' الوقفة بين الركعات',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "التحيات لله تعني الحياء من الله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "من رحمة الله بالنبي أن يرفع قدره ويزيده من فضله ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "الصلاة علي سيدنا إبراهيم وعلي آله تعني نقص في الصلاة علي النبي",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "فتنة المحيا والممات سبب لعذاب النار والقبر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahTen =
[
  {
    "id": 1,
    "question": " فُرِض قيام الليل لمدة سنة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "قيام الليل سبب لمحبة الله لك؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "يعتبر قيام الليل احد اساسيات الطريق إلى الله لأنه .....",
    "options": [
  'دليل على انك تحب الله',
  'يحميك من النفاق',
  'بشرى على انك مخلص',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 4,
    "question": " قيام الليل يساعدك على مقاومة الفتن والشهوات ويعطيك القوة في فعل العبادات ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "أحد أسباب الكسل عند قيام الليل ...",
    "options": [
  'حب الدنيا',
  'الزهد في الاخرة',
  'الاثنين معا',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": " شرف المؤمن هو قيام الليل؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من فوائد قيام الليل انه يعطيك الشفاعة يوم القيامة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من قام الليل بمائة آية كتب من القانتين؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "كان النبي صلى الله عليه وسلم إذا فاته قيام الليل قضاه ما بين الضحى إلى الظهر وكان يزيد ركعة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "أثقل صلاة علي المنافقين",
    "options": [
  ' صلاة الفجر',
  ' صلاة الظهر',
  ' صلاة الفجر والعشاء',
    ],
    "answer_index": 2,
  },
  {
    "id": 11,
    "question": "تدبر القرآن هو أن تري حالك مع كل آية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "مرض العُجب والكبرياء من أسباب إبطال قيام الليل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "التعرض المستمر للقرآن يأتيك بثماره",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": " قراءة آية الكرسي قبل النوم تساعدك في الاستيقاظ في قيام الليل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "كلما تقربت إلي الله يزداد ركونك إلي نفسك اطمئنانا لكمال عملك",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];
















const List pathToAllahEleven =
[
  {
    "id": 1,
    "question": "ما الذي صنع الصحابة؟",
    "options": [
' القرآن',
' تربية النبي',
' كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "يقتصر القرآن على التلاوة والحفظ وهذا مدحه السلف؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "حفظ سيدنا عمر بن الخطاب سورة البقرة في اثنتي عشرة عاما لأنه ...",
    "options": [
  ' بطيء الحفظ',
  ' للعمل به',
  ' لقراءته آية آية',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "قضية القرآن قضية علم وعمل ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "أرجي آية في كتاب الله هي",
    "options": [
   "إِنَّ اللَّهَ يَأْمُرُ بِالْعَدْلِ وَالْإِحْسَانِ",
   "قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ",
   "فَمَن يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَهُ",
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "الصحابي الذي جمع القرآن الكريم هو",
    "options": [
  ' معاذ بن جبل'
  ' زيد بن ثابت'
  'أنس بن مالك'
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من يريد الالتزام يصاحب القرآن",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "*وَمِنْهُمْ أُمِّيُّونَ لَا يَعْلَمُونَ الْكِتَابَ إِلَّا أَمَانِيَّ* قال العلماء معني أماني هنا",
    "options": [
      'أحلام',
      'قراءة',
      'أمنيات',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "تحويل القرآن الآيات إلي تطبيق عملي كان يؤثر في سلوك الصحابة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "الإنسان لن يطبق الأحكام في القرآن إلا إذا علا إيمانه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahTwelve =
[
  {
    "id": 1,
    "question": "من أساسيات الطريق إلي الله مصاحبة القرآن ومحبته؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "مصادر إنطلاق الصحابة للنجاح في فتح العالم ....",
    "options": [
  ' القرآن',
  ' المعلم وهو الرسول صل الله عليه وسلم',
  ' كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "مشكلتنا في قراءة القرآن في الكمية وليست الكيفية...؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "سبب أي فشل هو ...",
    "options": [
  ' ضعف الرغبة',
  ' ضعف الإرادة',
  ' ضعف العلم بالشئ',
  ' جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 5,
    "question": "*وَذَكِّرْ فَإِنَّ الذِّكْرَىٰ تَنفَعُ الْمُؤْمِنِينَ* جاءت الذِّكْرَىٰ بمعني...",
    "options": [
  ' القرآن',
  ' التذكرة',
  ' أحاديث النبي',
  'أخرى',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "مدارسة القرآن من أسباب تغيير الصحابة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "لا بد من التعامل مع القرآن بإصغاء ولا يهم حضور القلب؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "معني التدبر ...",
    "options": [
   'التفكر والتأمل',
   'الإتباع',
  'كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "من مدمرات القلوب",
    "options": [
  ' الذنوب المتعلقة بشهوة النساء',
  ' المعازف والغناء',
  ' كل ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "لا يجوز الجهر بالقرآن ولا التغني به ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];
















const List pathToAllahThirteen =
[
  {
    "id": 1,
    "question": "سوء الخلق سببا في رد العمل الصالح ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " حسن الخلق  لا يُعوض النقص في العبادات ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "حسن الخلق يجعلك من أحب الناس إلي النبي صل الله عليه وسلم مقامًا ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "علم كثير مع أدب قليل خير من علم قليل مع أدب كثير ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "*الكبر بطر الحق وغمط الناس * ما معني بطر ؟",
    "options": [
  ' احتقار',
  ' رفض',
  ' قبول',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "ما معني غمط ؟",
    "options": [
  ' رفض',
  ' احتقار',
  ' ذل',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " الملتزم معصوم من الأفعال الخاطئة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "كثرة الضحك مفيدة للقلب ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": " الإخلاف بالوعد من حسن الخلق ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "الزوجة والوالدين من أهم الناس الواجب إظهار حسن الخلق لهم ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahFourteen =
[
  {
    "id": 1,
    "question": " بر الوالدين يتعارض مع الالتزام ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "طاعة الوالدين تفتح بابين من أبواب الجنة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "عقوق الوالدين من أكبر الكبائر؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "إذا استدعي إنكار المنكر للوالدين يمكن أن يصل لليد أحيانا ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "اللحية والنقاب ليسوا الدين كاملاً بل جزء من الدين ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "عندما تصدق مع الله في الطلب ييسره لك مهما كان طلبك ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "الاهتمام بشكل الالتزام أهم من تطبيق عوامل الالتزام ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " الأسرة الغير ملتزمة قوية الإيمان بالله ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من وقر أباه طال عمره ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "الفشل الدراسي سبب من أسباب كره الأهل الالتزام ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "أبو هريرة لم يحج بسبب بره لأمه حتي ماتت؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "إدخال السرور على الوالدين ليست عبادة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];
















const List pathToAllahFifteen =
[
  {
    "id": 1,
    "question": " لا بد للدخول في الطريق إلي الله أن تُحجم سقف طموحاتك الدينية ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "يبدأ الميل عن الطريق عندما تري النفس أنها تعمل شيئا عظيما بنفسها ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "الالتزام الجاد لا يغير التصورات ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " من هو أفضل ثالث رجل عند الله سبحانه وتعالى؟",
    "options": [
   'سيدنا محمد عليه الصلاة والسلام',
   'سيدنا موسي عليه السلام',
  'سيدنا عيسي عليه السلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "يحتاج الطريق إلي الله ...",
    "options": [
  ' قوة علمية',
  ' قوة عملية',
  ' كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": " القوة العلمية في الطريق تكمن في السرعة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "عندما تحترق لشئ دنيوي فاعلم إنك دني الهمة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "ساقط الهمة ليس مذموما عند الله ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "ارتبطت الرجولة في القرآن بمواقف الهمم الدنية ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "عندما تطلب من الله شيئا اطلبه بقدرة الله وليس بحدود منظورك ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": " صاحب الهمة العالية يحافظ علي أوقاته ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "ذكر الموت يجعلك همتك قليلة ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];
















const List pathToAllahSixteen =
[
  {
    "id": 1,
    "question": "لا يلزم تعلم العلم الشرعي ويقتصر الالتزام بمجرد دخول الطريق؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "عدم وضوح الهدف لطلب العلم من إشكالات الزهد فيه؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " (طلب العلم فريضة علي كل مسلم) .. فريضة هنا تعني ما يحتاج من العلم وما لا يحتاجه ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " أولو العلم لهم منزلة كبيرة عند الله لعظم شأن علم الله ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "طلب العلم لا يلزم له نية ليصح ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " العلم يورث الخشية ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "تضع الملائكة أجنحتها لطالب العلم لعظم ما يتعلمه ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "مجلس علم واحد يكفر سبعين مجلسا من مجالس اللهو ...؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "العالم ليس له قيمة بدون العابد ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "مسألة طلب العلم اختيارية؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "الجاهل بالعلم أسرع الناس بالخصومات ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahSeventeen =
[
  {
    "id": 1,
    "question": "حب الله لا يُنال إلا بمعرفته ومعرفة الله لا تُنال إلا بطلبك العلم؟هذه العبارة",
    "options": [
      'صحيحة',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "تصحيح النية ليس شرطاً لبدء طلب العلم؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": " أحياناً يكون طلبك للعلم سببا للبعد عن الله؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من أعظم النيات لطلب العلم هي أن يُقال لك عالماً؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "طلب علم العقيدة فرض عين علي كل مسلم؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "إذا فتح الله لك باب الجدال في بداية الطريق يكون راضٍ عنك؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "لا بد عند طلبك للعلم أن تحدد الهدف منه ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "تعلم الأدب ينفعك قبل تعلم العلم ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "العمل قرين العلم؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "تُحرم بركة العلم إذا لم تعمل بما تعلم؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "الذنوب تؤثر على طلب العلم؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahEighteen =
[
  {
    "id": 1,
    "question": " الحمد والاستغفار يساعدك علي التدبر؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "صلاة قيام الليل  عند الله أفضل من صلاة الفرائض ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من الأسباب المعينة الاستيقاظ في قيام الليل؟ ",
    "options": [
  ' النوم علي وضوء',
  ' قراءة أذكار النوم',
  ' الفقر إلي الله والتوكل عليه',
  ' جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 4,
    "question": "من نوي أن يصلي قيام الليل وفاتته يكتب له أجر ......",
    "options": [
  ' أجر النوم',
  ' أجر القيام',
  ' أجر القيام والنوم',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": " يلزم أن يملك الملتزم ...",
    "options": [
  ' قوة علمية',
  ' قوة عملية',
  ' الاثنان معا',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": " كيفية الوصل للهمة العالية؟",
    "options": [
  ' الزهد فى الدنيا',
  ' الحفاظ على الوقت',
  ' مصاحبة أصحاب الهمم العالية',
  ' جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "ذكر الموت",
    "options": [
  ' يوقفك عن العمل',
  ' يُعلِّى همتك',
  ' الاثنان معا',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "رؤية همة العجوز يثبط همتك؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "همة أهل الضلال....",
    "options": [
  ' تقلل همتك',
  ' تزيد همتك',
  ' لا تُؤثر فى همتك',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "*سِيمَاهُمْ فِي وُجُوهِهِم مِّنْ أَثَرِ السُّجُودِ* ما هو أثر السجود",
    "options": [
  ' أثر الخشوع',
  ' أثر البركة',
  ' كلاهما',
    ],
    "answer_index": 2,
  },

  {
    "id": 11,
    "question": "*إِنَّ نَاشِئَةَ اللَّيْلِ هِيَ أَشَدُّ وَطْئًا وَأَقْوَمُ قِيلًا*  ما معني أشد وطئاً",
    "options": [
  'توافق القلب مع البدن',
  'توافق القلب مع العقل',
  'توافق العقل مع البدن',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "قراءة القرآن الأقرب للتأثر والتدبر...",
    "options": [
  ' التحقيق',
  ' الترتيل',
  ' الحدر',
  ' غير ذلك',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": " قراءة القرآن بصوت خفى وبغير تغن أقرب للتأثر والتدبر ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": " ترك الأدب يوجب ...",
    "options": [
  ' الحب',
  ' الطرد',
  ' القوة',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "*المزاح في آيات الله كفر بالله *العبارة",
    "options": [
  ' صحيحة',
  'خاطئة',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": " أشرف النوافل كما يقول الفقهاء",
    "options": [
  ' الرواتب',
  ' طلب العلم',
  ' صيام السنة',
    ],
    "answer_index": 1,
  },
  {
    "id": 17,
    "question": " تصحيح النية يكون فى ...",
    "options": [
  ' بداية الطريق',
  ' وسط الطريق',
  ' دائما',
    ],
    "answer_index": 2,
  },
  {
    "id": 18,
    "question": "بقاء العالِم ",
    "options": [
  ' بقدر ما يحتويه من العلم',
  ' بقدر ما يحتويه من العبادة والأدب والإخلاص',
  ' جميع ما سبق',
  ' غير ذلك',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "(طلب العلم فريضة علي كل مسلم) .. فريضة هنا تعني ما يحتاج من العلم وما لا يحتاجه ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 20,
    "question": " أولو العلم لهم منزلة كبيرة عند الله لعظم شأن علم الله ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 21,
    "question": "علو الهمة تأتى من مقارنة نفسك بأصدقائك القُدامى؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 22,
    "question": "الالتزام الحقيقى يغير الفكر ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 23,
    "question": "الرجولة مرتبطة فى القرآن بالهمة العالية ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 24,
    "question": "التفسير يعين علي التدبر؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 25,
    "question": "عندما تحسن البسملة فهي تعينك علي طلب الفهم من الله علي آيات القرآن...؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 26,
    "question": "من أنفع وسائل تحديد الثغر الذي أنفع به بأسرع وقت ..",
    "options": [
  ' بالاعتماد على النفس',
  ' باستشارة الشيخ والاصحاب',
  ' بالتجربة',
    ],
    "answer_index": 1,
  },
  {
    "id": 27,
    "question": "قال تعالى:(أَنَّهُ مَنْ عَمِلَ مِنكُمْ سُوءًا بِجَهَالَةٍ ثُمَّ تَابَ مِن بَعْدِهِ وَأَصْلَحَ فَأَنَّهُ غَفُورٌ رَّحِيمٌ) المقصود بالجهالة",
    "options": [
  ' جهالة أن السوء سوء',
  ' الجهل بالله وقدره',
  ' الاثنان معا',
  ' غير ذلك',
    ],
    "answer_index": 1,
  },
  {
    "id": 28,
    "question": "هل يلزم طالب العلم الحفظ ؟",
    "options": [
      'نعم',
      'لا',
    ],
    "answer_index": 0,
  },
  {
    "id": 29,
    "question": "ثواب العبادة في غفلة الناس أفضل من ثوابها في استدراك الناس؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 30,
    "question": " الأخلاق السيئة لا تظهر إلا في حالة الرضا؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },

  {
    "id": 31,
    "question": "من صدق الاخلاق رد الدين ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 32,
    "question": " الشيء الوحيد الذى طلب الله من الرسول ﷺ أن يستزيد منه",
    "options": [
  ' التقوى',
  ' العلم',
  ' الرفعة',
  ' غير ذلك',
    ],
    "answer_index": 1,
  },
  {
    "id": 33,
    "question": "المعركة الأساسية بين الشيطان والانسان هى الذكر والنسيان ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 34,
    "question": " كيد الشيطان....",
    "options": [
      'قوى',
      'ضغيف',
    ],
    "answer_index": 1,
  },
  {
    "id": 35,
    "question": " لماذا يفوز الشيطان على الإنسان؟",
    "options": [
  ' قوة كيد الشيطان',
  ' ضعف سلاح الإنسان',
  ' عدم استخدام الإنسان للسلاح بطريقة صحيحة',
    ],
    "answer_index": 2,
  },
];
















const List pathToAllahNineteen =
[
  {
    "id": 1,
    "question": " القرآن هو من يحفظنا لا نحن من نحفظه ؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "القرآن سبب لجعل البيوت عامرة بذكر الله ؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "صاحب القرآن ينال....",
    "options": [
  ' الخيرية',
  ' صلاح القلب',
  'شفاء الصدر',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 4,
    "question": "صاحب القرآن أسعد الناس؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "من أسباب عدم حفظ القرآن",
    "options": [
  ' ضعف العزيمة',
  'عدم وجود خطة',
  'جميع ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "حب الله من أعظم الأسباب لحفظ كتابه ..؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من أعظم النيات لحفظ كتاب الله هو رؤية وجه الله سبحانه وتعالى؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "القرآن يمكن أن يكون سُلَّمك إلي الجحيم ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "أصفي الأوقات للقرآن يجب استغلالها في ...",
    "options": [
      'الحفظ',
      'القراءة',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "حل مشكلة المتشابهات هي المراجعة القليلة لها؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];
















const List pathToAllahTwenty =
[
  {
    "id": 1,
    "question": "وظيفة الداعية لا بد لها من مستويات من الالتزام للوصول إليها ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "تغيير أسلوب الداعية ليناسب عقول من يدعوهم هي من أهم الوسائل في الدعوة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "الدعوة ليس لها مكان ولا وسيلة محددة!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "الفلاح ارتبط بارتباط الإنسان بعمل الصالحات فقط ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "الدعوة إلي الله سببا في إصلاح القلب. ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "الابتلاء في العمل الدعوي يعجل موت الداعية؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "الكم في الدعوة أهم من الكيف ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "نجاح الداعية في أن يبلغ لا في النتيجة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "العمل بالدعوة هي التشبه بعمل الأنبياء ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "الداعية الذي لا يطلب أجرا على دعوته أكثر مصداقية عند الناس؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "الموازنة بين استخدام الخطاب القلبي والعقلي سببا في نجاح الداعية ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahTwentyOne =
[
  {
    "id": 1,
    "question": "استخراج منهج الدعوة يكون من القرآن الكريم؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "أهم شئ عند الداعية أن ينصلح ظاهره أمام الناس ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": " قضية التوحيد من أهم أسباب الانشغال بالدعوة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "أعظم ذنب عند الله.....",
    "options": [
   'الكذب',
  'الشرك',
   'عدم الصلاة',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "فساد العقيدة يؤدي إلي الدخول لجهنم ..؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "انطلاقة البداية في الدعوة تكون من الخارج إلي الداخل ...؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "ذكر الله من أسباب تثبيت الدعاة في دعوتهم ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "لا بد من التوازي بين تكميل نفسك وتكميل غيرك ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "أساسيات الدعوة هي الرفق والتواضع واللين ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " التوكل على الله من أسرار نجاح الداعية في دعوته؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
{
    "id": 11,
    "question": "قيام الليل يحل مشاكل الداعية ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
















const List pathToAllahTwentyTwo =
[
  {
    "id": 1,
    "question": "الإفراط على النفس في المحرمات قد يزين للإنسان طريق الإلحاد؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "من الأمور المشجعة على سلوك الطريق إلى الله اليقين بأن الدنيا أقصر مما تتخيل وأن الجنة أعظم وأطول مما تتخيل؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "السعادة الحقيقية  هي سعادة القلب في أن تكون عبدا لله؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "خلاصة الطريق إلى الله...",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "استقامة القلب تكون بـ...",
    "options": [
  'التأكد من سلامة الاعتقاد',
  'الاهتمام وتنمية أعمال القلوب',
  'تنمية حب الله في القلب واستحضار تقصيرك في حقه',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "التأمل في الكون من أسباب زيادة معرفة الله وحُبه؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من أهم أعمال الجوارح التي يجب الاهتمام بها في بداية الطريق إلى الله...",
    "options": [
  'الصلاة',
  'القرآن',
  'الاثنين معا',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "الصحبة الصالحة من الأمور المُعينة على الثبات في الطريق إلى الله؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];























const List pathToAllahTwentyThree =
[
  {
    "id": 1,
    "question": "تحقيق الصبر هو أسمي منازل مجاهدة النفس؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "التقرب إلى الله بالبدن يكون...",
    "options": [
  'بالقول',
  'بالفعل',
  'بالإنفاق',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 3,
    "question": "الصبر يكون على...",
    "options": [
  'فعل الطاعة',
  'ترك المعصية',
  'أقدار الله المؤلمة',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 4,
    "question": "من الأمور المعينة على الصبر في الطريق إلى الله العلم بأن الدنيا دار اختبار وليست دار قرار؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "الصدق أن تقول ما في قلبك ولو كان باطل؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "القنوت هو لزوم الطاعة مع الخضوع والتذلل إلى الله؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "القنوت قد يُطلق على الدعاء والاطالة في الصلاة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من مفاتيح النجاة...",
    "options": [
  'الخضوع لله',
  'التذلل لله',
  'جميع ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "التوسل المالي لله بأن تنفق في سبيل الله كالصدقة مثلا؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "أن تخالق الناس بخلق حسن هذا من تقوى الله؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "الإنفاق في سبيل الله بشتى صوره علامة على حسن الظن بالله؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "الاستغفار يعني طلب ستر الذنب؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "من مفاتيح النجاة أن ترى الكمال في عملك الصالح؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "الصبر يورث في الإنسان القوة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];


















//
// const List mohamed =
// [
//   {
//     "id": 1,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 2,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 3,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 4,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 5,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 6,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 7,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 8,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 9,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 10,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
// ];