const List infoQuranOne =
[
  {
    "id": 1,
    "question": "من النبي المقصود (فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانْتَصِرْ )",
    "options": [
      'أيوب',
      'يونس',
      'نوح',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "من النبي المقصود (فَنَادَى فِي الظُّلُمَاتِ أَنْ لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ)",
    "options": [
      'يونس',
      'صالح',
      'زكريا',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من النبي المقصود (قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَامٌ وَكَانَتِ امْرَأَتِي عَاقِرًا وَقَدْ بَلَغْتُ مِنَ الْكِبَرِ عِتِيًّا)",
    "options": [
      'زكريا',
      'يحيى',
      'إبراهيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من النبي المقصود (قَالَ رَبِّ أَرِنِي أَنظُرْ إِلَيْكَ ۚ )",
    "options": [
      'يونس',
      'موسى',
      'يوسف',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "من النبي المقصود (وَقَالَ رَبِّ أَوْزِعْنِي أَنْ أَشْكُرَ نِعْمَتَكَ الَّتِي أَنْعَمْتَ عَلَيَّ وَعَلَىٰ وَالِدَيَّ وَأَنْ أَعْمَلَ صَالِحًا تَرْضَاهُ وَأَدْخِلْنِي بِرَحْمَتِكَ فِي عِبَادِكَ الصَّالِحِينَ)",
    "options": [
      'سليمان',
      'يحيى',
      'موسى',
    ],
    "answer_index":0 ,
  },
  {
    "id": 6,
    "question": "من النبي المقصود (إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الشَّيْطَانُ بِنُصْبٍ وَعَذَاب)",
    "options": [
      'ذا النون',
      'أيوب',
      'زكريا',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من النبي المقصود (قَالَ سُبْحَانَكَ مَا يَكُونُ لِي أَنْ أَقُولَ مَا لَيْسَ لِي بِحَقٍّ ۚ إِن كُنتُ قُلْتُهُ فَقَدْ عَلِمْتَهُ ۚ تَعْلَمُ مَا فِي نَفْسِي وَلَا أَعْلَمُ مَا فِي نَفْسِكَ ۚ إِنَّكَ أَنتَ عَلَّامُ الْغُيُوبِ)",
    "options": [
      'موسى',
      'عيسى',
      'هارون',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من النبي المقصود (قَالَ إِنِّي جَاعِلُكَ لِلنَّاسِ إِمَامًا ۖ قَالَ وَمِن ذُرِّيَّتِي ۖ قَالَ لَا يَنَالُ عَهْدِي الظَّالِمِينَ)",
    "options": [
      'آدم',
      'إبراهيم',
      'محمد',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من النبي المقصود (وَأَنْ أَلْقِ عَصَاكَ ۖ فَلَمَّا رَآهَا تَهْتَزُّ كَأَنَّهَا جَانٌّ وَلَّىٰ مُدْبِرًا وَلَمْ يُعَقِّبْ ۚۚ)",
    "options": [
      'هارون',
      'يونس',
      'موسى',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "من النبي المقصود (اللَّهُمَّ رَبَّنَا أَنزِلْ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ تَكُونُ لَنَا عِيدًا لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ)",
    "options": [
      'موسى',
      'عيسى',
      'محمد',
    ],
    "answer_index":1 ,
  },
  {
    "id": 11,
    "question": "من النبي المقصود (وَلَٰكِن رَّسُولَ اللَّهِ وَخَاتَمَ النَّبِيِّينَ ۗ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا)",
    "options": [
      'محمد',
      'يوسف',
      'إبراهيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "من النبي المقصود (فَأَلْقَىٰ عَصَاهُ فَإِذَا هِيَ ثُعْبَانٌ مُبِينٌ)",
    "options": [
      'هارون',
      'موسى',
      'عيسى',
    ],
    "answer_index":1 ,
  },
  {
    "id": 13,
    "question": "من النبي المقصود (اسْكُنْ أَنْتَ وَزَوْجُكَ الْجَنَّةَ وَكُلَا مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلَا تَقْرَبَا هَذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ)",
    "options": [
      'آدم',
      'نوح',
      'إدريس',
    ],
    "answer_index":0 ,
  },
  {
    "id": 14,
    "question": "من النبي المقصود (فَأَوْحَيْنَا إِلَيْهِ أَنِ اصْنَعِ الْفُلْكَ بِأَعْيُنِنَا)",
    "options": [
      'نوح',
      'إبراهيم',
      'سليمان',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "من النبي المقصود (قَالَ رَبِّ إِنِّي وَهَنَ الْعَظْمُ مِنِّي وَاشْتَعَلَ الرَّأْسُ شَيْبًا وَلَمْ أَكُن بِدُعَائِكَ رَبِّ شَقِيًّا)",
    "options": [
      'إبراهيم',
      'أيوب',
      'زكريا',
    ],
    "answer_index": 2,
  },
  {
    "id": 16,
    "question": "من النبي المقصود (وَابْيَضَّتْ عَيْنَاهُ مِنَ الْحُزْنِ فَهُوَ كَظِيمٌ)",
    "options": [
      'آدم',
      'يعقوب',
      'ذا النون',
    ],
    "answer_index":1 ,
  },
  {
    "id": 17,
    "question": "من النبي المقصود (قَالَ إِنِّي عَبْدُ اللَّهِ آتَانِيَ الْكِتَابَ وَجَعَلَنِي نَبِيًّا)",
    "options": [
      'موسى',
      'عيسى',
      'محمد',
    ],
    "answer_index": 1,
  },
  {
    "id": 18,
    "question": "من النبي المقصود (قَالَ يَا أَبَتِ افْعَلْ مَا تُؤْمَرُ ۖ سَتَجِدُنِي إِن شَاءَ اللَّهُ مِنَ الصَّابِرِينَ)",
    "options": [
      'إسحاق',
      'إسماعيل',
      'يعقوب',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "من النبي المقصود (إنه كان صديقًا نبيًّا. ورفعناه مكانا عليا)",
    "options": [
      'إدريس',
      'نوح',
      'إبراهيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "من النبي المقصود ( وَحَنَانًا مِّن لَّدُنَّا وَزَكَاةً وَكَانَ تَقِيًّاوَبَرًّا بِوَالِدَيْهِ وَلَمْ يَكُن جَبَّارًا عَصِيًّا)",
    "options": [
      'يحيى',
      'يعقوب',
      'يوسف',
    ],
    "answer_index":0 ,
  },
];



const List infoQuranOneTwo =
[
  {
    "id": 1,
    "question": "من النبي المقصود (إِذْ نَادَى رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ)",
    "options": [
      'أيوب',
      'نوح',
      'زكريا',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "من النبي المقصود (إِذْ نَادَى رَبَّهُ نِدَاء خَفِيًّا)",
    "options": [
      'موسى',
      'زكريا',
      'أيوب',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من النبي المقصود (رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَى)",
    "options": [
      'موسى',
      'عيسى',
      'إبراهيم',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "من النبي المقصود (إِنَّا سَخَّرْنَا الْجِبَالَ مَعَهُ يُسَبِّحْنَ بِالْعَشِيِّ وَالْإِشْرَاقِ)",
    "options": [
      'داوود',
      'أيوب',
      'إبراهيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "من النبي المقصود (وَتَفَقَّدَ الطَّيْرَ فَقَالَ مَا لِيَ لا أَرَى الْهُدْهُدَ أَمْ كَانَ مِنَ الْغَائِبِينَ)",
    "options": [
      'سليمان',
      'داوود',
      'إبراهيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من النبي المقصود (إِنَّ ٱللَّهَ يَأۡمُرُكُمۡ أَن تَذۡبَحُواْ بَقَرَةٗۖ)",
    "options": [
      'صالح',
      'موسى',
      'إبراهيم',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من النبي المقصود (وَقَالَ ارْكَبُواْ فِيهَا بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا إِنَّ رَبِّي لَغَفُورٌ رَّحِيمٌ)",
    "options": [
      'نوح',
      'شعيب',
      'لوط',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من النبي المقصود (وَيَا قَوْمِ هَذِهِ نَاقَةُ اللَّهِ لَكُمْ آيَةً فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللَّهِ وَلاَ تَمَسُّوهَا بِسُوءٍ فَيَأْخُذَكُمْ عَذَابٌ قَرِيبٌ)",
    "options": [
      'صالح',
      'موسى',
      'إبراهيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "من النبي المقصود (قَالَ إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ وَأَعْلَمُ مِنَ اللَّهِ مَا لاَ تَعْلَمُونَ)",
    "options": [
      'ذا النون',
      'أيوب',
      'يعقوب',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "من النبي المقصود (يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ)",
    "options": [
      'إسماعيل',
      'يوسف',
      'يحيى',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "من النبي المقصود (قَالَ يَا قَوْمِ هَؤُلاء بَنَاتِي هُنَّ أَطْهَرُ لَكُمْ فَاتَّقُواْ اللَّهَ وَلاَ تُخْزُونِ فِي ضَيْفِي أَلَيْسَ مِنكُمْ رَجُلٌ رَّشِيدٌ)",
    "options": [
      'لوط',
      'لقمان',
      'شعيب',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "من النبي المقصود (أَتَدْعُونَ بَعْلا وَتَذَرُونَ أَحْسَنَ الْخَالِقِينَ)",
    "options": [
      'شعيب',
      'صالح',
      'إلياس',
    ],
    "answer_index": 2,
  },
  {
    "id": 13,
    "question": "من النبي المقصود (فَالْتَقَمَهُ الْحُوتُ وَهُوَ مُلِيمٌ)",
    "options": [
      'يونس',
      'موسى',
      'إبراهيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "من النبي المقصود (وَبَرًّا بِوَالِدَيْهِ وَلَمْ يَكُن جَبَّارًا عَصِيًّا)",
    "options": [
      'عيسى',
      'يحيى',
      'زكريا',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "من النبي القائل(قَالَ يَا ابْنَ أُمَّ لا تَأْخُذْ بِلِحْيَتِي وَلا بِرَأْسِي إِنِّي خَشِيتُ أَن تَقُولَ فَرَّقْتَ بَيْنَ بَنِي إِسْرَائِيلَ وَلَمْ تَرْقُبْ قَوْلِي)",
    "options": [
      'موسى',
      'هارون',
    ],
    "answer_index": 1,
  },
  {
    "id": 16,
    "question": "من النبي القائل(قَالَ يَا قَوْمِ اعْبُدُواْ اللَّهَ مَا لَكُم مِّنْ إِلَهٍ غَيْرُهُ وَلاَ تَنقُصُواْ الْمِكْيَالَ وَالْمِيزَانَ إِنِّيَ أَرَاكُم بِخَيْرٍ وَإِنِّيَ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ مُّحِيطٍ)",
    "options": [
      'شعيب',
      'صالح',
      'هود',
    ],
    "answer_index": 0,
  },
  {
    "id": 17,
    "question": "من النبي القائل (إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُم مَّا مِن دَابَّةٍ إِلاَّ هُوَ آخِذٌ بِنَاصِيَتِهَا إِنَّ رَبِّي عَلَى صِرَاطٍ مُّسْتَقِيمٍ)",
    "options": [
      'شعيب',
      'هود',
      'صالح',
    ],
    "answer_index": 1,
  },
  {
    "id": 18,
    "question": "من النبي القائل (وَلاَ تَيْأَسُواْ مِن رَّوْحِ اللَّهِ إِنَّهُ لاَ يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلاَّ الْقَوْمُ الْكَافِرُونَ)",
    "options": [
      'محمد',
      'يعقوب',
      'أيوب',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "من النبي المقصود (وَمَا قَتَلُوهُ وَمَا صَلَبُوهُ وَلَٰكِن شُبِّهَ لَهُمْ ۚ وَإِنَّ الَّذِينَ اخْتَلَفُوا فِيهِ لَفِي شَكٍّ مِّنْهُ ۚ مَا لَهُم بِهِ مِنْ عِلْمٍ إِلَّا اتِّبَاعَ الظَّنِّ ۚ وَمَا قَتَلُوهُ يَقِينًا)",
    "options": [
      'عيسى',
      'موسى',
      'يعقوب',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "من النبي المقصود (سُبْحَانَ الَّذِي أَسْرَى بِعَبْدِهِ لَيْلاً مِّنَ الْمَسْجِدِ الْحَرَامِ إِلَى الْمَسْجِدِ الأَقْصَى الَّذِي بَارَكْنَا حَوْلَهُ لِنُرِيَهُ مِنْ آيَاتِنَا إِنَّهُ هُوَ السَّمِيعُ الْبَصِيرُ)",
    "options": [
      'إبراهيم',
      'موسى',
      'محمد',
    ],
    "answer_index": 2,
  },
];




const List infoQuranOneThree =
[
   {
    "id": 1,
    "question": "(قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ رُءۡيَاكَ عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ)",
     "options": [
       '	نبي الله إبراهيم',
       '	نبي الله يعقوب',
       '	نبي الله نوح',
     ],
    "answer_index":1 ,
  },
   {
      "id": 2,
      "question": "(قَالَ رَبِّ ٱلسِّجۡنُ أَحَبُّ إِلَيَّ مِمَّا يَدۡعُونَنِيٓ إِلَيۡهِۖ وَإِلَّا تَصۡرِفۡ عَنِّي كَيۡدَهُنَّ أَصۡبُ إِلَيۡهِنَّ وَأَكُن مِّنَ ٱلۡجَٰهِلِينَ )",
      "options": [
        '	نبي الله موسى',
        '	نبي الله يونس',
        '	نبي الله يوسف',
      ],
      "answer_index": 2,
    },
   {
      "id": 3,
      "question": "(قَالَ رَبِّ إِنِّي دَعَوۡتُ قَوۡمِي لَيۡلٗا وَنَهَارٗا * فَلَمۡ يَزِدۡهُمۡ دُعَآءِيٓ إِلَّا فِرَارٗا )",
      "options": [
        '	نبي الله إدريس',
        '	نبي الله نوح',
        'نبي الله أيوب',
      ],
      "answer_index": 1,
    },
   {
      "id": 4,
      "question": "(قَالَ رَبِّ هَبۡ لِي مِن لَّدُنكَ ذُرِّيَّةٗ طَيِّبَةًۖ إِنَّكَ سَمِيعُ ٱلدُّعَآءِ)",
      "options": [
        '	نبي الله زكريا',
        '	نبي الله إبراهيم',
        '	نبي الله إسماعيل',
      ],
      "answer_index":0 ,
    },
   {
      "id": 5,
      "question": "(قَالَ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ صَابِرٗا وَلَآ أَعۡصِي لَكَ أَمۡرٗا )",
      "options": [
        '	نبي الله عيسى',
        '	نبي الله نوح',
        '	نبي الله موسى',
      ],
      "answer_index": 2,
    },
   {
      "id": 6,
      "question": "(قَالَ يَٰقَوۡمِ لَيۡسَ بِي سَفَاهَةٞ وَلَٰكِنِّي رَسُولٞ مِّن رَّبِّ ٱلۡعَٰلَمِينَ )",
      "options": [
        '	نبي الله شعيب',
        '	نبي الله هود',
        '	نبي الله صالح',
      ],
      "answer_index": 1,
    },
   {
      "id": 7,
      "question": "(قَالَ لِأَبِيهِ وَقَوۡمِهِۦ مَا هَٰذِهِ ٱلتَّمَاثِيلُ ٱلَّتِيٓ أَنتُمۡ لَهَا عَٰكِفُونَ )",
      "options": [
        '	نبي الله إبراهيم',
        '	نبي الله نوح',
        '	نبي الله صالح',
      ],
      "answer_index": 0,
    },
   {
      "id": 8,
      "question": "(قَالَ ٱبۡنَ أُمَّ إِنَّ ٱلۡقَوۡمَ ٱسۡتَضۡعَفُونِي وَكَادُواْ يَقۡتُلُونَنِي فَلَا تُشۡمِتۡ بِيَ ٱلۡأَعۡدَآءَ وَلَا تَجۡعَلۡنِي مَعَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ)",
      "options": [
        '	نبي الله يعقوب',
        '	نبي الله هارون',
        '	نبي الله يحيى',
      ],
      "answer_index": 1,
    },
   {
      "id": 9,
      "question": "(قَالَ لَا يَأۡتِيكُمَا طَعَامٞ تُرۡزَقَانِهِۦٓ إِلَّا نَبَّأۡتُكُمَا بِتَأۡوِيلِهِۦ قَبۡلَ أَن يَأۡتِيَكُمَاۚ ذَٰلِكُمَا مِمَّا عَلَّمَنِي رَبِّيٓۚ إِنِّي تَرَكۡتُ مِلَّةَ قَوۡمٖ لَّا يُؤۡمِنُونَ بِٱللَّهِ وَهُم بِٱلۡأٓخِرَةِ هُمۡ كَٰفِرُونَ)",
      "options": [
        '	نبي الله موسى',
        '	نبي الله سليمان',
        '	نبي الله يوسف',
      ],
      "answer_index": 2,
    },
   {
      "id": 10,
      "question": "(قَالَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ٱلۡحَوَارِيُّونَ نَحۡنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشۡهَدۡ بِأَنَّا مُسۡلِمُونَ )",
      "options": [
        '	نبي الله عيسى',
        '	نبي الله إدريس',
        '	نبي الله يونس',
      ],
      "answer_index": 0,
    },

  {
    "id": 11,
    "question": "(قَالَ يَٰقَوۡمِ أَرَهۡطِيٓ أَعَزُّ عَلَيۡكُم مِّنَ ٱللَّهِ وَٱتَّخَذۡتُمُوهُ وَرَآءَكُمۡ ظِهۡرِيًّاۖ إِنَّ رَبِّي بِمَا تَعۡمَلُونَ مُحِيطٞ)",
    "options": [
      '	نبي الله هود',
      '	نبي الله شعيب',
      '	نبي الله نوح',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": " ( فَعَقَرُوهَا فَقَالَ تَمَتَّعُواْ فِي دَارِكُمۡ ثَلَٰثَةَ أَيَّامٖۖ ذَٰلِكَ وَعۡدٌ غَيۡرُ مَكۡذُوبٖ )",
    "options": [
      '	نبي الله صالح',
      '	نبي الله محمد',
      '	نبي الله أيوب',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "(قَالَ رَبِّ إِنِّي قَتَلۡتُ مِنۡهُمۡ نَفۡسٗا فَأَخَافُ أَن يَقۡتُلُونِ )",
    "options": [
      '	نبي الله يوسف',
      '	نبي الله موسى',
      '	نبي الله يونس',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "(قَالَ لِقَوۡمِهِۦٓ أَتَأۡتُونَ ٱلۡفَٰحِشَةَ وَأَنتُمۡ تُبۡصِرُونَ *أَئِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ شَهۡوَةٗ مِّن دُونِ ٱلنِّسَآءِۚ بَلۡ أَنتُمۡ قَوۡمٞ تَجۡهَلُونَ)",
    "options": [
      '	نبي الله نوح',
      '	نبي الله إبراهيم',
      '	نبي الله لوط',
    ],
    "answer_index": 2,
  },
  {
    "id": 15,
    "question": "(قَالَ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ أَيُّكُمۡ يَأۡتِينِي بِعَرۡشِهَا قَبۡلَ أَن يَأۡتُونِي مُسۡلِمِينَ)",
    "options": [
      '	نبي الله سليمان',
      '	نبي الله هارون',
      '	نبي الله داوود',
    ],
    "answer_index": 0,
  },
];





const List infoQuranOneFour =
[
  {
    "id": 1,
    "question": " كان دعاء نبي الله آدم عليه السلام.....",
    "options": [
      '	قَالَا رَبَّنَا ظَلَمْنَا أَنفُسَنَا وَإِن لَّمْ تَغْفِرْ لَنَا وَتَرْحَمْنَا لَنَكُونَنَّ مِنَ الْخَاسِرِينَ',
      'إذ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ',
      '	لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": " كان دعاء نبي الله نوح عليه السلام.....",
    "options": [
      '	إذ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ',
      'رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ',
      '	رَّبِّ اغْفِرْ لِي وَلِوَالِدَيَّ وَلِمَن دَخَلَ بَيْتِيَ مُؤْمِنًا وَلِلْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ وَلَا تَزِدِ الظَّالِمِينَ إِلَّا تَبَارًا',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "كان دعاء نبي الله إبراهيم عليه السلام......",
    "options": [
      '	رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ',
      '	رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ',
      'رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "كان دعاء نبي الله لوط عليه السلام.....",
    "options": [
      'إذ نَادَىٰ رَبَّهُ أَنّىِ مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ',
      '	رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ',
      'إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُم ۚ مَّا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "كان دعاء نبي الله يعقوب عليه السلام.....",
    "options": [
      '	عَلَى اللَّهِ تَوَكَّلْنَا ۚ رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ',
      '	إذ نَادَىٰ رَبَّهُ أَنّىِ مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ',
      '	إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ وَأَعْلَمُ مِنَ اللَّهِ مَا لَا تَعْلَمُونَ',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": " كان دعاء نبي الله يوسف عليه السلام......",
    "options": [
      'رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ',
      'اللَّهُمَّ رَبَّنَا أَنزِلْ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ تَكُونُ لَنَا عِيدًا لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ ۖ وَارْزُقْنَا وَأَنتَ خَيْرُ الرَّازِقِينَ)',
      'رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": " كان دعاء نبي الله هود عليه السلام.....",
    "options": [
      '	لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ',
      '	إِنِّي تَوَكَّلْتُ عَلَى اللَّهِ رَبِّي وَرَبِّكُم ۚ مَّا مِن دَابَّةٍ إِلَّا هُوَ آخِذٌ بِنَاصِيَتِهَا ۚ إِنَّ رَبِّي عَلَىٰ صِرَاطٍ مُّسْتَقِيمٍ',
      '	وَقُل رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "كان دعاء نبي الله شعيب عليه السلام.....",
    "options": [
      '	عَلَى اللَّهِ تَوَكَّلْنَا ۚ رَبَّنَا افْتَحْ بَيْنَنَا وَبَيْنَ قَوْمِنَا بِالْحَقِّ وَأَنتَ خَيْرُ الْفَاتِحِينَ',
      '	رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ',
      '	رَبِّ اشْرَحْ لِي صَدْرِي* وَيَسِّرْ لِي أَمْرِي* وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي* يَفْقَهُوا قَوْلِي*',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "كان دعاء نبي الله أيوب عليه السلام......",
    "options": [
      '	إذ نَادَىٰ رَبَّهُ أنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ',
      '	إذ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "كان دعاء نبي الله يونس عليه السلام......",
    "options": [
      '	لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ',
      '	رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ',
      '	رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "كان دعاء نبي الله سليمان عليه السلام.....",
    "options": [
      'رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ',
      '	رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ',
      '	رَبِّ اغْفِرْ لِي وَهَبْ لِي مُلْكًا لَّا يَنبَغِي لِأَحَدٍ مِّن بَعْدِي ۖ إِنَّكَ أَنتَ الْوَهَّابُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "كان دعاء نبي الله موسى عليه السلام.....",
    "options": [
      '	رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ',
      '	لَّا إِلَٰهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ',
      '	رَبِّ اشْرَحْ لِي صَدْرِي* وَيَسِّرْ لِي أَمْرِي* وَاحْلُلْ عُقْدَةً مِّن لِّسَانِي* يَفْقَهُوا قَوْلِي*',
    ],
    "answer_index": 2,
  },
  {
    "id": 13,
    "question": "كان دعاء نبي الله زكريا عليه السلام......",
    "options": [
      'رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ',
      'وَقُل رَبِّ أَدخِلني مُدخَلَ صِدقٍ وَأَخرِجني مُخرَجَ صِدقٍ وَاجعَل لي مِن لَدُنكَ سُلطانًا نَصيرًا',
      'رَبِّ اجْعَلْنِي مُقِيمَ الصَّلَاةِ وَمِن ذُرِّيَّتِي ۚ رَبَّنَا وَتَقَبَّلْ دُعَاءِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "كان دعاء نبي الله عيسى عليه السلام......",
    "options": [
      'رَبِّ نَجِّنِي وَأَهْلِي مِمَّا يَعْمَلُونَ',
      '	اللَّهُمَّ رَبَّنَا أَنزِلْ عَلَيْنَا مَائِدَةً مِّنَ السَّمَاءِ تَكُونُ لَنَا عِيدًا لِّأَوَّلِنَا وَآخِرِنَا وَآيَةً مِّنكَ ۖ وَارْزُقْنَا وَأَنتَ خَيْرُ الرَّازِقِينَ',
      '	رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الْأَحَادِيثِ ۚ فَاطِرَ السَّمَاوَاتِ وَالْأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالْآخِرَةِ ۖ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "كان دعاء نبي الله محمد صلى الله عليه وسلم.....",
    "options": [
      'وَقُل رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْرُ الرَّاحِمِينَ',
      'وَقُل رَّبِّ أَعُوذُ بِكَ مِنْ هَمَزَاتِ الشَّيَاطِينِ* وَأَعُوذُ بِكَ رَبِّ أَن يَحْضُرُونِ',
      'وَقُل رَبِّ أَدخِلني مُدخَلَ صِدقٍ وَأَخرِجني مُخرَجَ صِدقٍ وَاجعَل لي مِن لَدُنكَ سُلطانًا نَصيرًا',
      'جميع الإجابات صحيحة',
    ],
    "answer_index": 0,
  },
];









const List infoQuranTwo =
[
  {
    "id": 1,
    "question": "ما السورة التي وُرد بها أطول قسم",
    "options": [
      'الشمس',
      'الليل',
      'الفجر',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "ما السورة التي ذُكر فيها أن الأرض تتكلم يوم القيامة وتتحدث بما عمل الخلائق على ظهرها......",
    "options": [
      'العاديات',
      'الزلزلة',
      'البينة',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "ما السورة التي أُنزلت على رسول الله صلى الله عليه وسلم وعلم أن نفسه نُعيت إليه وقرب أجله",
    "options": [
      'النصر',
      'العصر',
      'التكاثر',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "ما السورة التي انتهت بوقت من أوقات الصلاة.....",
    "options": [
      'العصر',
      'القدر',
      'الفجر',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "ما السورة التي بدأت وانتهت بالتسبيح",
    "options": [
      'الجمعة',
      'الصف',
      'الحشر',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "ما السورة التي وُرد فيها ذكر ليلة القدر غير سورة القدر.....",
    "options": [
      'المعارج',
      'الدخان',
      'البقرة',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "ما السورة التي ذُكر فيها أن خزنة جهنم عددهم تسعة عشر......",
    "options": [
      'الزخرف',
      'الأحزاب',
      'المدثر',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "ما السورة التي وُرد فيها حادثة المعراج.....",
    "options": [
      'المعارج',
      'النجم',
      'الطور',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "ما السورة التي وُرد فيها قصة قابيل و هابيل.....",
    "options": [
      'البقرة',
      'المائدة',
      'الأعراف',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "ما السورة التي ذُكر فيها اسم مالك خازن النار......",
    "options": [
      'الزخرف',
      'الأحزاب',
      'المدثر',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "سورة ذُكر فيها اسم صحابي......",
    "options": [
      'الأحزاب',
      'البقرة',
      'يوسف',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "ما السورة التي ذُكر في كل آياتها اسم الجلالة......",
    "options": [
      'الرحمن',
      'المجادلة',
      'الحشر',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "ما السورة التي ذُكر فيها البسملة مرتين.....",
    "options": [
      'الحج',
      'النمل',
      'القصص',
    ],
    "answer_index":1 ,
  },
  {
    "id": 14,
    "question": "ما السورة التي وُرد بها سجدتان......",
    "options": [
      'السجدة',
      'لقمان',
      'الحج',
    ],
    "answer_index": 2,
  },
  {
    "id": 15,
    "question": "ما السورة التي وُرد فيها أن اليأس من رحمة الله قرين الكفر.....",
    "options": [
      'البقرة',
      'الزمر',
      'يوسف',
    ],
    "answer_index": 2,
  },
  {
    "id": 16,
    "question": "ما السورة التي بينت أن الصلاة سبب لجلب الرزق وسعته...",
    "options": [
      'طه',
      'محمد',
      'إبراهيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 17,
    "question": "ما السورة التي قالت عنها عائشة رضى الله عنها أنها تمثل خُلق رسول الله صلى الله عليه وسلم.....",
    "options": [
      'الفرقان',
      'النور',
      'المؤمنون',
    ],
    "answer_index": 2,
  },
  {
    "id": 18,
    "question": "ما السورة التي ذكرها عمر بن الخطاب لأهل الكوفة وقال لهم علموها لنسائكم.....",
    "options": [
      'الفرقان',
      'النور',
      'المؤمنون',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "ما السورة التي ذُكر فيها الخبز......",
    "options": [
      'الفجر',
      'يوسف',
      'البقرة',
    ],
    "answer_index": 1,
  },
  {
    "id": 20,
    "question": "من أكثر الأنبياء ذكراً في القرآن.....",
    "options": [
      'موسى عليه السلام',
      'عيسى عليه السلام',
      'إبراهيم عليه السلام',
    ],
    "answer_index": 0,
  },
];





const List infoQuranThree =
[
  {
    "id": 1,
    "question": "من السيدة المقصودة (إِنَّ اللَّهَ اصْطَفَاكِ وَطَهَّرَكِ وَاصْطَفَاكِ عَلَىٰ نِسَاءِ الْعَالَمِينَ)",
    "options": [
      'امرأة فرعون',
      'مريم ابنة عمران',
      'امرأة عمران',
    ],
    "answer_index":1 ,
  },
  {
    "id": 2,
    "question": "من السيدة المقصودة ( قَالُوا أَتَعْجَبِينَ مِنْ أَمْرِ اللَّهِ)",
    "options": [
      'السيدة هاجر',
      'السيدة سارة',
      'السيدة مريم',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من السيدة المقصودة (قَالَتْ يَا أَيُّهَا الْمَلَأُ أَفْتُونِي فِي أَمْرِي مَا كُنتُ قَاطِعَةً أَمْرًا حَتَّى تَشْهَدُونِ)",
    "options": [
      'امرأة فرعون',
      'ملكة سبأ',
      'امرأة العزيز',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "من السيدة المقصودة (هَلْ أَدُلُّكُمْ عَلَى مَنْ يَكْفُلُهُ)",
    "options": [
      'أم موسى عليه السلام',
      'امرأة فرعون',
      'أخت موسى عليه السلام',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "من السيدة المقصودة (إِنِّي نَذَرْتُ لَكَ مَا فِي بَطْنِي مُحَرَّرًا فَتَقَبَّلْ مِنِّي ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ)",
    "options": [
      'مريم ابنة عمران',
      'امرأة عمران',
      'امرأة زكريا',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من السيدة المقصودة (ذَلِكَ لِيَعْلَمَ أَنِّي لَمْ أَخُنْهُ بِالْغَيْبِ وَأَنَّ اللَّهَ لا يَهْدِي كَيْدَ الْخَائِنِينَ)",
    "options": [
      'امرأة العزيز',
      'امرأة نوح',
      'ملكة سبأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من السيدة المقصودة (قُرَّتُ عَيْنٍ لِّي وَلَكَ ۖ لَا تَقْتُلُوهُ عَسَىٰ أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَهُمْ لَا يَشْعُرُونَ)",
    "options": [
      'امرأة العزيز',
      'امرأة عمران',
      'امرأة فرعون',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "من السيدة المقصودة (زَوَّجْنَاكَهَا لِكَيْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا وَكَانَ أَمْرُ اللَّهِ مَفْعُولًا)",
    "options": [
      'السيدة عائشة',
      'زينب بنت جحش',
      'أم سلمة',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من السيدة المقصودة (فَأَنجَيْنَاهُ وَأَهْلَهُ إِلَّا امْرَأَتَهُ كَانَتْ مِنَ الْغَابِرِينَ)",
    "options": [
      'امرأة نوح',
      'امرأة لوط',
      'امرأة فرعون',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من السيدة المقصودة (أَنِ اقْذِفِيهِ فِي التَّابُوتِ فَاقْذِفِيهِ فِي الْيَمِّ فَلْيُلْقِهِ الْيَمُّ بِالسَّاحِلِ)",
    "options": [
      'أخت موسى عليه السلام',
      'أم موسى عليه السلام',
      'امرأة فرعون',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "من السيدة المقصودة (فَأَجَاءَهَا الْمَخَاضُ إِلَى جِذْعِ النَّخْلَةِ قَالَتْ يَا لَيْتَنِي مِتُّ قَبْلَ هَذَا وَكُنتُ نَسْيًا مَّنسِيًّا)",
    "options": [
      'السيدة هاجر',
      'السيدة مريم',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "من السيدة المقصودة (قالَتْ يَا وَيْلَتَى أَأَلِدُ وَأَنَا عَجُوزٌ وَهَذَا بَعْلِي شَيْخًا إِنَّ هَذَا لَشَيْءٌ عَجِيبٌ)",
    "options": [
      'السيدة سارة',
      'السيدة هاجر',
      'زوجة زكريا عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "من نزلت فيها هذه الآية (إِنَّ الَّذِينَ جَاءُوا بِالْإِفْكِ عُصْبَةٌ مِنْكُمْ لَا تَحْسَبُوهُ شَرًّا لَكُمْ بَلْ هُوَ خَيْرٌ لَكُمْ لِكُلِّ امْرِئٍ مِنْهُمْ مَا اكْتَسَبَ مِنَ الْإِثْمِ وَالَّذِي تَوَلَّى كِبْرَهُ مِنْهُمْ لَهُ عَذَابٌ عَظِيمٌ)",
    "options": [
      'السيدة عائشة',
      'السيدة خديجة',
      'زينب بنت جحش',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "من السيدة المقصودة( فِي جِيدِهَا حَبْلٌ مِنْ مَسَدٍ)",
    "options": [
      'زوجة لوط',
      'زوجة نوح',
      'زوجة أبو لهب',
    ],
    "answer_index": 2,
  },
  {
    "id": 15,
    "question": "من السيدة المقصودة (قَالَتْ يَا أَيُّهَا الْمَلَأُ إِنِّي أُلْقِيِ إِلَيَّ كِتَابٌ كَرِيمٌ)",
    "options": [
      'مريم ابنة عمران',
      'ملكة سبأ',
      'السيدة هاجر',
    ],
    "answer_index": 1,
  },
  {
    "id": 16,
    "question": "من السيدة المقصودة (إِلَّا امْرَأَتَكَ إِنَّهُ مُصِيبُهَا مَا أَصَابَهُمْ إِنَّ مَوْعِدَهُمُ الصُّبْحُ أَلَيْسَ الصُّبْحُ بِقَرِيبٍ)",
    "options": [
      'امرأة لوط',
      'امرأة نوح',
      'امرأة أبو لهب',
    ],
    "answer_index": 0,
  },
  {
    "id": 17,
    "question": "من السيدة المقصودة غير امرأة لوط (كَانَتَا تَحْتَ عَبْدَيْنِ مِنْ عِبَادِنَا صَالِحَيْنِ فَخَانَتَاهُمَا فَلَمْ يُغْنِيَا عَنْهُمَا مِنَ اللَّهِ شَيْئًا وَقِيلَ ادْخُلَا النَّارَ مَعَ الدَّاخِلِينَ)",
    "options": [
      'امرأة نوح',
      'امرأة فرعون',
      'امرأة أبو لهب',
    ],
    "answer_index": 0,
  },
  {
    "id": 18,
    "question": "من السيدة المقصودة (تُجَادِلُكَ فِي زَوْجِهَا وَتَشْتَكِي إِلَى اللَّهِ )",
    "options": [
      'امرأة فرعون',
      'امرأة العزيز',
      'خولة بنت ثعلبة',
    ],
    "answer_index": 2,
  },
  {
    "id": 19,
    "question": "من السيدة المقصودة (إِذْ قَالَتْ رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ)",
    "options": [
      'امرأة فرعون',
      'امرأة عمران',
      'امرأة العزيز',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "من السيدة المقصودة (فَكُلِي وَاشْرَبِي وَقَرِّي عَيْنًا )",
    "options": [
      'السيدة هاجر',
      'السيدة مريم',
      'السيدة سارة',
    ],
    "answer_index": 1,
  },
];






const List infoQuranThreeTwo =
[
  {
    "id": 1,
    "question": "أكمل من قوله تعالى (يَوْمَ يَكُونُ النَّاسُ ......... الْمَبْثُوثِ)",
    "options": [
      'كَالْفَرَاشِ',
      'كَأَنَّهُم جَرَادٌ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "في الآية السابقة ما معنى  ( الْمَبْثُوثِ)",
    "options": [
      'المتفرق المتناثر',
      'المنتظم',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "(فَأَرْسَلْنَا عَلَيْهِمُ الطُّوفَانَ وَالْجَرَادَ وَالْقُمَّلَ وَالضَّفَادِعَ وَالدَّمَ آَيَاتٍ مُفَصَّلَاتٍ فَاسْتَكْبَرُوا وَكَانُوا قَوْمًا مُجْرِمِينَ)، ما القوم المقصود في هذه الآية",
    "options": [
      'قوم ثمود',
      'قوم فرعون في عصر النبي موسى',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "أكمل من قوله تعالى (إِنَّ اللَّهَ لَا يَسْتَحْيِي أَنْ يَضْرِبَ مَثَلًا مَا ....... فَمَا فَوْقَهَا)",
    "options": [
      'ذُبَابة',
      'بَعُوضَةً',

    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "أكمل من قوله تعالى (وَأَوْحَى رَبُّكَ إِلَى ........ أَنِ اتَّخِذِي مِنَ الْجِبَالِ بُيُوتًا وَمِنَ الشَّجَرِ وَمِمَّا يَعْرِشُونَ)",
    "options": [
      'النَّمْلِ',
      'النَّحْلِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "هل في القرآن سور أتت على اسم حشرة",
    "options": [
      'لا',
      'نعم',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "أكمل من قوله تعالى (إِنَّ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ لَنْ يَخْلُقُوا .......)",
    "options": [
      'بَعُوضَاً',
      'ذُبَابًا',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "(وَإِنَّ أَوْهَنَ الْبُيُوتِ لَبَيْتُ الْعَنْكَبُوتِ لَوْ كَانُوا يَعْلَمُونَ) ما معنى أَوْهَنَ",
    "options": [
      'أقوى',
      'أضعف',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "(فَتَبَسَّمَ ضَاحِكًا مِّن قَوْلِهَا) ما الحشرة المقصودة في هذه الآية",
    "options": [
      'النملة',
      'النحلة',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "(يَخْرُجُونَ مِنَ الْأَجْدَاثِ كَأَنَّهُمْ جَرَادٌ مُنْتَشِرٌ) ما معنى الْأجْدَاثِ",
    "options": [
      'القبور',
      'العمل',
    ],
    "answer_index": 0,
  },
];






const List infoQuranThreeTwoThree =
[
  {
    "id": 1,
    "question": "من الرجل المقصود في هذه الآية (إِنَّا مَكَّنَّا لَهُ فِي الأَرْضِ وَآتَيْنَاهُ مِن كُلِّ شَيْءٍ سَبَبًا)",
    "options": [
      'عزيز مصر في عصر يوسف عليه السلام',
      'ذي القرنين',
      'ملك مصر في عصر يوسف عليه السلام',
    ],
    "answer_index":1 ,
  },
  {
    "id": 2,
    "question": "من الرجل المقصود في هذه الآية (إِنِّي أَرَى سَبْعَ بَقَرَاتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَسَبْعَ سُنبُلاتٍ خُضْرٍ وَأُخَرَ يَابِسَاتٍ يَا أَيُّهَا الْمَلأُ أَفْتُونِي فِي رُؤْيَايَ إِن كُنتُمْ لِلرُّؤْيَا تَعْبُرُونَ)",
    "options": [
      'ملك مصر في عصر يوسف عليه السلام',
      'عزيز مصر في عصر يوسف عليه السلام',
      'ذي القرنين',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من الرجل المقصود في هذه الآية(قَالَ آمَنتُ أَنَّهُ لا إِلَهَ إِلاَّ الَّذِي آمَنَتْ بِهِ بَنُو إِسْرَائِيلَ وَأَنَاْ مِنَ الْمُسْلِمِينَ)",
    "options": [
      'فرعون',
      'قارون',
      'السامري',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من الرجل المقصود في هذه الآية (فَخَسَفْنَا بِهِ وَبِدَارِهِ الْأَرْضَ فَمَا كَانَ لَهُ مِنْ فِئَةٍ يَنْصُرُونَهُ مِنْ دُونِ اللَّهِ وَمَا كَانَ مِنَ الْمُنْتَصِرِينَ )",
    "options": [
      'فرعون',
      'قارون',
      'السامري',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "من الرجل المقصود في هذه الآية (قَالَ بَصُرْتُ بِمَا لَمْ يَبْصُرُوا بِهِ فَقَبَضْتُ قَبْضَةً مِّنْ أَثَرِ الرَّسُولِ فَنَبَذْتُهَا وَكَذَلِكَ سَوَّلَتْ لِي نَفْسِي)",
    "options": [
      'فرعون',
      'قارون',
      'السامري',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "من الرجل المقصود في هذه الآية (وَكَانَ لَهُ ثَمَرٌ فَقَالَ لِصَاحِبِهِ وَهُوَ يُحَاوِرُهُ أَنَا أَكْثَرُ مِنكَ مَالا وَأَعَزُّ نَفَرًا)",
    "options": [
      'صاحب الجنتين',
      'السامري',
      'فرعون',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من الرجل المقصود في هذه الآية (وَقَالَ الَّذِي اشْتَرَاهُ مِن مِّصْرَ لاِمْرَأَتِهِ أَكْرِمِي مَثْوَاهُ عَسَى أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَكَذَلِكَ مَكَّنَّا لِيُوسُفَ فِي الأَرْضِ وَلِنُعَلِّمَهُ مِن تَأْوِيلِ الأَحَادِيثِ وَاللَّهُ غَالِبٌ عَلَى أَمْرِهِ وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ)",
    "options": [
      'ملك مصر في عصر يوسف عليه السلام',
      'عزيز مصر في عصر يوسف عليه السلام',
      'ذي القرنين',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من الرجل المقصود في هذه الآية (حَتَّى إِذَا بَلَغَ بَيْنَ السَّدَّيْنِ وَجَدَ مِن دُونِهِمَا قَوْمًا لّا يَكَادُونَ يَفْقَهُونَ قَوْلا)",
    "options": [
      'ذي القرنين',
      'صاحب الجنتين',
      'السامري',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "من القوم المقصود في هذه الآية (فَقُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِين)",
    "options": [
      'أصحاب الكهف',
      'أصحاب السبت',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من القوم المقصود في هذه الآية (وَتَحْسَبُهُمْ أَيْقَاظًا وَهُمْ رُقُودٌ وَنُقَلِّبُهُمْ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ وَكَلْبُهُم بَاسِطٌ ذِرَاعَيْهِ بِالْوَصِيدِ لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِرَارًا وَلَمُلِئْتَ مِنْهُمْ رُعْبًا)",
    "options": [
      'أصحاب الكهف',
      'أصحاب السبت',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "من القوم المقصود في هذه الآية (وَجَاؤُوا عَلَى قَمِيصِهِ بِدَمٍ كَذِبٍ قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ)",
    "options": [
      'أصحاب الكهف',
      'إخوة يوسف عليه السلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "من القوم المقصود في هذه الآية (وَيَصۡنَعُ ٱلۡفُلۡكَ وَكُلَّمَا مَرَّ عَلَيۡهِ مَلَأٞ مِّن قَوۡمِهِۦ سَخِرُواْ مِنۡهُۚ قَالَ إِن تَسۡخَرُواْ مِنَّا فَإِنَّا نَسۡخَرُ مِنكُمۡ كَمَا تَسۡخَرُونَ)",
    "options": [
      'قوم نوح عليه السلام',
      'قوم إبراهيم عليه السلام',
      'قوم عاد',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "من القوم المقصود في هذه الآية (قَالُواْ حَرِّقُوهُ وَٱنصُرُوٓاْ ءَالِهَتَكُمۡ إِن كُنتُمۡ فَٰعِلِينَ)",
    "options": [
      'قوم نوح عليه السلام',
      'قوم إبراهيم عليه السلام',
      'قوم لوط عليه السلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "من القوم المقصود في هذه الآية (وَيَٰقَوۡمِ هَٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَايَةٗۖ فَذَرُوهَا تَأۡكُلۡ فِيٓ أَرۡضِ ٱللَّهِۖ وَلَا تَمَسُّوهَا بِسُوٓءٖ فَيَأۡخُذَكُمۡ عَذَابٞ قَرِيبٞ)",
    "options": [
      'قوم عاد',
      'قوم لوط',
      'قوم ثمود (قوم النبي صالح عليه السلام)',
    ],
    "answer_index": 2,
  },
  {
    "id": 15,
    "question": "من القوم المقصود في هذه الآية (قَالُواْ يَٰهُودُ مَا جِئۡتَنَا بِبَيِّنَةٖ وَمَا نَحۡنُ بِتَارِكِيٓ ءَالِهَتِنَا عَن قَوۡلِكَ وَمَا نَحۡنُ لَكَ بِمُؤۡمِنِينَ)",
    "options": [
      'قوم عاد',
      'قوم لوط',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "من القوم المقصود في هذه الآية (وَجَآءَهُۥ قَوۡمُهُۥ يُهۡرَعُونَ إِلَيۡهِ وَمِن قَبۡلُ كَانُواْ يَعۡمَلُونَ ٱلسَّيِّ‍َٔاتِۚ قَالَ يَٰقَوۡمِ هَٰٓؤُلَآءِ بَنَاتِي هُنَّ أَطۡهَرُ لَكُمۡۖ فَٱتَّقُواْ ٱللَّهَ وَلَا تُخۡزُونِ فِي ضَيۡفِيٓۖ أَلَيۡسَ مِنكُمۡ رَجُلٞ رَّشِيدٞ)",
    "options": [
      'قوم عاد',
      'قوم ثمود',
      'قوم لوط',
    ],
    "answer_index":2 ,
  },
  {
    "id": 17,
    "question": "من القوم المقصود في هذه الآية (قَالُوا يَا مُوسَىٰ إِمَّا أَن تُلْقِيَ وَإِمَّا أَن نَّكُونَ نَحْنُ الْمُلْقِينَ",
    "options": [
      'سحرة فرعون',
      'أصحاب السبت',
    ],
    "answer_index": 0,
  },
  {
    "id": 18,
    "question": "من القوم المقصود في هذه الآية (قَالَ يَا قَوْمِ أَلَمْ يَعِدْكُمْ رَبُّكُمْ وَعْدًا حَسَنًا أَفَطَالَ عَلَيْكُمُ الْعَهْدُ أَمْ أَرَدتُّمْ أَن يَحِلَّ عَلَيْكُمْ غَضَبٌ مِّن رَّبِّكُمْ فَأَخْلَفْتُم مَّوْعِدِي)",
    "options": [
      'قوم نوح عليه السلام',
      'قوم إبراهيم عليه السلام',
      'قوم موسى عليه السلام',
    ],
    "answer_index": 2,
  },
  {
    "id": 19,
    "question": "من القوم المقصود في هذه الآية (وَيَٰقَوۡمِ أَوۡفُواْ ٱلۡمِكۡيَالَ وَٱلۡمِيزَانَ بِٱلۡقِسۡطِۖ وَلَا تَبۡخَسُواْ ٱلنَّاسَ أَشۡيَآءَهُمۡ وَلَا تَعۡثَوۡاْ فِي ٱلۡأَرۡضِ مُفۡسِدِينَ)",
    "options": [
      'قوم مدين(قوم النبي شعيب عليه السلام)',
      'قوم ثمود',
      'قوم لوط',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "من القوم المقصود في هذه الآية(قَالُواْ نُرِيدُ أَن نَّأْكُلَ مِنْهَا وَتَطْمَئِنَّ قُلُوبُنَا وَنَعْلَمَ أَن قَدْ صَدَقْتَنَا وَنَكُونَ عَلَيْهَا مِنَ الشَّاهِدِينَ)",
    "options": [
      'الحواريون',
      'قوم موسى عليه السلام',
      'قوم إبراهيم عليه السلام',
    ],
    "answer_index": 0,
  },
];






const List infoQuranThreeFour =
[
  {
    "id": 1,
    "question": "من الرجل المقصود في هذه الآية (قَالَ سَـَٔاوِيٓ إِلَىٰ جَبَلٖ يَعۡصِمُنِي مِنَ ٱلۡمَآءِۚ )",
    "options": [
      '	ابن نبي الله نوح',
      '	ابن لقمان',
      '	السامري',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "من الرجل المقصود في هذه الآية (فَٱلۡيَوۡمَ نُنَجِّيكَ بِبَدَنِكَ لِتَكُونَ لِمَنۡ خَلۡفَكَ ءَايَةٗۚ )",
    "options": [
      '	هامان',
      '	قارون',
      '	فرعون',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "من الرجل المقصود في هذه الآية ( إِنِّيٓ أَرَىٰنِيٓ أَحۡمِلُ فَوۡقَ رَأۡسِي خُبۡزٗا تَأۡكُلُ ٱلطَّيۡرُ مِنۡهُۖ)",
    "options": [
      '	صاحب الجنتين',
      '	أحد فتيان السجن (الذي دخل مع نبي الله يوسف)',
      '	السامري',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "من الرجل المقصود في هذه الآية (فَلَمَّا رَءَا قَمِيصَهُۥ قُدَّ مِن دُبُرٖ قَالَ إِنَّهُۥ مِن كَيۡدِكُنَّۖ إِنَّ كَيۡدَكُنَّ عَظِيمٞ )",
    "options": [
      '	عزيز مصر (في عهد نبي الله يوسف)',
      '	ملك مصر (في عهد نبي الله يوسف)',
      '	ذي القرنين',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "من القوم المقصود في هذه الآية (قَالُواْ لَئِنۡ أَكَلَهُ ٱلذِّئۡبُ وَنَحۡنُ عُصۡبَةٌ إِنَّآ إِذٗا لَّخَٰسِرُونَ)",
    "options": [
      '	أصحاب الكهف',
      '	أصحاب السبت',
      '	إخوة يوسف',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "من الرجل المقصود في هذه الآية (ءَاتُونِي زُبَرَ ٱلۡحَدِيدِۖ حَتَّىٰٓ إِذَا سَاوَىٰ بَيۡنَ ٱلصَّدَفَيۡنِ قَالَ ٱنفُخُواْۖ حَتَّىٰٓ إِذَا جَعَلَهُۥ نَارٗا قَالَ ءَاتُونِيٓ أُفۡرِغۡ عَلَيۡهِ قِطۡرٗا)",
    "options": [
      '	ذي القرنين',
      '	عزيز مصر',
      '	ملك مصر',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من القوم المقصود في هذه الآية (وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا)",
    "options": [
      '	أصحاب الأيكة',
      '	أصحاب الكهف',
      '	أصحاب السبت',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " من الرجل المقصود في هذه الآية (وَدَخَلَ جَنَّتَهُۥ وَهُوَ ظَالِمٞ لِّنَفۡسِهِۦ قَالَ مَآ أَظُنُّ أَن تَبِيدَ هَٰذِهِۦٓ أَبَدٗا )",
    "options": [
      '	السامري',
      '	قارون',
      '	صاحب الجنتين',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "من الرجل المقصود في هذه الآية (فَٱذۡهَبۡ فَإِنَّ لَكَ فِي ٱلۡحَيَوٰةِ أَن تَقُولَ لَا مِسَاسَۖ وَإِنَّ لَكَ مَوۡعِدٗا لَّن تُخۡلَفَهُۥۖ وَٱنظُرۡ إِلَىٰٓ إِلَٰهِكَ ٱلَّذِي ظَلۡتَ عَلَيۡهِ عَاكِفٗاۖ لَّنُحَرِّقَنَّهُۥ ثُمَّ لَنَنسِفَنَّهُۥ فِي ٱلۡيَمِّ نَسۡفًا )",
    "options": [
      '	السامري',
      '	قارون',
      '	هامان',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "من الرجل المقصود في هذه الآية (كَانَ مِن قَومِ مُوسَىٰ فَبَغَىٰ عَلَيهِم وَءَاتَيۡنَٰهُ مِنَ ٱلۡكُنُوزِ مَآ إِنَّ مَفَاتِحَهُۥ لَتَنُوٓأُ بِٱلۡعُصۡبَةِ أُوْلِي ٱلۡقُوَّةِ إِذۡ قَالَ لَهُۥ قَوۡمُهُۥ لَا تَفۡرَحۡۖ إِنَّ ٱللَّهَ لَا يُحِبُّ ٱلۡفَرِحِينَ)",
    "options": [
      '	فرعون',
      'هامان',
      '	قارون',
    ],
    "answer_index": 2,
  },
];







const List infoQuranThreeFive =
[
  {
    "id": 1,
    "question": "من القوم المقصود في هذه الآية (فَعَقَرُواْ ٱلنَّاقَةَ وَعَتَوۡاْ عَنۡ أَمۡرِ رَبِّهِمۡ)",
    "options": [
      '	قوم ثمود (قوم نبي الله صالح)',
      '	قوم عاد',
      '	قوم نوح',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "من القوم المقصود في هذه الآية (أَتَأۡتُونَ ٱلۡفَٰحِشَةَ مَا سَبَقَكُم بِهَا مِنۡ أَحَدٖ مِّنَ ٱلۡعَٰلَمِينَ * إِنَّكُمۡ لَتَأۡتُونَ ٱلرِّجَالَ شَهۡوَةٗ مِّن دُونِ ٱلنِّسَآءِۚ بَلۡ أَنتُمۡ قَوۡمٞ مُّسۡرِفُونَ)",
    "options": [
      '	قوم نبي الله إبراهيم',
      '	قوم نبي الله نوح',
      '	قوم نبي الله لوط',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": " من القوم المقصود في هذه الآية (وَإِنِّي كُلَّمَا دَعَوْتُهُمْ لِتَغْفِرَ لَهُمْ جَعَلُوا أَصَابِعَهُمْ فِي آذَانِهِمْ وَاسْتَغْشَوْا ثِيَابَهُمْ وَأَصَرُّوا وَاسْتَكْبَرُوا اسْتِكْبَارًا)",
    "options": [
      '	قوم عاد',
      '	قوم نبي الله نوح',
      '	قوم نبي الله موسى',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "من القوم المقصود في هذه الآية (قَالُواْ ٱدۡعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوۡنُهَاۚ قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٞ صَفۡرَآءُ فَاقِعٞ لَّوۡنُهَا تَسُرُّ ٱلنَّٰظِرِينَ )",
    "options": [
      'قوم مدين',
      'قوم ثمود',
      'قوم نبي الله موسى',
    ],
    "answer_index": 2 ,
  },
  {
    "id": 5,
    "question": "من القوم المقصود في هذه الآية (قَالُواْ حَرِّقُوهُ وَٱنصُرُوٓاْ ءَالِهَتَكُمۡ إِن كُنتُمۡ فَٰعِلِينَ )",
    "options": [
      '	قوم نبي الله إبراهيم',
      '	قوم نبي الله نوح',
      '	قوم نبي الله لوط',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من القوم المقصود في هذه الآية (قَالُواْ يَٰهُودُ مَا جِئۡتَنَا بِبَيِّنَةٖ وَمَا نَحۡنُ بِتَارِكِيٓ ءَالِهَتِنَا عَن قَوۡلِكَ وَمَا نَحۡنُ لَكَ بِمُؤۡمِنِينَ)",
    "options": [
      '	قوم ثمود',
      '	قوم عاد',
      '	قوم مدين',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من القوم المقصود في هذه الآية (قَالُواْ يَٰشُعَيۡبُ مَا نَفۡقَهُ كَثِيرٗا مِّمَّا تَقُولُ وَإِنَّا لَنَرَىٰكَ فِينَا ضَعِيفٗاۖ وَلَوۡلَا رَهۡطُكَ لَرَجَمۡنَٰكَۖ وَمَآ أَنتَ عَلَيۡنَا بِعَزِيزٖ)",
    "options": [
      '	قوم ثمود',
      '	قوم عاد',
      '	قوم مدين',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "من القوم المقصود في هذه الآية (فَلَمَّآ أَلۡقَوۡاْ سَحَرُوٓاْ أَعۡيُنَ ٱلنَّاسِ وَٱسۡتَرۡهَبُوهُمۡ وَجَآءُو بِسِحۡرٍ عَظِيمٖ)",
    "options": [
      '	سحرة فرعون',
      '	أصحاب السبت',
      '	إخوة نبي الله يوسف',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "من القوم المقصود في هذه الآية (يَٰعِيسَى ٱبۡنَ مَرۡيَمَ هَلۡ يَسۡتَطِيعُ رَبُّكَ أَن يُنَزِّلَ عَلَيۡنَا مَآئِدَةٗ مِّنَ ٱلسَّمَآءِۖ )",
    "options": [
      '	أصحاب النار',
      '	الحواريون',
      '	أصحاب السبت',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من القوم المقصود في هذه الآية (فَقُلْنَا لَهُمْ كُونُوا قِرَدَةً خَاسِئِينَ)",
    "options": [
      'أصحاب الكهف',
      'أصحاب النار',
      'أصحاب السبت',
    ],
    "answer_index": 2,
  },

  {
    "id": 11,
    "question": "من القوم المقصود في هذه الآية (فَلَمَّا رَجَعُوا إِلَى أَبِيهِمْ قَالُواْ يَا أَبَانَا مُنِعَ مِنَّا الْكَيْلُ فَأَرْسِلْ مَعَنَا أَخَانَا نَكْتَلْ وَإِنَّا لَهُ لَحَافِظُونَ)",
    "options": [
      '	إخوة نبي الله يوسف',
      '	قوم نبي الله موسى',
      '	الحواريون',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "من القوم القائل لهذه الآية (أَفِيضُواْ عَلَيۡنَا مِنَ ٱلۡمَآءِ أَوۡ مِمَّا رَزَقَكُمُ ٱللَّهُۚ )",
    "options": [
      '	أصحاب الجنة',
      '	أصحاب النار',
      '	رجال الأعراف',
    ],
    "answer_index": 1,
  },
];











const List infoQuranFour =
[
  {
    "id": 1,
    "question": "مد ألفات حي طهر تمد بمقدار.....",
    "options": [
      'حركتين',
      'أربع حركات',
      'ست حركات',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "الحروف المتقطعة أتت ب .....",
    "options": [
      '٣٠ سورة',
      '٢٩ سورة',
      '٢٧ سورة',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "المد الصلة الكبرى يلحق ب .....",
    "options": [
      'المد المنفصل',
      'المد المتصل',
      'المد اللازم',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "مد التمكين أحد ألقاب....",
    "options": [
      'المد اللازم',
      'المد العوض',
      'المد الأصلي',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "الإنفصال الحكمي يكون في....",
    "options": [
      'ياء النداء',
      'ألف الإثنين',
      'هاء التنبيه',
      'ياء النداء وهاء التنبيه',
    ],
    "answer_index":3 ,
  },
  {
    "id": 6,
    "question": "أقوى أنواع المدود.....",
    "options": [
      'المد العارض للسكون',
      'المد اللازم',
      'المد المتصل',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "في قوله تعالى (فَلۡيَعۡبُدُواْ رَبَّ هَٰذَا ٱلۡبَيۡتِ)......",
    "options": [
      'مد بدل',
      'مد عوض',
      'مد لين',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "في قوله تعالى (وَٱلَّذِينَ يُؤۡمِنُونَ بِمَآ أُنزِلَ إِلَيۡكَ).....",
    "options": [
      'مد منفصل',
      'مد متصل',
      'مد بدل',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "في قوله تعالى (قَالَ هَلْ ءَامَنُكُمْ عَلَيْهِ).......",
    "options": [
      'مد لازم',
      'مد بدل',
      'مد متصل',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "في قوله تعالى (وَلَا ٱلضَّآلِّينَ).....",
    "options": [
      'مد لازم كلمي',
      'مد لازم حرفي',
      'مد متصل',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "في قوله تعالى (ءَآلْـَٰٔنَ وَقَدْ كُنتُم بِهِۦ تَسْتَعْجِلُونَ).....",
    "options": [
      'مد بدل',
      'مد لازم',
      'مد متصل',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "في قوله تعالى (أُوْلَٰٓئِكَ عَلَىٰ هُدٗى مِّن رَّبِّهِمۡۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُفۡلِحُونَ).....",
    "options": [
      'مد منفصل',
      'مد لازم',
      'مد متصل',
    ],
    "answer_index": 2,
  },
  {
    "id": 13,
    "question": "في قوله تعالى (وَبَثَّ مِنْهُمَا رِجَالًا كَثِيرًا).......",
    "options": [
      'مد عوض',
      'مد لين',
      'مد عارض للسكون',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "في قوله تعالى (وَوَهَبْنَا لَهُ إِسْحَاقَ وَيَعْقُوبَ)......",
    "options": [
      'مد صلة صغرى',
      'مد صلة كبرى',
      'مد منفصل',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "في قوله تعالى (بِيَدِهِۦ مَلَكُوتُ)......",
    "options": [
      'مد صلة صغرى',
      'مد صلة كبرى',
      'مد لازم',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "في قوله تعالى (وَلَوۡ شَآءَ ٱللَّهُ لَذَهَبَ بِسَمۡعِهِمۡ وَأَبۡصَٰرِهِمۡۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ).....",
    "options": [
      'مد منفصل',
      'مد لازم',
      'مد متصل',
    ],
    "answer_index": 2,
  },
  {
    "id": 17,
    "question": "في قوله تعالى (ذَٰلِكَ ٱلۡكِتَٰبُ لَا رَيۡبَۛ فِيهِۛ هُدٗى لِّلۡمُتَّقِينَ)......",
    "options": [
      'مد عارض للسكون',
      'مد صلة',
      'مد لازم',
    ],
    "answer_index":0 ,
  },
  {
    "id": 18,
    "question": "في قوله تعالى (الٓمٓ).....",
    "options": [
      'مد لازم كلمي',
      'مد لازم حرفي',
      'مد متصل',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": " مانوع المد في كلمة هَٰٓؤُلَآءِ",
    "options": [
      'مد منفصل ثم مد متصل',
      'مد متصل ثم مد منفصل',
      'مد متصل فقط',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "سنقص علمك تمد بمقدار......",
    "options": [
      'حركتان',
      'أربع حركات',
      'ست حركات',
    ],
    "answer_index": 2,
  },
];





const List infoQuranFive =
[
  {
    "id": 1,
    "question": "اكمل من قوله تعالى ومن لا يعرف يختر لا أدري ( يَحْلِفُونَ..........لِتَرْضَوْا عَنْهُمْ فَإِن تَرْضَوْا عَنْهُمْ فَإِنَّ اللَّهَ لاَ يَرْضَى عَنِ الْقَوْمِ الْفَاسِقِينَ)",
    "options": [
      'بِاللَّهِ لَكُمْ',
      'لَكُمْ',
      'لا أدري',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "بما اختتمت هذه الآية (وَجَٰوَزۡنَا بِبَنِيٓ إِسۡرَٰٓءِيلَ ٱلۡبَحۡرَ فَأَتۡبَعَهُمۡ فِرۡعَوۡنُ وَجُنُودُهُۥ بَغۡيٗا وَعَدۡوًاۖ حَتَّىٰٓ إِذَآ أَدۡرَكَهُ ٱلۡغَرَقُ ............)",
    "options": [
      'قَالَ ءَامَنتُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱلَّذِيٓ ءَامَنَتۡ بِهِۦ بَنُوٓاْ إِسۡرَٰٓءِيلَ وَأَنَا۠ مِنَ ٱلۡمُسۡلِمِينَ',
      'قَالَ ءَامَنتُ بٱلَّذِيٓ ءَامَنَتۡ بِهِۦ بَنُوٓاْ إِسۡرَٰٓءِيلَ وَأَنَا۠ مِنَ ٱلۡمُسۡلِمِينَ',
      'لا أدري',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "اكمل من قوله تعالى (فَعَقَرُوهَا فَقَالَ تَمَتَّعُواْ فِي دَارِكُمۡ.......أَيَّامٖۖ ذَٰلِكَ وَعۡدٌ غَيۡرُ مَكۡذُوبٖ)",
    "options": [
      'ثَلَٰثَةَ',
      'أَرْبَعةً',
      'لا أدري',
    ],
    "answer_index":0 ,
  },
  {
    "id": 4,
    "question": "بما اختتمت هذه الآية (إِن كَانَ قَمِيصُهُۥ.............)",
    "options": [
      'قُدَّ مِن قُبُلٖ فَصَدَقَتۡ وَهُوَ مِنَ ٱلۡكَٰذِبِينَ',
      'قُدَّ مِن دُبُرٖ فَكَذَبَتۡ وَهُوَ مِنَ ٱلصَّٰدِقِينَ',
      'لا أدري',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "(وَمَا يَعۡزُبُ عَن رَّبِّكَ مِن مِّثۡقَالِ ذَرَّةٖ فِي ٱلۡأَرۡضِ وَلَا فِي ٱلسَّمَآءِ وَلَآ أَصۡغَرَ مِن ذَٰلِكَ وَلَآ أَكۡبَرَ إِلَّا فِي كِتَٰبٖ مُّبِينٍ) معنى يَعۡزُبُ",
    "options": [
      'يبعد',
      'يقترب',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "(وَحَاقَ بِهِم مَّا كَانُواْ بِهِۦ يَسۡتَهۡزِءُونَ ) معنى وَحَاقَ",
    "options": [
      'نزل أو أحاط بهم',
      'منع بهم',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "(فَلَا تَكُ فِي مِرۡيَةٖ مِّنۡهُۚ إِنَّهُ ٱلۡحَقُّ مِن رَّبِّكَ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ) معنى مرية",
    "options": [
      'شك',
      'تأكيد',
    ],
    "answer_index":0 ,
  },
  {
    "id": 8,
    "question": "(أَرۡسِلۡهُ مَعَنَا غَدٗا يَرۡتَعۡ وَيَلۡعَبۡ وَإِنَّا لَهُۥ لَحَٰفِظُونَ) معنى يَرۡتَعۡ",
    "options": [
      'يُسابق ويرم بالسّهام',
      'يتّسع في أكل ما لذ وطاب',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "(وَلَقَدۡ كَذَّبَ أَصۡحَٰبُ ٱلۡحِجۡرِ ٱلۡمُرۡسَلِينَ) معنى ٱلۡحِجۡرِ",
    "options": [
      'ديار قوم ثمود',
      'ديار قوم مدين',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "في أي سورة وردت هذه الآية (مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُواْ أَن يَسْتَغْفِرُواْ لِلْمُشْرِكِينَ وَلَوْ كَانُواْ أُولِي قُرْبَى مِن بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحَابُ الْجَحِيمِ)",
    "options": [
      'التوبة',
      'يونس',
      'هود',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "في أي سورة وردت هذه الآية (الَّذِينَ آمَنُواْ وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ أَلاَ بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ)",
    "options": [
      'الرعد',
      'إبراهيم',
      'الحجر',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "في أي سورة وردت هذه الآية (أَلَمْ يَعْلَمُواْ أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَأْخُذُ الصَّدَقَاتِ وَأَنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ)",
    "options": [
      'النحل',
      'الرعد',
      'التوبة',
    ],
    "answer_index": 2,
  },
  {
    "id":13,
    "question": "في أي سورة وردت هذه الآية (إِنَّ ٱللَّهَ لَا يَظۡلِمُ ٱلنَّاسَ شَيۡ‍ٔٗا وَلَٰكِنَّ ٱلنَّاسَ أَنفُسَهُمۡ يَظۡلِمُونَ)",
    "options": [
      'يونس',
      'يوسف',
      'النحل',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "في أي سورة وردت هذه الآية (فَإِذَا قَرَأْتَ الْقُرْآنَ فَاسْتَعِذْ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ)",
    "options": [
      'يونس',
      'التوبة',
      'النحل',
    ],
    "answer_index": 2,
  },
  {
    "id": 15,
    "question": "في أي سورة وردت هذه الآية (إِلَّا ٱلَّذِينَ صَبَرُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أُوْلَٰٓئِكَ لَهُم مَّغۡفِرَةٞ وَأَجۡرٞ كَبِيرٞ)",
    "options": [
      'هود',
      'الرعد',
      'إبراهيم',
    ],
    "answer_index":0 ,
  },
  {
    "id": 16,
    "question": "في أي سورة وردت هذه الآية (وَلاَ تَحْسَبَنَّ اللَّهَ غَافِلاً عَمَّا يَعْمَلُ الظَّالِمُونَ إِنَّمَا يُؤَخِّرُهُمْ لِيَوْمٍ تَشْخَصُ فِيهِ الأَبْصَارُ)",
    "options": [
      'يوسف',
      'هود',
      'إبراهيم',
    ],
    "answer_index": 2,
  },
  {
    "id": 17,
    "question": "في أي سورة وردت هذه الآية (إِنَّ اللَّهَ لاَ يُغَيِّرُ مَا بِقَوْمٍ حَتَّى يُغَيِّرُواْ مَا بِأَنفُسِهِمْ)",
    "options": [
      'الرعد',
      'إبراهيم',
      'الحجر',
    ],
    "answer_index":0 ,
  },
  {
    "id": 18,
    "question": "في أي سورة وردت هذه الآية (وَمَا مِن دَآبَّةٖ فِي ٱلۡأَرۡضِ إِلَّا عَلَى ٱللَّهِ رِزۡقُهَا وَيَعۡلَمُ مُسۡتَقَرَّهَا وَمُسۡتَوۡدَعَهَاۚ كُلّٞ فِي كِتَٰبٖ مُّبِينٖ)",
    "options": [
      'النحل',
      'هود',
      'يونس',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "في أي سورة وردت هذه الآية (وَلَقَدۡ نَعۡلَمُ أَنَّكَ يَضِيقُ صَدۡرُكَ بِمَا يَقُولُونَ  فَسَبِّحۡ بِحَمۡدِ رَبِّكَ وَكُن مِّنَ ٱلسَّٰجِدِينَ وَٱعۡبُدۡ رَبَّكَ حَتَّىٰ يَأۡتِيَكَ ٱلۡيَقِينُ)",
    "options": [
      'هود',
      'النحل',
      'الحجر',
    ],
    "answer_index": 2,
  },
  {
    "id": 20,
    "question": "في أي سورة وردت هذه الآية (وَلَا تَاْيۡ‍َٔسُواْ مِن رَّوۡحِ ٱللَّهِۖ إِنَّهُۥ لَا يَاْيۡ‍َٔسُ مِن رَّوۡحِ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ٱلۡكَٰفِرُونَ )",
    "options": [
      'يونس',
      'هود',
      'يوسف',
    ],
    "answer_index": 2,
  },
];





const List infoQuranFiveOne =
[
  {
    "id": 1,
    "question": "أكمل من قوله تعالى ( إِذْ قَالَ يُوسُفُ لِأَبِيهِ يَا أَبَتِ إِنِّي رَأَيْتُ.............وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ)",
    "options": [
      'أَحَدَ عَشَرَ كَوْكَبًا',
      'إحَدَى عَشَرَ كَوْكَبًا',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "أكمل من قوله تعالى (وَكَذَلِكَ يَجْتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأْوِيلِ الأَحَادِيثِ وَيُتِمُّ نِعْمَتَهُ عَلَيْكَ وَعَلَى آلِ يَعْقُوبَ كَمَا أَتَمَّهَا عَلَى أَبَوَيْكَ مِن قَبْلُ ...........إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٌ)",
    "options": [
      'إِبْرَاهِيمَ وَإِسْحَاقَ',
      'إِبْرَاهِيمَ وَإِسْحَاقَ ويَعْقُوبَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "أكمل من قوله تعالى ( قَالُواْ يَا أَبَانَا مَا لَكَ لاَ تَأْمَنَّا عَلَى يُوسُفَ......)",
    "options": [
      'وَإِنَّا لَهُ لَحَافِظُونَ',
      'وَإِنَّا لَهُ لَنَاصِحُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "(وَجَاءَتْ سَيَّارَةٌ فَأَرْسَلُواْ وَارِدَهُمْ فَأَدْلَى دَلْوَهُ قَالَ يَا بُشْرَى هَذَا غُلامٌ وَأَسَرُّوهُ بِضَاعَةً وَاللَّهُ عَلِيمٌ بِمَا يَعْمَلُونَ) ، ما معنى فَأَدْلَى دَلْوَهُ ......",
    "options": [
      'فأرسلها في الجبّ ليملأها ماءً',
      'أخذها من الجب',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "أكمل من قوله تعالى (قَالَ هِيَ رَاوَدَتْنِي عَن نَّفْسِي وَشَهِدَ شَاهِدٌ مِّنْ أَهْلِهَا..........فَصَدَقَتْ وَهُوَ مِنَ الْكَاذِبِينَ)",
    "options": [
      'إِن كَانَ قَمِيصُهُ قُدَّ مِن قُبُلٍ',
      'إِنْ كَانَ قَمِيصُهُ قُدَّ مِن دُبُرٍ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "(فَلَمَّا سَمِعَتْ بِمَكْرِهِنَّ أَرْسَلَتْ إِلَيْهِنَّ وَأَعْتَدَتْ لَهُنَّ مُتَّكَأً وَآتَتْ كُلَّ وَاحِدَةٍ مِّنْهُنَّ سِكِّينًا وَقَالَتِ اخْرُجْ عَلَيْهِنَّ فَلَمَّا رَأَيْنَهُ أَكْبَرْنَهُ وَقَطَّعْنَ أَيْدِيَهُنَّ وَقُلْنَ حَاشَ لِلَّهِ مَا هَذَا بَشَرًا إِنْ هَذَا إِلاَّ مَلَكٌ كَرِيمٌ)، ما معنى أَكْبَرْنَهُ......",
    "options": [
      'مللنه',
      'دهشن برؤية جماله',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "أكمل من قوله تعالى (وَدَخَلَ مَعَهُ السِّجْنَ فَتَيَانَ قَالَ أَحَدُهُمَا إِنِّي أَرَانِي أَعْصِرُ خَمْرًا وَقَالَ الآخَرُ إِنِّي أَرَانِي......... تَأْكُلُ الطَّيْرُ مِنْهُ نَبِّئْنَا بِتَأْوِيلِهِ إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ)",
    "options": [
      'أَحْمِلُ فَوْقَ رَأْسِي خُبْزًا',
      'أَحْمِلُ خُبْزًا فَوْقَ رَأْسِي',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "أكمل من قوله تعالى ( يَا صَاحِبَيِ السِّجْنِ أَمَّا أَحَدُكُمَا فَيَسْقِي رَبَّهُ خَمْرًا وَأَمَّا الآخَرُ فَيُصْلَبُ فَتَأْكُلُ الطَّيْرُ .......... قُضِيَ الأَمْرُ الَّذِي فِيهِ تَسْتَفْتِيَانِ)",
    "options": [
      'مِنْهُ',
      'مِن رَّأْسِهِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "أكمل من قوله تعالى (وَقَالَ الْمَلِكُ إِنِّي أَرَى سَبْعَ بَقَرَاتٍ سِمَانٍ.........سَبْعٌ عِجَافٌ وَسَبْعَ سُنبُلاتٍ خُضْرٍ وَأُخَرَ يَابِسَاتٍ يَا أَيُّهَا الْمَلأُ أَفْتُونِي فِي رُؤْيَايَ إِن كُنتُمْ لِلرُّؤْيَا تَعْبُرُونَ)",
    "options": [
      'يَأْكُلُنَّ',
      'يَأْكُلُهُنَّ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "(وَقَالَ الَّذِي نَجَا مِنْهُمَا وَادَّكَرَ بَعْدَ أُمَّةٍ أَنَاْ أُنَبِّئُكُم بِتَأْوِيلِهِ فَأَرْسِلُونِ) ، ما معنى وَادَّكَرَ بَعْدَ أُمَّةٍ.......",
    "options": [
      'تذكر بعد مدة قصيرة',
      'تذكر بعد مدة طويلة',
    ],
    "answer_index": 1,
  },

  {
    "id": 11,
    "question": "أكمل من قوله تعالى (قَالَ اجْعَلْنِي عَلَى خَزَائِنِ الأَرْضِ إِنِّي ........)",
    "options": [
      'أَمِينٌ عَلِيمٌ',
      'حَفِيظٌ عَلِيمٌ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "أكمل من قوله تعالى (وَقَالَ يَا بَنِيَّ ......................وَمَا أُغْنِي عَنكُم مِّنَ اللَّهِ مِن شَيْءٍ إِنِ الْحُكْمُ إِلاَّ لِلَّهِ عَلَيْهِ تَوَكَّلْتُ وَعَلَيْهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ)",
    "options": [
      'لا تَدْخُلُواْ مِن بَابٍ وَاحِدٍ وَادْخُلُواْ مِنْ أَبْوَابٍ مُّتَفَرِّقَةٍ',
      'لا تَدْخُلُواْ مِنْ أَبْوَابٍ مُّتَفَرِّقَةٍ وَادْخُلُواْ  مِن بَابٍ وَاحِدٍ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "أكمل من قوله تعالى (وَلَمَّا دَخَلُواْ عَلَى يُوسُفَ..........قَالَ إِنِّي أَنَاْ أَخُوكَ فَلاَ تَبْتَئِسْ بِمَا كَانُواْ يَعْمَلُونَ)",
    "options": [
      'آوَى أَخَاهُ إلَيْهِ',
      'آوَى إِلَيْهِ أَخَاهُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "أكمل من قوله تعالى (فَلَمَّا جَهَّزَهُم بِجَهَازِهِمْ جَعَلَ السِّقَايَةَ فِي رَحْلِ أَخِيهِ ..........أَيَّتُهَا الْعِيرُ إِنَّكُمْ لَسَارِقُونَ)",
    "options": [
      'ثُمَّ أَذَّنَ مُؤَذِّنٌ بَينَهم',
      'ثُمَّ أَذَّنَ مُؤَذِّنٌ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "أكمل من قوله تعالى (وَتَوَلَّى عَنْهُمْ وَقَالَ........... وَابْيَضَّتْ عَيْنَاهُ مِنَ الْحُزْنِ فَهُوَ كَظِيمٌ)",
    "options": [
      'يَا أَسَفَى عَلَى يُوسُفَ',
      'يَا أَسَفَى',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "أكمل من قوله تعالى(يَا بَنِيَّ اذْهَبُواْ فَتَحَسَّسُواْ مِن يُوسُفَ وَأَخِيهِ وَلاَ تَيْأَسُواْ مِن رَّوْحِ اللَّهِ إِنَّهُ لاَ يَيْأَسُ مِن رَّوْحِ اللَّهِ ..........)",
    "options": [
      'إِلاَّ الْقَوْمُ الَّظَالِمُونَ',
      'إِلاَّ الْقَوْمُ الْكَافِرُونَ',
    ],
    "answer_index":1,
  },
  {
    "id": 17,
    "question": "(فَلَمَّا دَخَلُواْ عَلَيْهِ قَالُواْ يَا أَيُّهَا الْعَزِيزُ مَسَّنَا وَأَهْلَنَا الضُّرُّ وَجِئْنَا بِبِضَاعَةٍ مُّزْجَاةٍ فَأَوْفِ لَنَا الْكَيْلَ وَتَصَدَّقْ عَلَيْنَا إِنَّ اللَّهَ يَجْزِي الْمُتَصَدِّقِينَ)، ما معنى مُّزْجَاةٍ......",
    "options": [
      'جيدة صالحة',
      'رديئة كاسدة',
    ],
    "answer_index": 1,
  },
  {
    "id": 18,
    "question": "(قَالَ لاَ تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللَّهُ لَكُمْ وَهُوَ أَرْحَمُ الرَّاحِمِينَ) ،ما معنى تَثْرِيبَ.....",
    "options": [
      'فضل',
      'تأنيب ولوم',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "(وَلَمَّا فَصَلَتِ الْعِيرُ قَالَ أَبُوهُمْ إِنِّي لَأَجِدُ رِيحَ يُوسُفَ لَوْلاَ أَن تُفَنِّدُونِ)، ما معنى تُفَنِّدُونِ.....",
    "options": [
      'تصدقون',
      'تكذبون',
    ],
    "answer_index": 1,
  },
  {
    "id": 20,
    "question": "أكمل من قوله تعالى (لَقَدْ كَانَ فِي قَصَصِهِمْ عِبْرَةٌ لِّأُولِي الأَلْبَابِ مَا كَانَ حَدِيثًا يُفْتَرَى ................)",
    "options": [
      'وَلَكِن تَصْدِيقَ الَّذِي بَيْنَ يَدَيْهِ وَهُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ',
      'وَلَكِن تَصْدِيقَ الَّذِي بَيْنَ يَدَيْهِ وَتَفْصِيلَ كُلَّ شَيْءٍ وَهُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ',
    ],
    "answer_index": 1,
  },
];





const List infoQuranFiveTwo =
[
  {
    "id": 1,
    "question": "أكمل من قوله تعالى (وَيُبَشِّرَ الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصَّالِحَاتِ...........)",
    "options": [
      'أَنَّ لَهُمْ أَجْرًا حَسَنًا',
      'أَنَّ لَهُمْ أَجْرًا كَبِيرًا',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "أكمل من قوله تعالى (مَن يَهْدِ اللهُ فَهُوَ الْمُهْتَدِ وَمَن يُضْلِلْ.......)",
    "options": [
      'فَأُولَئِكَ هُمُ الْخَاسِرُون',
      'فَلَن تَجِدَ لَهُ وَلِيًّا مُرْشِدًا',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "(وَتَرَى الشَّمْسَ إِذَا طَلَعَت تَّزَاوَرُ عَن كَهْفِهِمْ ذَاتَ الْيَمِينِ وَإِذَا غَرَبَت تَّقْرِضُهُمْ)  ، معنى كلمة تَّقْرِضُهُمْ.....",
    "options": [
      'تبتعد',
      'تقترب',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "أكمل من قوله تعالى (......مِن كِتَابِ رَبِّكَ لا مُبَدِّلَ لِكَلِمَاتِهِ وَلَن تَجِدَ مِن دُونِهِ مُلْتَحَدًا)",
    "options": [
      'وَاتْلُ مَا أُوحِيَ إِلَيْكَ',
      'اتْلُ مَا أُوحِيَ إِلَيْكَ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "أكمل من قوله تعالى (........الَّذِينَ يَدْعُونَ رَبَّهُم بِالْغَدَوةِ وَالْعَشِىِّ يُرِيدُونَ وَجْهَهُ )",
    "options": [
      'وَاصْبِرْ نَفْسَكَ مَعَ',
      'وَلا تَطْرُدِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "(وَقُلِ الْحَقُّ مِن رَّبِّكُمْ فَمَن شَاء فَلْيُؤْمِن وَمَن شَاء فَلْيَكْفُرْ إِنَّا أَعْتَدْنَا لِلظَّالِمِينَ نَارًا أَحَاطَ بِهِمْ سُرَادِقُهَا)  ، معنى كلمة سُرَادِقُهَا.....",
    "options": [
      'حائط من نار',
      'زيت مغلي',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "أكمل من قوله تعالى (وَلَمْ تَكُن لَهُ  فِئَةٌ يَنصُرُونَهُ مِن دُونِ اللهِ.......)",
    "options": [
      'وَمَا كَانَ مِنَ الْمُنتَصِرِين',
      'وَمَا كَانَ مُنتَصِرًا',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "أكمل من قوله تعالى (وَالْبَاقِيَاتُ الصَّالِحَاتُ خَيْرٌ عِندَ رَبِّكَ ثَوَابًا.......)",
    "options": [
      'وَخَيْرٌ أَمَلا',
      'وَخَيْرٌ مَّرَدًّا',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "أكمل من قوله تعالى (...........كَمَاءٍ أَنزَلْنَاهُ مِِنَ السَّمَاءِ فَاخْتَلَطَ بِهِ نَبَاتُ الأَرْضِ)",
    "options": [
      'وَاضْرِبْ لَهُم مَّثَلَ الْحَيَوةِ الدُّنْيَا',
      'إِنَّمَا مَثَلُ الْحَيَوةِ الدُّنْيَا',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "(وَيَوْمَ يَقُولُ نَادُوا شُرَكَائِيَ الَّذِينَ زَعَمْتُمْ فَدَعَوْهُمْ فَلَمْ يَسْتَجِيبُوا لَهُمْ وَجَعَلْنَا بَيْنَهُم مَّوْبِقًا) ، ما معنى كلمة مَّوْبِقًا.....",
    "options": [
      'مهلكا يشتركون فيه وهو النار',
      'نجاة يشتركون فيها وهي الجنة',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "أكمل من قوله تعالى (وَإِذْ قُلْنَا لِلْمَلائِكَةِ اسْجُدُوا لآدَمَ فَسَجَدُوا إِلاَّ إِبْلِيسَ.......)",
    "options": [
      'أَبَى وَاسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِين',
      'كَانَ مِنَ الْجِنِّ فَفَسَقَ عَنْ أَمْرِ رَبِّهِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "أكمل من قوله تعالى (وَمَا مَنَعَ النَّاسَ أَن يُؤْمِنُوا إِذْ جَاءَهُمُ الْهُدَى........)",
    "options": [
      'إِلاَّ أَن قَالُوا أَبَعَثَ اللهُ بَشَرًا رَّسُولاً',
      'وَيَسْتَغْفِرُوا رَبَّهُمْ إلاَّ أَن تَأْتِيَهُمْ سُنَّةُ الأَوَّلِين أوْ يَأْتِيَهُمُ الْعَذَابُ قُبُلاً',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "أكمل من قوله تعالى (وَمَا نُرْسِلُ الْمُرْسَلِينَ إِلاَّ مُبَشِّرِينَ وَمُنذِرِينَ.........)",
    "options": [
      'وَيُجَادِلُ الَّذِينَ كَفَرُوا بِالْبَاطِلِ لِيُدْحِضُوا بِهِ الْحَقَّ وَاتَّخَذُوا آيَاتِي وَمَا أُنذِرُوا هُزُوًا',
      'فَمَنۡ ءَامَنَ وَأَصۡلَحَ فَلَا خَوۡفٌ عَلَيۡهِمۡ وَلَا هُمۡ يَحۡزَنُونَ',
     ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "أكمل من قوله تعالى (وَمَنْ أَظْلَمُ مِمَّن ذُكِّرَ بِآيَاتِ رَبِّهِ.......)",
    "options": [
      'فَأَعْرَضَ عَنْهَا وَنَسِيَ مَا قَدَّمَتْ يَدَاهُ إِنَّا جَعَلْنَا عَلَى قُلُوبِهِمْ أَكِنَّةً أَن يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا وَإِن تَدْعُهُمْ إِلَى الْهُدَى فَلَن يَهْتَدُوا إِذًا أَبَدًا',
      'ثُمَّ أَعۡرَضَ عَنۡهَآۚ إِنَّا مِنَ ٱلۡمُجۡرِمِينَ مُنتَقِمُونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "(فَلَمَّا جَاوَزَا قَالَ لِفَتَاهُ آتِنَا غَدَاءَنَا لَقَدْ لَقِينَا مِن سَفَرِنَا هَذَا نَصَبًا) ما معنى كلمة نَصَبًا......",
    "options": [
      'تعبًا',
      'راحة',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "أكمل من قوله تعالى (فَانطَلَقَا حَتَّى إِذَا رَكِبَا فِي السَّفِينَةِ خَرَقَهَا قَالَ أَخَرَقْتَهَا لِتُغْرِقَ أَهْلَهَا لَقَدْ جِئْتَ شَيْئًا إِمْرًا.......)",
    "options": [
      'قَالَ أَلَمْ أَقُلْ إِنَّكَ لَن تَسْتَطِيعَ مَعِيَ صَبْرًا',
      'قَالَ أَلَمْ أَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِي صَبْرًا',
    ],
    "answer_index":0 ,
  },
  {
    "id": 17,
    "question": "أكمل من قوله تعالى (فَانطَلَقَا حَتَّى إِذَا لَقِيَا غُلامًا فَقَتَلَهُ قَالَ أَقَتَلْتَ نَفْسًا زَكِيَّةً بِغَيْرِ نَفْسٍ......)",
    "options": [
      'لَقَدْ جِئْتَ شَيْئًا إِمْرًا',
      'لَّقَدْ جِئْتَ شَيْئًا نُّكْرًا',
    ],
    "answer_index": 1,
  },
  {
    "id": 18,
    "question": "أكمل من قوله تعالى (قَالَ هَذَا فِرَاقُ بَيْنِي وَبَيْنِكَ سَأُنَبِّئُكَ بِتَأْوِيلِ مَا لَمْ .......)",
    "options": [
      'تَسْتَطِع عَّلَيْهِ صَبْرًا',
      'تَسْطِع عَّلَيْهِ صَبْرًا',
    ],
    "answer_index": 0,
  },
  {
    "id": 19,
    "question": "(آتُونِي زُبَرَ الْحَدِيدِ حَتَّى إِذَا سَاوَى بَيْنَ الصَّدَفَيْنِ قَالَ انفُخُوا حَتَّى إِذَا جَعَلَهُ نَارًا قَالَ آتُونِي أُفْرِغْ عَلَيْهِ قِطْرًا) ، ما معنى كلمة قِطْرًا......",
    "options": [
      'نحاس مذاب',
      'حديد مذاب',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "أكمل من قوله تعالى (قُلْ إِنَّمَا أَنَا بَشَرٌ مِّثْلُكُمْ يُوحَى إِلَيَّ أَنَّمَا إِلَهُكُمْ إِلَهٌ وَاحِدٌ........)",
    "options": [
      'فَاسْتَقِيمُوا إِلَيْهِ وَاسْتَغْفِرُوهُ وَوَيْلٌ لِّلْمُشْرِكِينَ',
      'فَمَن كَانَ يَرْجُو لِقَاء رَبِّهِ فَلْيَعْمَلْ عَمَلا صَالِحًا وَلا يُشْرِكْ بِعِبَادَةِ رَبِّهِ أَحَدًا',
    ],
    "answer_index": 1,
  },
];




const List infoQuranFiveFour =
[
  {
    "id": 1,
    "question": "أكمل من قوله تعالى (الزَّانِيَةُ وَالزَّانِي فَاجْلِدُوا كُلَّ وَاحِدٍ مِّنْهُمَا .........)",
    "options": [
      'مِائَةَ جَلْدَةٍ',
      'ثَمَانِينَ جَلْدَةً',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "أكمل من قوله تعالى (إِلاَّ الَّذِينَ تَابُوا مِن بَعْدِ ذَلِكَ وَأَصْلَحُوا فَإِنَّ اللَّهَ........)",
    "options": [
      'غَفُورٌ رَّحِيمٌ',
      'رَءُوفٌ رَّحِيمٌ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "أكمل من قوله تعالى ( وَالْخَامِسَةُ أَنَّ .........اللَّهِ عَلَيْهِ إِن كَانَ مِنَ الْكَاذِبِينَ)",
    "options": [
      'غَضَبَ',
      'لَعْنَتَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "أكمل من قوله تعالى (وَالْخَامِسَةَ أَنَّ ...........اللَّهِ عَلَيْهَا إِن كَانَ مِنَ الصَّادِقِينَ)",
    "options": [
      'غَضَبَ',
      'لَعْنَتَ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "أكمل من قوله تعالى ( وَلَوْلا فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ........)",
    "options": [
      'لاَتَّبَعْتُمُ الشَّيْطَانَ إِلاَّ قَلِيلاً',
      'وَأَنَّ اللَّهَ تَوَّابٌ حَكِيمٌ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "أكمل من قوله تعالى (إِذْ تَلَقَّوْنَهُ بِأَلْسِنَتِكُمْ وَتَقُولُونَ بِأَفْوَاهِكُم مَّا لَيْسَ لَكُم بِهِ عِلْمٌ وَتَحْسَبُونَهُ هَيِّنًا.........)",
    "options": [
      'وَهُوَ عِندَ اللَّهِ كَبِير',
      'وَهُوَ عِندَ اللَّهِ عَظِيمٌ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "أكمل من قوله تعالى (يَوْمَ تَشْهَدُ عَلَيْهِمْ أَلْسِنَتُهُمْ وَأَيْدِيهِمْ وَأَرْجُلُهُم ..........)",
    "options": [
      'بِمَا كَانُوا يَفْعَلُونَ',
      'بِمَا كَانُوا يَعْمَلُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "أكمل من قوله تعالى (الْخَبِيثَاتُ لِلْخَبِيثِينَ وَالْخَبِيثُونَ لِلْخَبِيثَاتِ وَالطَّيِّبَاتُ لِلطَّيِّبِينَ وَالطَّيِّبُونَ لِلطَّيِّبَاتِ أُوْلَئِكَ مُبَرَّؤُونَ مِمَّا يَقُولُونَ لَهُم مَّغْفِرَةٌ ......)",
    "options": [
      'وَرِزْقٌ كَرِيمٌ',
      'وَرِزْقٌ كَبِيرٌ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "أكمل من قوله تعالى (يَا أَيُّهَا الَّذِينَ آمَنُوا لا تَدْخُلُوا بُيُوتًا غَيْرَ بُيُوتِكُمْ حَتَّى تَسْتَأْنِسُوا وَتُسَلِّمُوا عَلَى أَهْلِهَا ذَلِكُمْ خَيْرٌ لَّكُمْ.........)",
    "options": [
      'لَعَلَّكُمْ تَتَّقُونَ',
      'لَعَلَّكُمْ تَذَكَّرُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "(وَقُل لِّلْمُؤْمِنَاتِ يَغْضُضْنَ مِنْ أَبْصَارِهِنَّ وَيَحْفَظْنَ فُرُوجَهُنَّ وَلا يُبْدِينَ زِينَتَهُنَّ إِلاَّ مَا ظَهَرَ مِنْهَا وَلْيَضْرِبْنَ بِخُمُرِهِنَّ عَلَى جُيُوبِهِنَّ وَلا يُبْدِينَ زِينَتَهُنَّ إِلاَّ لِبُعُولَتِهِنَّ أَوْ آبَائِهِنَّ أَوْ آبَاء بُعُولَتِهِنَّ أَوْ أَبْنَائِهِنَّ أَوْ أَبْنَاء بُعُولَتِهِنَّ أَوْ إِخْوَانِهِنَّ أَوْ بَنِي إِخْوَانِهِنَّ أَوْ بَنِي أَخَوَاتِهِنَّ أَوْ نِسَائِهِنَّ أَوْ مَا مَلَكَتْ أَيْمَانُهُنَّ أَوِ التَّابِعِينَ غَيْرِ أُولِي الإِرْبَةِ مِنَ الرِّجَالِ أَوِ الطِّفْلِ الَّذِينَ لَمْ يَظْهَرُوا عَلَى عَوْرَاتِ النِّسَاء وَلا يَضْرِبْنَ بِأَرْجُلِهِنَّ لِيُعْلَمَ مَا يُخْفِينَ مِن زِينَتِهِنَّ وَتُوبُوا إِلَى اللَّهِ جَمِيعًا أَيُّهَا الْمُؤْمِنُونَ لَعَلَّكُمْ تُفْلِحُونَ)،  ما معنى جُيُوبِهِنَّ......",
    "options": [
      'صدورهن وما حواليها',
      'رِقابهِن',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "أكمل من قوله تعالى (وَأَنكِحُوا الأَيَامَى مِنكُمْ وَالصَّالِحِينَ مِنْ عِبَادِكُمْ وَإِمَائِكُمْ إِن يَكُونُوا فُقَرَاء يُغْنِهِمُ اللَّهُ مِن فَضْلِهِ.......)",
    "options": [
      'وَاللَّهُ سَمِيعٌ عَلِيمٌ',
      'وَاللَّهُ وَاسِعٌ عَلِيمٌ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "(وَلْيَسْتَعْفِفِ الَّذِينَ لا يَجِدُونَ نِكَاحًا حَتَّى يُغْنِيَهُمْ اللَّهُ مِن فَضْلِهِ وَالَّذِينَ يَبْتَغُونَ الْكِتَابَ مِمَّا مَلَكَتْ أَيْمَانُكُمْ فَكَاتِبُوهُمْ إِنْ عَلِمْتُمْ فِيهِمْ خَيْرًا وَآتُوهُم مِّن مَّالِ اللَّهِ الَّذِي آتَاكُمْ وَلا تُكْرِهُوا فَتَيَاتِكُمْ عَلَى الْبِغَاء إِنْ أَرَدْنَ تَحَصُّنًا لِّتَبْتَغُوا عَرَضَ الْحَيَاةِ الدُّنْيَا وَمَن يُكْرِههُّنَّ فَإِنَّ اللَّهَ مِن بَعْدِ إِكْرَاهِهِنَّ غَفُورٌ رَّحِيمٌ) ، ما معنى الْبِغَاء....",
    "options": [
      'الحياء',
      'الزنى',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "أكمل من قوله تعالى (وَلَقَدْ أَنزَلْنَا إِلَيْكُمْ آيَاتٍ.......وَمَثَلا مِّنَ الَّذِينَ خَلَوْا مِن قَبْلِكُمْ وَمَوْعِظَةً لِّلْمُتَّقِينَ)",
    "options": [
      'مُّبَيِّنَاتٍ',
      'بَيِّنَاتٍ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "أكمل من قوله تعالى (أَلَمْ تَرَ أَنَّ اللَّهَ يُسَبِّحُ لَهُ مَن فِي السَّمَاوَاتِ وَالأَرْضِ وَالطَّيْرُ صَافَّاتٍ كُلٌّ قَدْ عَلِمَ صَلاتَهُ وَتَسْبِيحَهُ ...........)",
    "options": [
      'إِنَّ اللَّهَ عَلِيمٌ بِمَا يَصْنَعُونَ',
      'وَاللَّهُ عَلِيمٌ بِمَا يَفْعَلُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "(أَوْ كَظُلُمَاتٍ فِي بَحْرٍ لُّجِّيٍّ يَغْشَاهُ مَوْجٌ مِّن فَوْقِهِ مَوْجٌ مِّن فَوْقِهِ سَحَابٌ ) ، ما معنى بَحْرٍ لُّجِّيٍّ",
    "options": [
      'عميق كثير الماء',
      'ضحل قليل الماء',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "أكمل من قوله تعالى (أَفِي قُلُوبِهِم مَّرَضٌ أَمِ ارْتَابُوا أَمْ يَخَافُونَ أَن يَحِيفَ اللَّهُ عَلَيْهِمْ وَرَسُولُهُ بَلْ أُوْلَئِكَ.......)",
    "options": [
      'هُمُ الْفَاسِقُونَ',
      'هُمُ الظَّالِمُونَ',
    ],
    "answer_index":1 ,
  },
  {
    "id": 17,
    "question": "(أَلَمْ تَرَ أَنَّ اللَّهَ يُزْجِي سَحَابًا ثُمَّ يُؤَلِّفُ بَيْنَهُ ثُمَّ يَجْعَلُهُ رُكَامًا فَتَرَى الْوَدْقَ يَخْرُجُ مِنْ خِلالِهِ) ، ما معنى الْوَدْقَ....",
    "options": [
      'البرق',
      'المطر',
    ],
    "answer_index": 1,
  },
  {
    "id": 18,
    "question": "أكمل من قوله تعالى (........فَإِن تَوَلَّوْا فَإِنَّمَا عَلَيْهِ مَا حُمِّلَ وَعَلَيْكُم مَّا حُمِّلْتُمْ وَإِن تُطِيعُوهُ تَهْتَدُوا وَمَا عَلَى الرَّسُولِ إِلاَّ الْبَلاغُ الْمُبِينُ)",
    "options": [
      'قُلْ أَطِيعُوا اللَّهَ وَالرَّسُولَ ۖ',
      'قُلْ أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "أكمل من قوله تعالى (وَأَقِيمُوا الصَّلاةَ وَآتُوا الزَّكَاةَ.......)",
    "options": [
      'وَارْكَعُوا مَعَ الرَّاكِعِينَ',
      'وَأَطِيعُوا الرَّسُولَ لَعَلَّكُمْ تُرْحَمُونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "أكمل من قوله تعالى (لا تَحْسَبَنَّ الَّذِينَ كَفَرُوا مُعْجِزِينَ فِي الأَرْضِ وَمَأْوَاهُمُ النَّارُ........)",
    "options":[
      'وَبِئْسَ الْمَصِيرُ',
      'وَلَبِئْسَ الْمَصِيرُ',
    ],
    "answer_index": 1,
  },
    {
    "id": 21,
    "question": "أكمل من قوله تعالى (لا تَجْعَلُوا دُعَاء الرَّسُولِ بَيْنَكُمْ........قَدْ يَعْلَمُ اللَّهُ الَّذِينَ يَتَسَلَّلُونَ مِنكُمْ لِوَاذًا فَلْيَحْذَرِ الَّذِينَ يُخَالِفُونَ عَنْ أَمْرِهِ أَن تُصِيبَهُمْ فِتْنَةٌ أَوْ يُصِيبَهُمْ عَذَابٌ أَلِيمٌٌ)",
    "options":[
      'كَدُعَاء بَعْضِكُم لِبَعْضُ',
      'كَدُعَاء بَعْضِكُم بَعْضًاُ',
    ],
    "answer_index": 1,
  },

];






const List infoQuranSix =
[
  {
    "id": 1,
    "question": "في أي سورة وردت هذه الآية (وَكُلُّهُمْ آتِيهِ يَوْمَ الْقِيَامَةِ فَرْدًا)",
    "options": [
      'يوسف',
      'الكهف',
      'مريم',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "في أي سورة وردت هذه الآية (فَلَا تَخْضَعْنَ بِالْقَوْلِ فَيَطْمَعَ الَّذِي فِي قَلْبِهِ مَرَضٌ وَقُلْنَ قَوْلًا مَّعْرُوفًا)",
    "options": [
      'النور',
      'الأنبياء',
      'الأحزاب',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "في أي سورة وردت هذه الآية (قُل لِّلْمُؤْمِنِينَ يَغُضُّوا مِنْ أَبْصَارِهِمْ وَيَحْفَظُوا فُرُوجَهُمْ ۚ ذَٰلِكَ أَزْكَىٰ لَهُمْ ۗ إِنَّ اللَّهَ خَبِيرٌ بِمَا يَصْنَعُونَ)",
    "options": [
      'البقرة',
      'الأنبياء',
      'النور',
    ],
    "answer_index":2 ,
  },
  {
    "id": 4,
    "question": "في أي سورة وردت هذه الآية (إِذْ تَلَقَّوْنَهُ بِأَلْسِنَتِكُمْ وَتَقُولُونَ بِأَفْوَاهِكُم مَّا لَيْسَ لَكُم بِهِ عِلْمٌ وَتَحْسَبُونَهُ هَيِّنًا وَهُوَ عِندَ اللَّهِ عَظِيمٌ)",
    "options": [
      'الفرقان',
      'النور',
      'الأحزاب',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "في أي سورة وردت هذه الآية (أَفَأَمِنُوا مَكْرَ اللَّهِ ۚ فَلَا يَأْمَنُ مَكْرَ اللَّهِ إِلَّا الْقَوْمُ الْخَاسِرُونَ)",
    "options": [
      'الأعراف',
      'الفرقان',
      'النور',
    ],
    "answer_index":0 ,
  },
  {
    "id": 6,
    "question": "في أي سورة وردت هذه الآية (وَلَٰكِن لَّا تُوَاعِدُوهُنَّ سِرًّا إِلَّا أَن تَقُولُوا قَوْلًا مَّعْرُوفًا ۚ وَلَا تَعْزِمُوا عُقْدَةَ النِّكَاحِ حَتَّىٰ يَبْلُغَ الْكِتَابُ أَجَلَهُ ۚ وَاعْلَمُوا أَنَّ اللَّهَ يَعْلَمُ مَا فِي أَنفُسِكُمْ فَاحْذَرُوهُ ۚ وَاعْلَمُوا أَنَّ اللَّهَ غَفُورٌ حَلِيمٌ)",
    "options": [
      'البقرة',
      'آل عمران',
      'النساء',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "في أي سورة وردت هذه الآية (فَانكِحُوهُنَّ بِإِذْنِ أَهْلِهِنَّ وَآتُوهُنَّ أُجُورَهُنَّ بِالْمَعْرُوفِ مُحْصَنَاتٍ غَيْرَ مُسَافِحَاتٍ وَلَا مُتَّخِذَاتِ أَخْدَانٍ ۚ)",
    "options": [
      'البقرة',
      'النساء',
      'المائدة',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "في أي سورة وردت هذه الآية (وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ ۖ وَعَسَىٰ أَن تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَّكُمْ ۗ وَاللَّهُ يَعْلَمُ وَأَنتُمْ لَا تَعْلَمُونَ)",
    "options": [
      'البقرة',
      'المائدة',
      'النساء',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "في أي سورة وردت هذه الآية (وَلَنَبْلُوَنَّكُم بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ)",
    "options": [
      'البقرة',
      'الأنعام',
      'الأعراف',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "في أي سورة وردت هذه الآية (وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ ۖ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ ۖ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ)",
    "options": [
      'البقرة',
      'الأنعام',
      'الزمر',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "في أي سورة وردت هذه الآية (وَأَيُّوبَ إِذْ نَادَىٰ رَبَّهُ أَنِّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرْحَمُ الرَّاحِمِينَ  فَاسْتَجَبْنَا لَهُ)",
    "options": [
      'البقرة',
      'آل عمران',
      'الأنبياء',
    ],
    "answer_index": 2,
  },
  {
    "id": 12,
    "question": "في أي سورة وردت هذه الآية (وَذَا النُّونِ إِذ ذَّهَبَ مُغَاضِبًا فَظَنَّ أَن لَّن نَّقْدِرَ عَلَيْهِ فَنَادَى فِي الظُّلُمَاتِ أَن لّا إِلَهَ إِلاَّ أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ فَاسْتَجَبْنَا لَهُ)",
    "options": [
      'الأنبياء',
      'البقرة',
      'آل عمران',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "في أي سورة وردت هذه الآية (وَزَكَرِيَّا إِذْ نَادَى رَبَّهُ رَبِّ لا تَذَرْنِي فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ فَاسْتَجَبْنَا لَهُ)",
    "options": [
      'مريم',
      'الأنبياء',
      'البقرة',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "في أي سورة وردت هذه الآية (وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَهُوَ حَسْبُهُ إِنَّ اللَّهَ بَالِغُ أَمْرِهِ قَدْ جَعَلَ اللَّهُ لِكُلِّ شَيْءٍ قَدْرًا‏)",
    "options": [
      'القمر',
      'الحشر',
      'الطلاق',
    ],
    "answer_index": 2,
  },
  {
    "id": 15,
    "question": "في أي سورة وردت هذه الآية (إِنَّ اللَّهَ لَا يَظْلِمُ النَّاسَ شَيْئًا وَلَٰكِنَّ النَّاسَ أَنفُسَهُمْ يَظْلِمُونَ)",
    "options": [
      'يونس',
      'القصص',
      'الأحزاب',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "في أي سورة وردت هذه الآية (قَالَ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي فَاغْفِرْ لِي فَغَفَرَ لَهُ ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ)",
    "options": [
      'الأحزاب',
      'يونس',
      'القصص',
    ],
    "answer_index": 2,
  },
  {
    "id": 17,
    "question": "في أي سورة وردت هذه الآية (لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا مَا آتَاهَا ۚ سَيَجْعَلُ اللَّهُ بَعْدَ عُسْرٍ يُسْرًا)",
    "options": [
      'البقرة',
      'النساء',
      'الطلاق',
    ],
    "answer_index": 2,
  },
  {
    "id": 18,
    "question": "في أي سورة وردت هذه الآية (وَلَا تَيْأَسُوا مِن رَّوْحِ اللَّهِ ۖ إِنَّهُ لَا يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلَّا الْقَوْمُ الْكَافِرُونَ)",
    "options": [
      'يونس',
      'يوسف',
      'محمد',
    ],
    "answer_index": 1,
  },
  {
    "id":19,
    "question": "في أي سورة وردت هذه الآية (وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُونَ  فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ السَّاجِدِينَ  وَاعْبُدْ رَبَّكَ حَتَّىٰ يَأْتِيَكَ الْيَقِينُ)",
    "options": [
      'الحُجرات',
      'الحِجر',
      'النحل',
    ],
    "answer_index": 1,
  },
  {
    "id": 20,
    "question": "في أي سورة وردت هذه الآية (قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا تَقْنَطُوا مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيم)",
    "options": [
      'البقرة',
      'الحجر',
      'الزمر',
    ],
    "answer_index": 2,
  },
];


const List infoQuranSeven =
[
  {
    "id": 1,
    "question": "ما هي أقصر سورة في القرآن.....",
    "options": [
      '	الفلق',
      '	الناس',
      '	الكوثر',
    ],
    "answer_index":2 ,
  },
  {
    "id": 2,
    "question": "ما هي السورة التي تعدل ثلث القران.....",
    "options": [
      '	الإخلاص',
      '	الملك',
      'الفجر',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "ما هي السورة التي لا يوجد بأولها البسملة (بسم الله الرحمن الرحيم).....",
    "options": [
      '	الأعراف',
      '	التوبة',
      '	الحج',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "في أي سورة توجد آية الكرسي.....",
    "options": [
      'البقرة',
      '	المائدة',
      '	الأنفال',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "ما هي السورة التي ذكر فيها الخبز......",
    "options": [
      '	مريم',
      '	يوسف',
      '	الزلزلة',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "ما هي السورة التي ورد فيها قصة قابيل و هابيل......",
    "options": [
      'المائدة',
      '	آل عمران',
      'البقرة',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "ما هي السورة التي بها أطول كلمة في القرآن......",
    "options": [
      'الحجر',
      'البقرة',
      'المجادلة',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "ما هي السورة التي بها أطول آية في القرآن.....",
    "options": [
      'الحجر',
      'البقرة',
      'المجادلة',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "ما هي السورة التى انتهت بوقت من أوقات الصلاة",
    "options": [
      'العلق',
      'العصر',
      'القدر',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "ما هي السورة التي ذكرت فيها البسملة مرتين.....",
    "options": [
      'الحج',
      'النمل',
      'المعارج',
    ],
    "answer_index": 1,
  },

];






const List infoQuranFiveZero =
[
  {
    "id": 1,
    "question": " اكمل من قوله تعالى (آمَنَ الرَّسُولُ بِمَا أُنْزِلَ .....)",
    "options": [
      'عَلَيْهِ',
      'إِلَيْهِ',
    ],
    "answer_index":1 ,
  },
  {
    "id": 2,
    "question": "اكمل من قوله تعالى (لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ ......)",
    "options": [
      'رُسُلِهِ',
      'مَلَائِكَتِهِ',
      'كُتُبِهِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "اكمل من قوله تعالى (وَقَالُوا سَمِعْنَا .....)",
    "options": [
      'وَعصينا',
      'وَأَطَعْنَا',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "اكمل من قوله تعالى (غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ .....)",
    "options": [
      'الْمَصِيرُ',
      'الْنَصِيرُ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "اكمل من قوله تعالى (رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا .....)",
    "options": [
      'إِثمًا',
      'وِزْرًا',
      'إِصْرًا',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "أكمل من قوله تعالى(أَنْتَ ...... فَانْصُرْنَا)",
    "options": [
      'مَوْلَانَا',
      'نَاْصِرنَا',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "(لَا يُكَلِّفُ اللَّه نَفْسًا) ما حركة الهاء في الله....",
    "options": [
      'فتحة',
      'ضمة',
      'كسرة',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "ما حركة الهاء في ملائكته.....",
    "options": [
      'ضمة',
      'فتحة',
      'كسرة',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "ما حركة الهاء في حملته....",
    "options": [
      'فتحة',
      'ضمة',
      'كسرة',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "(أَنْتَ مَوْلَانَا) تعني",
    "options": [
      'أنت ناصرنا',
      'أنت خالقنا',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "(رَبَّنَا وَلَا تحَمِّلْنَا) ما حركة التاء في تحَمِّلْنَا",
    "options": [
      'فتحة',
      'ضمة',
      'كسرة',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": " اكمل من قوله تعالى (فَانْصُرْنَا عَلَى الْقَوْمِ ......)",
    "options": [
      'الْكَافِرِينَ',
      'الْظَالمينَ',
    ],
    "answer_index": 0,
  },

];





const List infoQuranFiveThree =
[
  {
    "id": 1,
    "question": "أكمل من قوله تعالى (الْحَمْدُ لِلَّهِ الَّذِي أَنزَلَ عَلَى عَبْدِهِ ....... وَلَمْ يَجْعَل لَّهُ عِوَجًا)",
    "options": [
      'القرآن',
      'ٱلۡكِتَٰبَ',
    ],
    "answer_index":1 ,
  },
  {
    "id": 2,
    "question": "أكمل من قوله تعالى (قَيِّمًا لِّيُنذِرَ بَأْسًا شَدِيدًا مِن لَّدُنْهُ ....... الْمُؤْمِنِينَ الَّذِينَ يَعْمَلُونَ الصَّالِحَاتِ أَنَّ لَهُمْ أَجْرًا حَسَنًا)",
    "options": [
      'وَيُنذرَ',
      'وَيُبَشِّرَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "(فَلَعَلَّكَ بَٰخِعٞ نَّفۡسَكَ عَلَىٰٓ ءَاثَٰرِهِمۡ إِن لَّمۡ يُؤۡمِنُواْ بِهَٰذَا ٱلۡحَدِيثِ أَسَفًا) معنى بَٰخِعٞ نَّفۡسَكَ....",
    "options": [
      'قاتلها ومهلكها',
      'منجيها',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من المقصود في هذه الآية (نَّحۡنُ نَقُصُّ عَلَيۡكَ نَبَأَهُم بِٱلۡحَقِّۚ إِنَّهُمۡ فِتۡيَةٌ ءَامَنُواْ بِرَبِّهِمۡ وَزِدۡنَٰهُمۡ هُدٗى)",
    "options": [
      'إخوة يوسف',
      'أصحاب الكهف',
      'أصحاب السبت',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "أكمل من قوله تعالى (وَتَرَى ٱلشَّمۡسَ إِذَا طَلَعَت تَّزَٰوَرُ عَن كَهۡفِهِمۡ  ........",
    "options": [
      'ذَاتَ ٱلشِّمَالِ',
      'ذَاتَ ٱلۡيَمِينِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "(وَتَحۡسَبُهُمۡ أَيۡقَاظٗا وَهُمۡ رُقُودٞۚ وَنُقَلِّبُهُمۡ ذَاتَ ٱلۡيَمِينِ وَذَاتَ ٱلشِّمَالِۖ وَكَلۡبُهُم بَٰسِطٞ ذِرَاعَيۡهِ بِٱلۡوَصِيدِۚ) معنى ٱلۡوَصِيدِۚ.....",
    "options": [
      'الخوف والفزع',
      'فناء الكهف أو عتبة بابه',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "أكمل من قوله تعالى (وَلَبِثُواْ فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ .....)",
    "options": [
      'إلا تِسۡعٗا',
      'وَٱزۡدَادُواْ تِسۡعٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "أكمل من قوله تعالى (إِنَّ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ ......)",
    "options": [
      'إِنَّا لَا نُضِيعُ أَجۡرَ مَنۡ أَحۡسَنَ عَمَلًا',
      'سَيَجْعَلُ لَهُمُ الرَّحْمَٰنُ وُدًّا',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "من المقصود في هذه الآية (وَأُحِيطَ بِثَمَرِهِۦ فَأَصۡبَحَ يُقَلِّبُ كَفَّيۡهِ عَلَىٰ مَآ أَنفَقَ فِيهَا وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا وَيَقُولُ يَٰلَيۡتَنِي لَمۡ أُشۡرِكۡ بِرَبِّيٓ أَحَدٗا)",
    "options": [
      'قارون',
      'فرعون',
      'صاحب الجنتين',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "أكمل من قوله تعالى (وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ ......)",
    "options": [
      'كَانَ مِنَ ٱلۡجِنِّ فَفَسَقَ عَنۡ أَمۡرِ رَبِّهِۦٓۗ',
      'لَمْ يَكُن مِّنَ ٱلسَّٰجِدِينَ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "أكمل من قوله تعالى (فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا حُوتَهُمَا فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ .....)",
    "options": [
      'حُقُبًا',
      'سَرَبٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "من المقصود في هذه الآية (فَلَمَّا جَاوَزَا قَالَ لِفَتَىٰهُ ءَاتِنَا غَدَآءَنَا لَقَدۡ لَقِينَا مِن سَفَرِنَا هَٰذَا نَصَبٗا)",
    "options": [
      'ذي القرنين',
      'نبي الله عيسى',
      'نبي الله موسى',
    ],
    "answer_index": 2,
  },
  {
    "id": 13,
    "question": "(فَٱنطَلَقَا حَتَّىٰٓ إِذَا رَكِبَا فِي ٱلسَّفِينَةِ خَرَقَهَاۖ قَالَ أَخَرَقۡتَهَا لِتُغۡرِقَ أَهۡلَهَا لَقَدۡ جِئۡتَ شَيۡـًٔا إِمۡرٗا ) معنى إِمۡرٗا....",
    "options": [
      'أمراً عظيماً صائبًا',
      'أمراً عظيماً منكراً',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "أكمل من تعالى (إِنَّا مَكَّنَّا لَهُۥ فِي ٱلۡأَرۡضِ وَءَاتَيۡنَٰهُ مِن كُلِّ شَيۡءٖ سَبَبٗا......)",
    "options": [
      'ثُمَّ أَتۡبَعَ سَبَبًا',
      'فَأَتۡبَعَ سَبَبًا',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "أكمل من قوله تعالى (وَٱتۡلُ مَآ أُوحِيَ إِلَيۡكَ مِن كِتَابِ رَبِّكَۖ لَا مُبَدِّلَ لِكَلِمَٰتِهِۦ وَلَن تَجِدَ مِن دُونِهِۦ .......)",
    "options": [
      'مُلۡتَحَدٗا',
      'موئلاً',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "أكمل من قوله تعالى (فَٱنطَلَقَا حَتَّىٰٓ إِذَا لَقِيَا غُلَٰمٗا فَقَتَلَهُۥ قَالَ أَقَتَلۡتَ نَفۡسٗا زَكِيَّةَۢ بِغَيۡرِ نَفۡسٖ لَّقَدۡ جِئۡتَ شَيۡـٔٗا نُّكۡرٗا......",
    "options": [
      'قَالَ أَلَمۡ أَقُل لَّكَ إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا',
      'قَالَ أَلَمۡ أَقُل إِنَّكَ لَن تَسۡتَطِيعَ مَعِيَ صَبۡرٗا',
    ],
    "answer_index":0 ,
  },
  {
    "id": 17,
    "question": "من المقصود في هذه الآية(حَتَّىٰٓ إِذَا بَلَغَ مَطۡلِعَ ٱلشَّمۡسِ وَجَدَهَا تَطۡلُعُ عَلَىٰ قَوۡمٖ لَّمۡ نَجۡعَل لَّهُم مِّن دُونِهَا سِتۡرٗا )",
    "options": [
      'صاحب الجنتين',
      'عزيز مصر',
      'ذي القرنين',
    ],
    "answer_index": 2,
  },
  {
    "id": 18,
    "question": "أكمل من قوله تعالى(قَالَ مَا مَكَّنِّي فِيهِ رَبِّي خَيۡرٞ فَأَعِينُونِي بِقُوَّةٍ أَجۡعَلۡ بَيۡنَكُمۡ وَبَيۡنَهُمۡ ........)",
    "options": [
      'رَدۡمًا',
      'سَدًا',
    ],
    "answer_index": 0,
  },

];








const List infoQuranThreeOne =
[
  {
    "id": 1,
    "question": "من السيدة المقصودة في هذه الآية (فَضَحِكَتْ فَبَشَّرْنَاهَا بِإِسْحَاقَ وَمِن وَرَاءِ إِسْحَاقَ يَعْقُوبَ)",
    "options": [
      'السيدة هاجر',
      'السيدة سارة',
      '	السيدة مريم ابنت عمران',
    ],
    "answer_index":1 ,
  },
  {
    "id": 2,
    "question": "من السيدة المقصودة في هذه الآية (قَالَتْ أَنَّى يَكُونُ لِي غُلامٌ وَلَمْ يَمْسَسْنِي بَشَرٌ وَلَمْ أَكُ بَغِيًّا)",
    "options": [
      'ملكة سبأ',
      'امرأة العزيز',
      'مريم ابنة عمران',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "من السيدة المقصودة في هذه الآية (وَرَاوَدَتْهُ الَّتِي هُوَ فِي بَيْتِهَا عَن نَّفْسِهِ وَغَلَّقَتِ الأَبْوَابَ)",
    "options": [
      '	امرأة العزيز',
      '	امرأة فرعون',
      '	امرأة نوح',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من السيدة المقصودة في هذه الآية( قَالَتْ رَبِّ إِنِّي ظَلَمْتُ نَفْسِي وَأَسْلَمْتُ مَعَ سُلَيْمَانَ لِلَّهِ رَبِّ الْعَالَمِينَ)",
    "options": [
      '	امرأة لوط',
      'امرأة نوح',
      '	ملكة سبأ',
    ],
    "answer_index":2 ,
  },
  {
    "id": 5,
    "question": "من السيدة المقصودة في هذه الآية (قَالَتْ رَبِّ إِنِّي وَضَعْتُهَا أُنثَى وَاللَّهُ أَعْلَمُ بِمَا وَضَعَتْ وَلَيْسَ الذَّكَرُ كَالأُنثَى وَإِنِّي سَمَّيْتُهَا مَرْيَمَ)",
    "options": [
      '	امرأة العزيز',
      '	امرأة عمران',
      'زوجة نبي الله إبراهيم',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " من السيدة المقصودة (قُرَّتُ عَيْنٍ لِّي وَلَكَ ۖ لَا تَقْتُلُوهُ عَسَىٰ أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَهُمْ لَا يَشْعُرُونَ)",
    "options": [
      'امرأة فرعون',
      '	امرأة العزيز',
      '	امرأة لوط',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من السيدة المقصودة في هذه الآية (أَنْ أَرْضِعِيهِ فَإِذَا خِفْتِ عَلَيْهِ فَأَلْقِيهِ فِي الْيَمِّ وَلا تَخَافِي وَلا تَحْزَنِي إِنَّا رَادُّوهُ إِلَيْكِ وَجَاعِلُوهُ مِنَ الْمُرْسَلِينَ)",
    "options": [
      '	امرأة فرعون',
      '	أم نبي الله موسى',
      '	السيدة مريم ابنة عمران',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من السيدة المقصودة في هذه الآية (فَلَمَّا سَمِعَتْ بِمَكْرِهِنَّ أَرْسَلَتْ إِلَيْهِنَّ وَأَعْتَدَتْ لَهُنَّ مُتَّكَأً وَآتَتْ كُلَّ وَاحِدَةٍ مِّنْهُنَّ سِكِّينًا وَقَالَتِ اخْرُجْ عَلَيْهِنَّ)",
    "options": [
      '	السيدة سارة',
      '	السيدة هاجر',
      '	امرأة العزيز',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": " من السيدة المقصودة في هذه الآية (فَقَالَتْ هَلْ أَدُلُّكُمْ عَلَى أَهْلِ بَيْتٍ يَكْفُلُونَهُ لَكُمْ وَهُمْ لَهُ نَاصِحُونَ)",
    "options": [
      'امرأة فرعون',
      'أخت نبي الله موسى',
      'امرأة العزيز',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من السيدة المقصودة في هذه الآية (فَتَقَبَّلَهَا رَبُّهَا بِقَبُولٍ حَسَنٍ وَأَنبَتَهَا نَبَاتًا حَسَنًا وَكَفَّلَهَا زَكَرِيَّا)",
    "options": [
      '	امرأة عمران',
      '	امرأة فرعون',
      '	مريم ابنة عمران',
    ],
    "answer_index": 2,
  },

  {
    "id": 11,
    "question": "من السيدة المقصودة في هذه الآية (اسْكُنْ أَنتَ وَزَوْجُكَ الْجَنَّةَ وَكُلاَ مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلاَ تَقْرَبَا هَذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ)",
    "options": [
      '	زوجة نبي الله آدم',
      'زوجة نبي الله إبراهيم',
      '	زوجة نبي الله نوح',
    ],
    "answer_index": 0,
  },
];





const List infoQuranSixTwo =
[
  {
    "id": 1,
    "question": " أكمل من قوله تعالى (إِذْ يَقُولُ لِصَاحِبِهِ لاَ تَحْزَنْ إِنَّ اللَّهَ .......",
    "options": [
      'معنا',
      'يرانا',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "أكمل من قوله تعالى (لَا إِلَه إِلَّا أَنْت سُبْحَانَكَ إِنِّي كنت من ......",
    "options": [
      'الشَّاكِرين',
      'الظَّالِمين',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "أكمل من قوله تعالى (وَيَقُولُ الْكَافِرُ يَا لَيْتَنِي كُنْتُ .....",
    "options": [
      'ميتاً',
      'تُرَابًا',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "أكمل من قوله تعالى (وَامْرَأَتُهُ قَائِمَةٌ ..... فَبَشَّرْنَاهَا",
    "options": [
      'فَضَحِكَتْ',
      'فَبَكت',
     ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "أكمل من قوله تعالى (فَأَمَّا مَنْ أُوتِيَ كِتَابَهُ ..... فَيَقُولُ هَاؤُمُ اقْرَءُوا كِتَابِيَهْ)",
    "options": [
      'بيمينه',
      'بشماله',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "أكمل من قوله تعالى (...... خَيْرًا مِمَّا أُخِذَ مِنْكُمْ وَيَغْفِرْ لَكُمْ وَاللَّهُ غَفُورٌ رَحِيم)",
    "options": [
      'يؤتكم',
      'يعوضكم',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "أكمل من قوله تعالى (وَزَكَرِيَّا إِذْ نَادَىٰ رَبَّهُ رَبِّ لَا ..... فَرْدًا وَأَنتَ خَيْرُ الْوَارِثِينَ)",
    "options": [
      'تتركني',
      'تذرني',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "أكمل من قوله تعالى (وَتَحْسَبُونَهُ هَيِّنًا وَهُوَ عِندَ اللَّهِ ....)",
    "options": [
      'عظيم',
      'كبير',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "أكمل من قوله تعالى (وَكُلُّهُمْ آتِيهِ يَوْمَ الْقِيَامَةِ .....)",
    "options": [
      'فَرْدًا',
      '	متساويًا',
     ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "أكمل من قوله تعالى (فَتَبَسَّمَ ضَاحِكًا مِّن ......)",
    "options": [
      'حديثها',
      'قَوْلِهَا',
     ],
    "answer_index": 1,
  },

  {
    "id": 11,
    "question": " أكمل من قوله تعالى (فَلَا تَخْضَعْنَ بِالْقَوْلِ فَيَطْمَعَ الَّذِي فِي قَلْبِهِ مَرَضٌ وَقُلْنَ قَوْلًا ......)",
    "options": [
      'جميلاً',
      'مَّعْرُوفًا',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "أكمل من قوله تعالى (وَلَقَدْ نَعْلَمُ أَنَّكَ يَضِيقُ صَدْرُكَ بِمَا يَقُولُون. فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكُن مِّنَ ......) ",
    "options": [
      'السَّاجِدِين',
      'الحامدين',
    ],
    "answer_index": 0,
  },

];






const List infoQuranSixThree =
[
  {
    "id": 1,
    "question": "أكمل من قوله تعالى (إِذْ قَالَ يُوسُفُ لِأَبِيهِ يَا أَبَتِ إِنِّي رَأَيْتُ ...... كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ)",
    "options": [
      'أَحَدَ عَشَرَ',
      'ثَلاثةَ عَشَرَ',
     ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": " أكمل من قوله تعالى (قالُوا ادْعُ لَنا رَبَّكَ يُبَيِّنْ لَنا مَا لَوْنُها قالَ إِنَّهُ يَقُولُ إِنَّها بَقَرَةٌ ...... فاقِعٌ لَوْنُها تَسُرُّ النَّاظِرِينَ)",
    "options": [
      'حَمْراءُ',
      'صَفْراءُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "أكمل من قوله تعالى (فَعَقَرُوا ....... وَعَتَوْا عَنْ أَمْرِ رَبِّهِمْ وَقَالُوا يَا صَالِحُ ائْتِنَا بِمَا تَعِدُنَا إِن كُنتَ مِنَ الْمُرْسَلِينَ)",
    "options": [
      'البَقَرَةٌ',
     'النَّاقَةَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " أكمل من قوله تعالى (الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ ....... الْقُلُوبُ﴾",
    "options": [
      'تَطْمَئِنُّ',
      '	تَأْمَنُّ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": " أكمل من قوله تعالى (وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِنَ الْأَمْوَالِ وَالْأَنْفُسِ وَالثَّمَرَاتِ وَبَشِّرِ ........)",
    "options": [
      'المُؤمِنينَ',
      'الصَّابِرِينَ',
     ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "أكمل من قوله تعالى (كُلُّ مَنْ عَلَيْهَا ...... وَيَبْقَى وَجْهُ رَبِّكَ ذُو الْجَلالِ وَالإكْرَامِ)",
    "options": [
      'فَانٍ',
      'هَالكٍ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "أكمل من قوله تعالى (قُلْ يَا عِبَادِيَ الَّذِينَ أَسْرَفُوا عَلَىٰ أَنفُسِهِمْ لَا ....... مِن رَّحْمَةِ اللَّهِ ۚ إِنَّ اللَّهَ يَغْفِرُ الذُّنُوبَ جَمِيعًا ۚ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ)",
    "options": [
      'تَقْنَطُوا',
      'تَيْأسُوا',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "أكمل من قوله تعالى (وَعَسَىٰ أَن تَكْرَهُوا شَيْئًا .......)",
    "options": [
      '	وَهُوَ خَيْرٌ لَّكُمْ ۖ',
      '	وَهُوَ شَرٌّ لَّكُمْ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "أكمل من قوله تعالى (وَعَسَىٰ أَن تُحِبُّوا شَيْئًا ....)",
    "options": [
      '	وَهُوَ خَيْرٌ لَّكُمْ ۖ',
      '	وَهُوَ شَرٌّ لَّكُمْ',
    ],
    "answer_index": 1,
  },
];




const List infoQuranThreeOneZero =
[
  {
    "id": 1,
    "question": "أكمل من قوله تعالى (فَبَعَثَ اللَّهُ .... يَبْحَثُ فِي الْأَرْضِ لِيُرِيَهُ كَيْفَ يُوَارِي سَوْءَةَ أَخِيهِ)",
    "options": [
      'غُرَابًا',
      'نَحْلَةً',
      'طَيراً',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": " أكمل من قوله تعالى (وَتَفَقَّدَ الطَّيْرَ فَقَالَ مَا لِيَ لَا أَرَى ...... أَمْ كَانَ مِنَ الْغَائِبِينَ)",
    "options": [
      'الغُرَاب',
      'الْهُدْهُدَ',
      'النَّحلةَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "أكمل من قوله تعالى (قَالُواْ يَٰٓأَبَانَآ إِنَّا ذَهَبۡنَا نَسۡتَبِقُ وَتَرَكۡنَا يُوسُفَ عِندَ مَتَٰعِنَا فَأَكَلَهُ ......)",
    "options": [
      'الحُوتُ',
      'الكَلبُ',
      'ٱلذِّئۡبُۖ',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "كمل من قوله تعالى (وَإِذْ قَالَ مُوسَىٰ لِقَوْمِهِ إِنَّ اللَّهَ يَأْمُرُكُمْ أَن تَذْبَحُوا ......) ۖ",
    "options": [
      '	نَاقةً',
      '	بَقَرَةً',
      '	نَعْجَةً',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "أكمل من قوله تعالى (فَالْتَقَمَهُ .... وَهُوَ مُلِيمٌ﴾",
    "options": [
      'الْحُوتُ',
      'الذئب',
      'الثعلب',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "أكمل من قوله تعالى (وَإِنَّ أَوْهَنَ الْبُيُوتِ لَبَيْتُ ..... لَوْ كَانُوا يَعْلَمُونَ)",
    "options": [
      '	النَملُ',
      'الذئب',
      'العنكبوت',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "أكمل من قوله تعالى (يَوْمَ يَكُونُ النَّاسُ ...... الْمَبْثُوثِ)",
    "options": [
      'كالجَرادِ',
      'النَملِ',
      'كَالْفَرَاشِ',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "أكمل من قوله تعالى (فَأَلْقَاهَا فَإِذَا هِيَ..... تَسْعَىٰ)",
    "options": [
      'حَيَّةٌ',
      'ثُعبانِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " أكمل من قوله تعالى فَعَقَرُوا ...... وَعَتَوْا عَنْ أَمْرِ رَبِّهِمْ وَقَالُوا يَا صَالِحُ ائْتِنَا بِمَا تَعِدُنَا)",
    "options": [
      'النَّاقَةَ',
      'البَقرةَ',
      'الْإِبِلِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " أكمل من قوله تعالى (أَفَلَا يَنظُرُونَ إِلَى..... كَيْفَ خُلِقَتْ)",
    "options": [
      'الْإِبِلِ',
      'الأنْعَامِ',
      'الخَيْلِ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": " أكمل من قوله تعالى (إِنَّ الَّذِينَ تَدْعُونَ مِنْ دُونِ اللَّهِ لَنْ يَخْلُقُوا ...... وَلَوِ اجْتَمَعُوا)",
    "options": [
      'بَعُوضاً',
      'ذُبَابًا',
      'جَرادً',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": " أكمل من قوله تعالى (فَأَلْقَىٰ عَصَاهُ فَإِذَا هِيَ ..... مُّبِينٌ)",
    "options": [
      'ثُعْبَانٌ',
      'حَيَّةٌ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "أكمل من قوله تعالى (يَا أَيُّهَا ..... ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ)",
    "options": [
      'الذُبابِ',
      'النَحلِ',
      'النَّمْلُ',
    ],
    "answer_index": 2,
  },
  {
    "id": 14,
    "question": " أكمل من قوله تعالى (فَمَثَلُهُ كَمَثَلِ ...... إِن تَحْمِلْ عَلَيْهِ يَلْهَثْ)",
    "options": [
      'الْكَلْبِ',
      'الحِمَارِ',
      'الثَعلبِ',
    ],
    "answer_index": 0,
  },
];



const List infoQuranEight =
[
  {
    "id": 1,
    "question": " اختر السورة التي بدأت بها هذه الآية (الٓمٓ ذَٰلِكَ ٱلۡكِتَٰبُ لَا رَيۡبَۛ فِيهِۛ هُدٗى لِّلۡمُتَّقِينَ)",
    "options": [
      'البقرة',
      'النساء',
      'المائدة',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": " اختر السورة التي بدأت بها هذه الآية (ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَاۜ)",
    "options": [
      'الإسراء',
      'يوسف',
      'الكهف',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "اختر السورة التي بدأت بها هذه الآية (كٓهيعٓصٓ ذِكۡرُ رَحۡمَتِ رَبِّكَ عَبۡدَهُۥ زَكَرِيَّآ)",
    "options": [
      'التوبة',
      'مريم',
      'طه',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " اختر السورة التي بدأت بها هذه الآية (تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ)",
    "options": [
      'المجادلة',
      'الملك',
      'القلم',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "اختر السورة التي بدأت بها هذه الآية (قُلْ أُوحِيَ إِلَيَّ أَنَّهُ اسْتَمَعَ نَفَرٌ مِّنَ الْجِنِّ فَقَالُوا إِنَّا سَمِعْنَا قُرْآنًا عَجَبًا)",
    "options": [
      'الجن',
      'المرسلات',
      '	المطففين',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "اختر السورة التي بدأت بها هذه الآية (عَمَّ يَتَسَاءَلُونَ عَنِ النَّبَإِ الْعَظِيمِ)",
    "options": [
      'المجادلة',
      'الملك',
      'النبأ',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "اختر السورة التي بدأت بها هذه الآية (اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ خَلَقَ الإِنسَانَ مِنْ عَلَقٍ)",
    "options": [
      '	الضحى',
      'العَلق',
      'العَلق',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " اختر السورة التي بدأت بها هذه الآية (إِنَّا أَعْطَيْنَاكَ الْكَوْثَرَ)",
    "options": [
      'القارعة',
      '	الفيل',
      '	الكوثر',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": " اختر السورة التي بدأت بها هذه الآية (قُلْ هُوَ اللَّهُ أَحَدٌ اللَّهُ الصَّمَدُ)",
    "options": [
      'الإخلاص',
      'الفلق',
      'الناس',
    ],
    "answer_index": 0,
  },
];



const List infoQuranNine =
[
  {
    "id": 1,
    "question": "كم عدد أجزاء القرآن....",
    "options": [
      '20 جزء',
      '	25 جزء',
      '	30 جزء',
    ],
    "answer_index":2 ,
  },
  {
    "id": 2,
    "question": "ما هي أطول سورة في القرآن....",
    "options": [
      'البقرة',
      '	يوسف',
      'الكهف',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "ما هي أقصر سورة في القرآن.....",
    "options": [
      'الفاتحة',
      'الكوثر',
      'الضحى',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "كم عدد سور القرآن.....",
    "options": [
      '100 سورة',
      '	114 سورة',
      '	214 سورة',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "كم عدد آيات القرآن الكريم.....",
    "options": [
      '6236 آية',
      '5000 آية',
      '	4000 آية',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "ما هي السورة التي تعدل ربع القرآن....",
    "options": [
      'الكوثر',
      'الكافرون',
      'الفلق',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "ما هي السورة التي تعدل ثلث القرآن....",
    "options": [
      'الإخلاص',
      'العاديات',
      'الفجر',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "ما هو الطائر الذي تكلم كما ذكر في كتاب الله تعالى.....",
    "options": [
      'الغراب',
      'الهدهد',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "ما هي الحشرة التي تكلمت كما ذكر في كتاب الله تعالى.....",
    "options": [
      'النملة',
      'العنكبوت',
      'النحلة',
    ],
    "answer_index": 0,
  },
];












// const List mohamed =
// [
//    {
//     "id": 1,
//     "question": "",
//      "options": [
//        'صح',
//        'خطأ',
//        'خطأ',
//      ],
//     "answer_index":0 ,
//   },
//    {
//       "id": 2,
//       "question": "",
//       "options": [
//         'صح',
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 3,
//       "question": "",
//       "options": [
//         'صح',
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 4,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//         'خطأ',
//       ],
//       "answer_index":0 ,
//     },
//    {
//       "id": 5,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 6,
//       "question": "",
//       "options": [
//         'صح',
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 7,
//       "question": "",
//       "options": [
//         'صح',
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 8,
//       "question": "",
//       "options": [
//         'صح',
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 9,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 10,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//
//   {
//     "id": 11,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 12,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 13,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 14,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 15,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 16,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index":0 ,
//   },
//   {
//     "id": 17,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 18,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 19,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 20,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
// ];