const List prayersOne =
[
{
    "id": 1,
    "question": " ماهي أول صلاة صلاها الرسول صلى الله عليه وسلم.......",
    "options": [
      'صلاة الفجر',
      'صلاة الظهر',
      'صلاة العشاء',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "كم عدد أركان الصلاة.....",
    "options": [
      '7',
      '11',
      '14',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "دعاء الاستفتاح من",
    "options": [
      'أركان الصلاة',
      'واجبات الصلاة',
      'سنن الصلاة',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "متى يقال دعاء الاستفتاح.....",
    "options": [
      'قبل تكبيرة الإحرام',
      'بعد تكبيرة الإحرام قبل التعوذ',
      'بعد تكبيرة الإحرام بعد الفاتحة.',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "متى يقال دعاء الاستفتاح في صلاة العيد......",
    "options": [
      'بعد التكبيرة الأولى',
      'بعد التكبيرة الثانية',
      'بعد التكبيرة الأخيرة',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "كم موضع نرفع فيه أيدينا في الصلاة......",
    "options": [
      'موضعين اثنين',
      'ثلاث مواضع',
      'أربع مواضع',
    ],
    "answer_index":2 ,
  },
  {
    "id": 7,
    "question": "كم عدد واجبات الصلاة......",
    "options": [
      '7',
      '11',
      '14',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "التشهد الأخير من......",
    "options": [
      'أركان الصلاة',
      'واجبات الصلاة',
      'سنن الصلاة',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "حكم نزول دم الحيض على المرأة وهي تصلي.....",
    "options": [
      'تكمل صلاتها وتصح',
      'لا تبطل صلاتها لأن الحيض لا ينقض الوضوء',
      'تبطل صلاتها لانتقاض الوضوء',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "متى يشرع سجود السهو....",
    "options": [
      'عند النقص والزيادة',
      'عند النقص والشك',
      'عند النقص والزيادة والشك',
    ],
    "answer_index": 2,
  },
];





const List prayersTwo =
[
  {
    "id": 1,
    "question": " ما فروض الوضوء......",
    "options": [
      'النية فقط',
      'غسل اليدين إلى المرفقين ومسح الرأس وغسل الرجل إلى الكعبين',
      'النية وغسل الوجه واليدين إلى المرفقين ومسح الرأس وغسل الرجل إلى الكعبين',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "متى يُشرع الاستنجاء قبل الوضوء.....",
    "options": [
      'قبل كل وضوء',
      'إذا وجب مايقتضيه من خروج ما تجب إزالته من أحد السبيلين',
      'مرة واحدة',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "كم عدد ركعات الخمس صلوات إذا كان المصلى قائماً.....",
    "options": [
      '15',
      '17',
      '19',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "تكبيرة الإحرام من......",
    "options": [
      'أركان الصلاة',
      'واجبات الصلاة',
      'سنن الصلاة',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "عند الوضوء والصلاة.....",
    "options": [
      'لا تلزم النية',
      'تلزم النية وتتلفظ من اللسان(أي نقول نويت الوضوء نويت الصلاة)',
      'تلزم النية ولكن في القلب لا تتلفظ',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "كيف يجعل المصلي يديه وهو يصلي.......",
    "options": [
      'يجعل يمينه على شماله يضعهما على صدره',
      'يجعل شماله على يمينه يضعهما على صدره',
      'يجعل شماله على يمينه يضعهما على بطنه',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "كم عدد واجبات الصلاة.....",
    "options": [
      '7',
      '11',
      '14',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "الزيادة على تسبيحة واحدة في الركوع والسجود من.....",
    "options": [
      'أركان الصلاة',
      'واجبات الصلاة',
      'سنن الصلاة',
    ],
    "answer_index":2 ,
  },
  {
    "id": 9,
    "question": "متى يشرع التورك في الصلاة.....",
    "options": [
      'في كل جلوس',
      'في التشهد الأول',
      'في التشهد الأخير',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "على كم عضو يسجد المصلي.....",
    "options": [
      '3',
      '5',
      '7',
    ],
    "answer_index": 2,
  },

  {
    "id": 11,
    "question": "وضع اليد على الخصر في الصلاة من.....",
    "options": [
      'واجبات الصلاة',
      'سنن الصلاة',
      'مكروهات الصلاة',
    ],
    "answer_index": 2,
  },
  {
    "id": 12,
    "question": "كيفية صلاة الجمعة للنساء في البيت.....",
    "options": [
      'تصلي ركعتين جهراً كما يُصلى في المسجد',
      'تصلي ركعتين كما يُصلى في المسجد ولكن سراً',
      'تصلي أربع ركعات وكأنه صلاة الظهر',
    ],
    "answer_index": 2,
  },
  {
    "id": 13,
    "question": "في صلاة العيد، كم عدد التكبيرات في الركعة الأولى.....",
    "options": [
      'سبع تكبيرات بغير تكبيرة الإحرام',
      'سبع تكبيرات مع تكبيرة الإحرام',
      'خمس تكبيرات',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "إذا نسى المصلي واجب من واجبات الصلاة ثم تذكره بعد تركه لمحله......",
    "options": [
      'يأتي به ولا شيء عليه',
      'لا يأتي به وإن كان في الركعة نفسها ويسجد سجدة سهو',
      'يأتي به ويسجد سجدة سهو',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "إذا نسى المصلي ركن من أركان الصلاة ثم تذكره قبل الشروع في ركن آخر.......",
    "options": [
      'يأتي به ولا شيء عليه',
      'لا يأتي به وإن كان في الركعة نفسها ويسجد للسهو',
      'يأتي به ويسجد للسهو',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "الحركة القليلة لغير حاجة، ك الالتفات بالوجه أو العبث باليد في الثوب، أو اللحية......",
    "options": [
      'من أركان الصلاة',
      'من سنن الصلاة',
      'من مكروهات الصلاة',
    ],
    "answer_index": 2,
  },
  {
    "id": 17,
    "question": "الإشارة من المصلى بقصد التنبيه......",
    "options": [
      'تبطل الصلاة',
      'لا مانع بها',
    ],
    "answer_index": 1,
  },
  {
    "id": 18,
    "question": "قراءة الفاتحة في كل ركعة من.....",
    "options": [
      'أركان الصلاة',
      'سنن الصلاة',
      'واجبات الصلاة',
    ],
    "answer_index": 0,
  },
  {
    "id": 19,
    "question": "قراءة شيء من القرآن مع سورة الفاتحة في أول ركعتين من.....",
    "options": [
      'أركان الصلاة',
      'واجبات الصلاة',
      'سنن الصلاة',
    ],
    "answer_index": 2,
  },
  {
    "id": 20,
    "question": "التسميع هو....",
    "options": [
      'سمع الله لمن حمده',
      'ربنا ولك الحمد',
    ],
    "answer_index": 0,
  },
];




const List prayersThree =
[
  {
    "id": 1,
    "question": " الصلاة هي الركن........في الإسلام",
    "options": [
      '	الثاني',
      '	الثالث',
      '	الخامس',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "التشهد الأول والجلوس له من.....",
    "options": [
      '	أركان الصلاة',
      '	واجبات الصلاة',
      '	سنن الصلاة',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "التشهد الأخير والجلوس له من....",
    "options": [
      '	أركان الصلاة',
      '	واجبات الصلاة',
      '	سنن الصلاة',
    ],
    "answer_index":0 ,
  },
  {
    "id": 4,
    "question": "التلثم (تغطية الفم بثوب) أثناء الصلاة.....",
    "options": [
      '	واجب',
      '	جائز',
      '	مكروه',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "التسبيح (مثل قول سبحان ربي العظيم أثناء الركوع) من.....",
    "options": [
      '	أركان الصلاة',
      '	واجبات الصلاة',
      '	سنن الصلاة',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "رفع اليدين عند تكبيرة الإحرام من ......",
    "options": [
      '	أركان الصلاة',
      '	واجبات الصلاة',
      '	سنن الصلاة',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "من ترك سنة من سنن الصلاة....",
    "options": [
      '	تبطل صلاته',
      '	لا تبطل صلاته',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " إذا نسى المصلي ركناً من أركان الصلاة ثم تذكره بعد تركه لمحله فإنه......",
    "options": [
      'يأتي بها وإلا بطلت صلاته',
      'لا يرجع إليها وان كان في الركعة نفسها ويسجد للسهو',
      '	لا شيء عليه',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "إذا نسي المصلي واجباً من واجبات الصلاة بعد تركه لمحله فإنه.....",
    "options": [
      '	يأتي بها وإلا بطلت صلاته',
      '	لا يرجع إليه وإن كان في الركعة نفسها وسجد للسهو',
      '	لا شيء عليه',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": " إذا نسي المصلي ركناً أو واجباً قبل تركه لمحله فإنه......",
    "options": [
      '	يأتي بها وإلا بطلت صلاته',
      '	يأتي بها ولا شيء عليه',
    ],
    "answer_index": 1,
  },
];





const List prayersFour =
[
  {
    "id": 1,
    "question": " ما هي الصلاة التي لا فيها ركوع ولا سجود.....",
    "options": [
      'صلاة الخسوف والكسوف',
      'صلاة الجنازة',
      'صلاة الإستخارة',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "ما هي صلاة الأوابين....",
    "options": [
      '	صلاة الضحى',
      'صلاة الاستسقاء',
      'صلاة الوتر',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "كم عدد السنن الرواتب في الصلاة في اليوم والليلة.....",
    "options": [
      '20 ركعة',
      '16 ركعة',
      '12 ركعة',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "ما هي الصلاة التي في كل ركعة فيها سجودان وركوعان....",
    "options": [
      '	صلاة الخسوف والكسوف',
      '	صلاة الخوف',
      'صلاة الجنازة',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "كم عدد تكبيرات صلاة الجنازة.....",
    "options": [
      '7 تكبيرات',
      '5 تكبيرات',
      '4 تكبيرات',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "حكم صلاة الوتر....",
    "options": [
      'سنة مؤكدة',
      'سنة غير مؤكدة',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "ما هي أعضاء التيمم....",
    "options": [
      '	الوجه والرأس',
      '	الوجه والرجلين',
      '	الوجه والكفين',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "ما الدعاء المشروع بين السجدتين....",
    "options": [
      '	ربي اغفر لي',
      '	ربي توفني مؤمناً',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "كم عدد أعضاء السجود....",
    "options": [
      '	خمسة أعضاء',
      '	ثمانية أعضاء',
      '	سبعة أعضاء',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "كم عدد تكبيرات صلاة العيد.....",
    "options": [
      'سبع تكبيرات بعد الإحرام في الأولى قبل القراءة، وخمس تكبيرات في الثانية قبل القراءة',
      'سبع تكبيرات منهم تكبيرة الإحرام في الأولى قبل القراءة، وخمس تكبيرات في الثانية قبل القراءة',
      'ست تكبيرات في الأولى وخمس تكبيرات في الثانية',
    ],
    "answer_index": 0,
  },
];











// const List mohamed =
// [
//    {
//     "id": 1,
//     "question": "",
//      "options": [
//        'صح',
//        'خطأ',
//      ],
//     "answer_index": ,
//   },
//    {
//       "id": 2,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 3,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 4,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 5,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 6,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 7,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 8,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 9,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 10,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
// ];
