const List purityHOne =
[
  {
    "id": 1,
    "question": "تعريف الفقه في الإصطلاح : العلم بالأحكام الشرعية العملية المكتسبة من أدلتها التفصيلية",
    "options": [
      'صح ',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "مصادر الفقه الأساسية",
    "options": [
      'القرآن الكريم',
      'السنة',
      'الإجماع',
      'القياس',
      '1،2،3',
      '1،2،3،4',
    ],
    "answer_index": 5,
  },
  {
    "id": 3,
    "question": " موضوع کتاب الطهارة في الفقه يشمل الطهارة الحسية و الطهارة المعنوية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "زوال الخبث يشترط فيه النية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "الماء الذي تحصل به الطهارة",
    "options": [
      'الماء الطهور',
      'الماء الطاهر',
      'الماء النجس',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "ماء البحر",
    "options": [
      'طهور',
      'طاهر',
      'مختلف فيه',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "الماء الذي خالطته نجاسه و لم تغير أوصافه و كان أقل من قلتين فهو",
    "options": [
      'طهور',
      'طاهر',
      'نجس',
      'مختلف فيه',
    ],
    "answer_index": 3,
  },
  {
    "id": 8,
    "question": "الماء الذي خالطته نجاسة و غيرت أحد أوصافه فهو",
    "options": [
      'نجس',
      'طاهر',
      'مختلف فيه',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "الماء الطاهر يصح الوضوء و الاغتسال به",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من أنواع الماء الطهور : ماء الأنهار و الآبار و العيون",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];









const List purityHTwo =
[
  {
    "id": 1,
    "question": "حكم الماء الذي تغير بسبب طول المكث في الإناء طهور",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "الماء المستعمل هو",
    "options": [
      'المنفصل عن أعضاء المتوضئ أو المغتسل في طهارة واجبة',
      'المنفصل عن أعضاء المتوضئ و المغتسل في طهارة غير واجبة',
      'الماء المتبقي في الإناء بعد الوضوء أو الغسل',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "الماء المستعمل في الاستحمام المقصود به التنظف فقط هو ماء طهور",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "حكم الماء المستعمل في طهارة واجبة أنه طهور",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "سؤر الحيوان مأكول اللحم",
    "options": [
      'طاهر',
      'نجس',
      'مختلف فيه',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "حكم الإناء الذي شرب منه الكلب",
    "options": [
      'يغسل خمس مرات أولاهن بالتراب',
      'يغسل ست مرات أولاهن  بالتراب',
      'يغسل سبع مرات أولاهن بالتراب',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "حكم استعمال الآنية الثمينة من غير الذهب و الفضة جائز على الأرجح",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من خلال سماعك للدرس ما هو حكم استعمال آنية الذهب و الفضة في الطهارة",
    "options": [
      'يجوز',
      'لا يجوز',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": " حكم استعمال إناء مضبب بضبة من الذهب جائز",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "يجوز استعمال آنية الكفار التي لم تعلم نجاستها بدون غسلها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "من أدلة جواز استعمال آنية الكفار",
    "options": [
      'أن الله أباح لنا طعام أهل الكتاب',
      'أن النبى صلى الله عليه وسلم توضأ من مزادة مشركة',
      'ان النبى قبل دعوة يهودى على الطعام',
      '2 ،1 معا',
      '3 ،2 ،1 معا',
    ],
    "answer_index": 4,
  },
  {
    "id": 12,
    "question": "من خلال سماعك للدرس طهارة جلود الحيوانات غير مأكولة اللحم بالدباغ مسألة متفق عليها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "لحم الحيوان المأكول اللحم لو كان ميتة فهو طاهر يجوز أكله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];









const List purityHThree =
[
  {
    "id": 1,
    "question": "الاستجمار يجزئ عن الاستنجاء حتي مع وجود الماء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " من شروط الاستجمار أن يكون بطاهر مباح منق",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " يجوز استقبال القبلة عند قضاء الحاجة لو بينك و بين القبلة حائل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "ذكر الشيخ في الشرح أن الاستجمار بالزجاج الأملس لا يجزئ لأنه",
    "options": [
      'غير طاهر',
      'غير مباح',
      'غير منقِ',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "رأي بن عمر رسول الله صلي الله عليه و سلم يبول في بيته مستقبل الشام مستدبر الكعبة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " ليستر الإنسان عورته عن الجن يقول قبل دخول الخلاء",
    "options": [
      ' الله أكبر',
      'الحمد لله',
      'غفرانك',
      'بسم الله',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "عند الخروج من الخلاء نقول",
    "options": [
      ' الله أكبر',
      'الحمد لله',
      'غفرانك',
      'بسم الله',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "من سنن دخول الخلاء",
    "options": [
      ' تقديم اليسري عند الدخول',
      'تقديم اليمني عند الخروج',
      'قول ( اللهم إني أعوذ بك من الخبث و الخبائث ) عند الدخول',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": " يحرم البول و الغائط في الطريق و الحدائق العامة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " قضاء الحاجة وسط القبور مثل قصاء الحاجة وسط السوق",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "من السنة التسوك عند",
    "options": [
      ' الانتباه من النوم',
      'الصلاة',
      'دخول المنزل',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 12,
    "question": " ختان الذكور و الإناث هو من الفطرة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "صح عن النبي صلي الله عليه و سلم الأمر بإعفاء اللحية و اعتبارها من الفطرة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": " من سنن الفطرة",
    "options": [
       'تقليم الأظافر',
       'نتف الإبط',
       'قص الشارب',
       'حلق العانة',
       'غسل البراجم',
       'جميع ما سبق',

    ],
    "answer_index": 5,
  },
  {
    "id": 15,
    "question": "لم يقل أحد من العلماء أن ختان المرأة مكروه أو حرام إنما خلافهم هل هو مستحب أم واجب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "ختان الإناث من العادات الجاهلية أو الموروثات الفرعونية و ليس من الدين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 17,
    "question": "من خلال سماعك للشرح ذكر الشيخ أن أنس رضي الله عنه بين أن النبي صلي الله عليه و سلم حدد أقصي مدة لتقليم الأظفار ب",
    "options": [
      '20 يوما',
      '30 يوما',
      '40 يوما',
      '50 يوما',
    ],
    "answer_index": 2,
  },
];









const List purityHFour =
[
  {
    "id": 1,
    "question": "الدليل علي وجوب الوضوء للصلاة",
    "options": [
        'الكتاب',
        'السنة',
        'الاجماع',
        'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 2,
    "question": "من خلال سماعك للدرس الفرق بين الشرط و الركن",
    "options": [
  'غالبا الشرط يكون خارج العمل و الركن يكون داخل العمل',
  'غالبا الشرط يكون داخل العمل و الركن يكون خارج العمل',
  'لا فرق بينهما',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من شروط الوضوء",
    "options": [
  'الإسلام و العقل',
  'النية',
  'إزالة ما يمنع وصول الماء إلي البشرة',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 4,
    "question": "هناك خلاف في حكم المضمضة و الاستنشاق هل هي فرض أم سنة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "عند غسل اليدين إلي المرفقين يجب غسل المرفقين وجوبا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من فروض الوضوء",
    "options": [
  'التسمية',
  'غسل الوجه بالكامل',
  'غسل الكفين ثلاثا في أول الوضوء',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "من أقوي الأدلة علي وجوب الترتيب في الوضوء أن الله ذكر مسح الرأس بين غسل اليد و غسل الرجل و لم يذكر المغسولات متتابعة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "ما معني الموالاة في الوضوء",
    "options": [
  'تقديم اليمني',
  'ترتيب الوضوء',
  'غسل العضو عقب الذي قبله مباشرة',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": " لو ترك التسمية يبطل الوضوء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "أهم دليل في باب الوضوء هو آية (يَا أَيُّهَا الَّذِينَ آمَنُوا إِذَا قُمْتُمْ إِلَى الصَّلَاةِ فَاغْسِلُوا وُجُوهَكُمْ وَأَيْدِيَكُمْ إِلَى الْمَرَافِقِ وَامْسَحُوا بِرُءُوسِكُمْ وَأَرْجُلَكُمْ إِلَى الْكَعْبَيْنِ ۚ) التي في سورة",
    "options": [
  'البقرة'
  'ال عمران'
  'المائدة'
  'النساء'
    ],
    "answer_index": 2,
  },
  {
    "id": 11,
    "question": "استعمال السواك عند الوضوء",
    "options": [
      'من المستحبات',
      'من الفرائض',
      'لا علاقة له بالوضوء فليس بمستحب و لا فرض',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "(كان النبي صلي الله عليه و سلم يحب التيامن في شأنه كله) ..استدل العلماء بذلك علي استحباب تقديم اليمني علي اليسري في الوضوء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "الذكر بعد الفراغ من الوضوء",
    "options": [
      'غفرانك',
      'أشهد أن لا إله إلا الله وحده لا شريك له و أشهد أن محمدا عبده و رسوله',
      'سبحان الله و بحمده سبحان الله العظيم',
    ],
    "answer_index": 1,
  },
];









const List purityHFive =
[
  {
    "id": 1,
    "question": "النوم اليسير ينقض الوضوء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "لراجح وجوب الوضوء لمن أكل لحم الإبل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "يجب الوضوء من أجل",
    "options": [
  'الصلاة',
  'الطواف بالبيت',
  'مس المصحف بلا حائل',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 4,
    "question": " أكمل الحديث (لا يمس القرآن إلا ...)",
    "options": [
      'طاهر'
      'مسلم'
      'متوضئ'
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "أكمل الحديث (الطواف بالبيت .... .. إلا أن الله أباح فيه الكلام)",
    "options": [
  'عبادة',
  'صلاة',
  'سبعة اشواط',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "يستحب الوضوء من أجل",
    "options": [
  'قراءة القرآن',
  'الجنب إذا أراد أن يعاود الجماع',
  'عند النوم',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "كان النبي صلي الله عليه وسلم يتوضأ عند كل صلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "مشروعية المسح علي الخفين أجمع عليها علماء أهل السنة والجماعة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "يشترط المسح علي الخفين أن يكونا ملبوسين علي طهارة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "يصح المسح علي الخفين في الحدث الأكبر والأصغر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },

  {
    "id": 11,
    "question": "المقيم له أن يمسح علي الخفين",
    "options": [
  'يوم وليلة',
  'يومين وليلتين',
  'ثلاثة أيام بلياليهن',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "المسح علي الخفين يكون مرة واحدة ويمسح فقط أعلي الخف",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "إذا انقضت مدة المسح يبطل....",
    "options": [
      'الوضوء',
      'المسح',
    ],
    "answer_index":1 ,
  },
  {
    "id": 14,
    "question": "إذا خلع الخف بطل وضوءه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];









const List purityHSix =
[
  {
    "id": 1,
    "question": "يجوز المسح علي الجبيرة في الحدث الأكبر و الأصغر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "المسح علي الجبيرة له وقت محدد مثل الخفين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من موجبات الغسل",
    "options": [
  'خروج المني من مخرجه بلذة و دفق',
  'انقطاع دم الحيض و النفاس',
  'الموت',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 4,
    "question": "من رأي في منامه أنه احتلم ثم لم يجد في ثوبه مني لما استيقظ فهل عليه غسل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " الحد الأدني المقبول من الغسل",
    "options": [
  'تعميم البدن بالماء',
  'تعميم البدن بالماء مع النية',
  'الغسل ثلاثا',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " يجب علي المرأة أن تنقض شعرها حين تغتسل من",
    "options": [
      'الجنابة',
      'الحيض',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من الأغسال المستحبة",
    "options": [
  'الغسل للجمعة',
  'الاغتسال للجنابة',
  'الاغتسال بعد انقطاع دم الحيض',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " إذا أراد الزوج أن يجامع زوجته مرة أخري يجب عليه أولا أن يغتسل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":1 ,
  },
  {
    "id": 9,
    "question": " يباح بالتيمم ما يباح بالوضوء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "من أسباب التيمم",
    "options": [
  'فقد الماء',
  'الخوف من الضرر من استعماله',
  'جميع ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 11,
    "question": "إذا وجد الماء بطل التيمم",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "التيمم يكون ب ....",
    "options": [
  'ضربة واحدة للأرض'
  'ضربتين'
  'ثلاث ضربات'
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "لو كان يخاف من الضرر من استعمال الماء ثم زال سبب الخوف بطل تيممه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];









const List purityHSeven =
[
  {
    "id": 1,
    "question": "تنقسم النجاسة إلي ",
    "options": [
'نجاسة مغلظة و نجاسة مخففة',
'نجاسة مغلظة و نجاسة متوسطة',
'نجاسة مغلظة و نجاسة مخففة و نجاسة متوسطة',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": " بول الغلام الذي لم يأكل الطعام",
    "options": [
  'يكتفي برشه فقط',
  'لابد من الغسل',
  'لابد من الغسل و العصر',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "بول و روث الحيوان مأكول اللحم طاهر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "نزول المذي يسبب حدث أكبر يستلزم الاغتسال",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "دم الحيض يكفي فيه النضح بالماء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":1 ,
  },
  {
    "id": 6,
    "question": "إذا ولغ الكلب في إناء أحدكم فليغسله .... أولاهن بالتراب",
    "options": [
  'خمسا',
  'سبعا',
  'تسعا',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " بول الجارية ..... و بول الغلام الرضيع ......",
    "options": [
  'يغسل , ينضح',
  'ينضح , يغسل',
  'ينضح , ينضح',
  'يغسل , يغسل',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "أقل مدة للحيض لا حد لها و غالبه ستة أو سبعة أيام",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " الحائض تقضي ...... و لا تقضي ......",
    "options": [
      'الصوم , الصلاة',
      'الصلاة , الصوم',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "يحرم علي الحائض الطواف بالبيت",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

   {
    "id": 11,
    "question": "الطلاق في الحيض علي الراجح يقع",
     "options": [
       'صح',
       'خطأ',
     ],
    "answer_index": 0,
  },
   {
      "id": 12,
      "question": " يحرم بسبب الحيض و النفاس",
      "options": [
   'الوطء في الفرج',
   'مس المصحف',
   'المكث في المسجد',
   'جميع ما سبق',
      ],
      "answer_index":3 ,
    },
   {
      "id": 13,
      "question": " إذا طهرت الحائض قبل غروب الشمس لزمها أن تصلي",
      "options": [
   'الظهر فقط',
   'العصر فقط',
   'الظهر و العصر',
      ],
      "answer_index":2 ,
    },
   {
      "id": 14,
      "question": " المستحاضة لو كانت صاحبة عادةمعروفة لها فإنها تمكث قدر عادتها ثم تغتسل و تصلي",
      "options": [
        'صح',
        'خطأ',
      ],
      "answer_index":0 ,
    },
   {
      "id": 15,
      "question": "بعد اغتسال المستحاضة يجوز لزوجها أن يجامعها",
      "options": [
        'صح',
        'خطأ',
      ],
      "answer_index":0 ,
    },
];






const List purityHEight =
[
  {
    "id": 1,
    "question": "من شروط الأذان الذكورية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "من جحد فرضية الصلاة فليس بكافر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "يمكن الأذان بلغات غير العربية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "لا يصح الأذان من غير المتوضئ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " الصلوات الخمس و الجمعة إلي الجمعة و رمضان إلي رمضان مكفرات لما بينهن ما اجتنبت .....",
    "options": [
  'الصغائر',
  'الكبائر',
  'الصغائر و الكبائر',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "أول ما فرضت الصلاة في رحلة المعراج كانت",
    "options": [
  'أربعين صلاة',
  'خمسين صلاة',
  'ستين صلاة',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من الصلوات التي ليس لها أذان",
    "options": [
  'العيد',
  'الكسوف',
  'الجنازة',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 8,
    "question": "يستحب للمؤذن أن يجعل أصبعيه في أذنيه أثناء الأذان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "الترجيع في الأذان هو أن يخفض صوته في الشهادتين ثم يعيدهما برفع الصوت",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " إذا قال المؤذن حي علي الصلاة يقول المستمع",
    "options": [
  'حي علي الصلاة',
  'سمعنا و اطعنا',
  'لا حول و لا قوة الا بالله',
    ],
    "answer_index": 2,
  },
];














const List purityHNine =
[
  {
    "id": 1,
    "question": "وقت صلاة الظهر يبدأ من زوال الشمس إلى أن يصير ظل كل شئ ......",
    "options": [
'مثله فى الطول',
'مثليه فى الطول',
'ثلاثة أمثاله فى الطول',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " فى الحديث (من ترك صلاة العصر فقد......)",
    "options": [
  'فقد إيمانه',
  'حبط عمله',
  'كفر بالله',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "فى الحديث ( وقت صلاة العشاء إلى نصف الليل الأوسط )",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "تجب الصلاة على الصبى إذا بلغ سبع سنين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " لو صلى المجنون فله أجر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " لو انكشف أثناء الصلاة جزء كبير من العورة لفترة طويلة بطلت الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": " من شروط الصلاة اجتناب النجاسة فى .......",
    "options": [
  'البدن',
  'الثياب',
  'البقعة التى سيصلى عليها',
  'كل ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 8,
    "question": " لو صلى وعليه نجاسة وهو لا يدرى بها حتى انتهت الصلاة فصلاته صحيحة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "لو أخطأ فى النية فى صلاة الفريضة فله أن يصحح النية أثناء الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "لاتجب الصلاة على الحائض والنفساء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];














const List purityHTen =
[
  {
    "id": 1,
    "question": "فى العموم الركن هو الذى يتقدم على العبادة ويستمر معها والشرط هو ما تشتمل عليه العبادة من الأقوال والأفعال",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "عدد أركان الصلاة كما فى شرح الكتاب",
    "options": [
      '13 ركن',
      '14 ركن',
      '15 ركن',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": " لو صلى الفريضة قاعدا بغير عذر فصلاته ......ولو صلى النافلة قاعدا بغير عذر فله.......ولو صلى النافلة قاعدا بعذر فله .........",
    "options": [
      'صحيحة ، نصف أجر الصلاة ، الأجر كامل',
      'باطلة ، نصف أجر الصلاة ، الاجر كامل',
      'باطلة ، ربع أجر الصلاة ، نصف أجر الصلاة',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " لو قال فى أول صلاته ( الله أعظم ) بدلا من ( الله أكبر ) تصح صلاته",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " فى الحديث (لاصلاة لمن لم .....)",
    "options": [
  'يذكر الله تعالى'
  'يقرأ بفاتحة الكتاب'
  'يطمئن راكعا وساجدا'
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " ترك الاطمئنان فى الصلاة مكروه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "أمرنا بالسجود على .......أعضاء",
    "options": [
  'خمسة',
  'ستة',
  'سبعة',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": " الأركان لاتسقط بالسهو وأما الواجبات فتسقط بالسهو",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "من واجبات الصلاة",
    "options": [
  'قول (ربنا ولك الحمد) للمأموم فقط',
  'التشهد الأوسط',
  'الجلوس للتشهد الاوسط',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 10,
    "question": "كان النبى صلى الله عليه وسلم يقول بين السجدتين",
    "options": [
  'سبحان الله وبحمده',
  'اللهم ربنا ولك الحمد',
  'رب اغفرلى رب اغفرلى',
    ],
    "answer_index": 1,
  },
];














const List purityHEleven =
[
  {
    "id": 1,
    "question": " تنقسم سنن الصلاة إلى سنن أقوال وسنن أفعال",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "من سنن الأفعال فى الصلاة",
    "options": [
  'دعاء الاستفتاح والتعوذ',
  'البسملة وقول آمين',
  'وضع اليمين على الشمال والنظر موضع السجود',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "من سنن الأقوال",
    "options": [
  'رفع اليدين مع تكبيرة الإحرام وعند الركوع وعند الرفع منه',
  'دعاء الاستفتاح والتعوذ',
  'الافتراش والتورك',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " التبسم بلا قهقهة يبطل الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " لو تكلم فى الصلاة ناسيا أو جاهلا لاتبطل صلاته",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " الانحراف اليسير عن القبلة لايضر ولا يبطل الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من مكروهات الصلاة",
    "options": [
  'تعمد زيادة ركن فعلى'
  'تكرار الفاتحة'
  'تقديم السجود على الركوع'
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " وصف النبى صلى الله عليه وسلم الالتفات اليسير فى الصلاة أنه (.........الشيطان من صلاة العبد )",
    "options": [
  'نهب ينتهبه'
  'اختلاس يختلسه'
  'سرقة يسرقها'
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من ترك الصلاة جاحدا لوجوبها فهو كافر مرتد بلا خلاف",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "كفر تارك الصلاة تكاسلا كفر مخرج من الملة اختلف فيه العلماء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];














const List purityHTwelve =
[
  {
    "id": 1,
    "question": " فى الحديث ( ما من عبد يصلى لله تعالى ........ إلا بنى الله له بيتا فى الجنة )",
    "options": [
'ثمان ركعات',
'عشر ركعات',
'ثنتى عشرة ركعة',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": " صلاة الوتر على الراجح",
    "options": [
  'واجبة',
  'سنة مؤكدة',
  'سنة غير مؤكدة',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "صلاة الليل آخر الليل أفضل منه فى أوله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من خاف ألا يقوم آخر الليل فصلاة الوتر فى أول الليل أفضل فى حقه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "لو صلى الوتر سبع ركعات متتابعة فإنه يجلس يتشهد فى كل ركعتين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " من خلال سماعك للدرس سنة العصر القبلية..........",
    "options": [
  'واجبة'
  'سنة مؤكدة'
  'سنة غير مؤكدة'
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": " بين المغرب والعشاء هو من الاوقات المنهى عن الصلاة فيها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من الأوقات المنهى عنها من طلوع الشمس حتى ترتفع قدر رمح فى رأى العين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "فى أوقات النهى لايجوز أن يصلى",
    "options": [
  'قضاء سنة الفجر',
  'صلاة الجنازة',
  'تحية المسجد',
  'النافلة المطلقة',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 10,
    "question": "يجوز فى أوقات النهى أن يصلى النوافل التى لها أسباب ولا يجوز النوافل المطلقة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];














const List purityHThirteen =
[
  {
    "id": 1,
    "question": "أسباب سجود السهو ثلاثة الزيادة والنقص والشك",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "إذا نسى وقام للركعة الخامسة",
    "options": [
  'يجب عليه أن يتمها ثم يسجد السهو',
  'يجب عليه أن يتمها ولا شئ عليه',
  'يجب عليه أن يجلس للتشهد الأخير فورا ثم يسجد للسهو',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "إذا نسى ركنا من أركان الصلاة كأن يسجد قبل أن يركع",
    "options": [
  'يجب عليه أن ياتى بالركن ويتم الصلاة ويسجد للسهو',
  'يجب عليه أن ياتى بالركن ويتم الصلاة ولا شئ عليه',
  'لايلزمه أن ياتى بهذا بالركن ويتم الصلاة ويكفيه سجود السهو',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": " لو نسى التشهد الأوسط ( وهو من واجبات الصلاة ) وقام للركعة الثالثة",
    "options": [
  'يكمل صلاته ولا يجلس للتشهد الاوسط ويكفيه سجود السهو',
  'يكمل صلاته ولا يجلس للتشهد الاوسط ولاشئ عليه',
  'يجب أن ينزل ويجلس للتشهد الاوسط ثم يعود للركعة الثالثة ويسجد للسهو',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "لو شك فى عدد الركعات ولم يترجح عنده شئ كأن شك صلى ثلاثا أو أربعا",
    "options": [
  'يبنى صلاته على العدد الأقل ( ثلاثا ) ويسجد للسهو فى نهاية الصلاة',
  'يبنى على العدد الاكثر ( اربعا ) ويسجد للسهو فى نهاية الصلاة',
  'يعيد الصلاة',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " لا يوجد تشهد بعد سجود السهو",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": " إذا نسى شيئا من المستحبات فى الصلاة عليه سجود السهو",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "يشرع سجود التلاوة فى حق القارئ والمستمع",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "مواضع سجود التلاوة فى القرآن سبعة عشر موضع",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "سجود الشكر هو سجود مجرد بلا تسليم",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];














const List purityHFourteen =
[
  {
    "id": 1,
    "question": " أثقل صلاة على المنافقين ......و......",
    "options": [
'العصر و العشاء',
'الفجر والعصر',
'العشاء والفجر',
'المغرب والعشاء',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": " فى اختيار الكتاب ، حكم صلاة الجماعة .......على الرجال الأحرار القادرين",
    "options": [
  'واجبة'
  'فرض كفاية'
  'مستحبة'
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " أقل ما تنعقد به الجماعة ....",
    "options": [
  'اثنان',
  'ثلاثة',
  'أربعة',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من أدرك .....فقد أدرك الركعة",
    "options": [
  'السجود',
  'الركوع',
  'بين السجدتين',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " من ترك الجماعة وصلى وحده بلا عذر فصلاته باطلة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من ترك الجماعة وصلى وحده بلا عذر فهو آثم وصلاته صحيحة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "يكره أن يصلى المسلم وهو يدافع الاخبثين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "يجوز له ترك الجماعة إذا كان يبحث عن مال ويخشى ضياعه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " من أعذار ترك الجماعة",
    "options": [
  'المرض الذى يشق معه الذهاب للجماعة',
  'المطر الشديد والريح الشديدة',
  'خوف فوات الرفقة فى السفر',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 10,
    "question": " إذا شرع المؤذن فى الإقامة لصلاة الفريضة فلا بأس أن يبدأ شخص فى صلاة تحية المسجد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];














const List purityHFifteen =
[
  {
    "id": 1,
    "question": " يؤم الناس .....ثم .......ثم .......",
    "options": [
'أقرؤهم- أعلمهم بالسنة -أقدمهم هجرة',
'أعلمهم بالسنة- أقرؤهم -أقدمهم هجرة',
'أقدمهم هجرة -أقرؤهم -أعلمهم بالسنة',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " إذا أستوا فى القرآن والعلم والهجرة والإسلام يقدم أكبرهم سنا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "لو صلى بالناس الشخص الغير أولى بالامامة فالصلاة باطلة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "يجوز أن تصلى المرأة بالرجال",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "تكره إمامة ....",
    "options": [
  'كثير اللحن فى قراءته',
  'من أم قوما وهم له كارهون',
  'من يخفى بعض الحروف ولا يفصح',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": " لو صلى رجل واحد مع الإمام فإنه",
    "options": [
  'يقف خلفه',
  'يقف عن يمينه محاذيا له',
  'يقف عن يمينه ويتأخر عنه قليلا',
  'يقف عن يساره محاذيا له',
  'يقف عن يساره ويتأخر عنه قليلا',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "لو صلت الزوجة مع زوجها فإنها",
    "options": [
  'تقف خلفه',
  'تقف عن يمينه محاذية له',
  'تقف عن يمينه وتتأخر عنه قليلا',
  'تقف عن يساره محاذيا له',
  'تقف عن يساره وتتأخر عنه قليلا',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " من أحرم قبل إمامه فصلاته مكروهة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "خير صفوف الرجال ......وشرها .....",
    "options": [
      'آخرها _أولها',
      'أولها _آخرها',
      'أولها _أوسطها',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "يستحب للنساء أن يتقدمن فى الصفوف الأولى",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];














const List purityHSixteen =
[
  {
    "id": 1,
    "question": "فى الحديث : صل ..... فإن لم تستطع ف....... فإن لم تستطع فعلى ......",
    "options": [
      'قاعدا ، قائما ، جنب',
      'قائما ، قاعدا ، جنب',
      'قائما ، على جنب ، قاعدا',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "من صلى الفريضة قاعدا وهو قادر على القيام فصلاته باطلة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من صلى النافلة قاعدا وهو قادر على القيام",
    "options": [
  'صلاته باطلة',
  'صلاته مكروهة',
  'له نصف أجر الصلاة',
  'له أجر الصلاة كاملا',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "من صلى النافلة قاعدا وهو عاجز عن القيام",
    "options": [
  'صلاته باطلة',
  'صلاته مكروهة',
  'له نصف أجر الصلاة',
  'له أجر الصلاة كاملا',
    ],
    "answer_index": 3,
  },
  {
    "id": 5,
    "question": " فى صلاة الفريضة من عجز عن السجود فقط فله أن يجلس من أول الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " قصر الصلاة جائز فى حالة الخوف فى السفر فقط",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " فى حال السفر يجوز قصر",
    "options": [
  'جميع الصلوات'
  'الصلاة الرباعية فقط'
  'الظهر والعصر فقط'
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " إتمام الصلاة فى السفر أفضل من القصر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "من نوى إقامة أكثر من .......فإنه ليس له قصر الصلاة ويعتبر كالمقيم",
    "options": [
  'ثلاثة أيام'
  'أربعة أيام'
  'خمسة أيام'
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "إذا صلى المسافر خلف شخص مقيم فإنه يجب عليه أن يصلى الصلاة تامة ولايقصرها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": " لو صلى المغرب مع العشاء فى وقت المغرب يسمى",
    "options": [
  'جمع تأخير'
  'جمع تقديم'
  'قصر الصلاة'
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "لايجوز جمع الصلاة فى الحضر أبدا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "المستحاضة لو شق عليها أن تصلى الصلاة فى وقتها فلها الجمع",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "من الاسباب المبيحة للجمع فى الحضر",
    "options": [
      'المطر الكثير الغزير الذى يلحق المكلف بسببه مشقة',
      'الوحل والطين الذى يمنع المشى',
      'الريح الشديدة التى خرجت عن العادة',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
];














const List purityHSeventeen =
[
  {
    "id": 1,
    "question": "لاتجب صلاة الجمعة على",
    "options": [
'الصبي',
'المسافر',
'المريض',
'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 2,
    "question": " يسن قصر الخطبتين فى الجمعة والثانية أقصر من الأولى",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " من تكلم فى خطبة الجمعة بطلت صلاته",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "من أدرك الإمام فى صلاة الجمعة بعد ركوع الركعة الثانية فعليه ",
    "options": [
  'أن يتمها جمعة ( ركعتين )',
  'أن يتمها ظهرا ( أربع ركعات )',
  'أن يعيد الصلاة',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "مما يسن قراءته فى صلاة الجمعة",
    "options": [
  'سورة الجمعة فى الركعة الأولى والمنافقون فى الركعة الثانية',
  'سورة الأعلى فى الركعة الأولى وسورة الغاشية فى الركعة الثانية',
  'جميع ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "سنة الجمعة البعدية اختلفوا فيها على أقوال ، فأقلها ركعتين وأكثرها ست ركعات",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من أتى الجمعة فى الساعة الأولى فكأنما قرب إلى الله",
    "options": [
  'بدنة',
  'بقرة',
  'كبشا أقرن',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " فى الحديث ( من غسل يوم الجمعة واغتسل وبكر وابتكر كان له بكل خطوة يخطوها أجر ......)",
    "options": [
  'أسبوعا صيامه وقيامه',
  'شهرا صيامه وقيامه',
  'سنة صيامها وقيامها',
  'صيام وقيام الدهر',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "الاغتسال يوم الجمعة شرط لصحة الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "يسن أن يقرأ فى فجر يوم الجمعة ب.....",
    "options": [
  'الجمعة والمنافقون',
  'الأعلى والغاشية',
  'السجدة و الإنسان',
    ],
    "answer_index": 2,
  },

  {
    "id": 11,
    "question": "لو دخل المسجد والإمام يخطب فيكره له أن يصلى تحية المسجد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": " من سنن يوم الجمعة",
    "options": [
  'كثرة الصلاة على النبى صلى الله عليه وسلم',
  'قراءة سورة الكهف',
  'تحرى ساعة الاجابة',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
];














const List purityHEighteen =
[
  {
    "id": 1,
    "question": " صلاة الخوف تختلف عن الصلاة العادية فى عدد الركعات فقط",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " دل على مشروعية صلاة الخوف",
    "options": [

        'الكتاب',
        'السنة',
        'الاجماع',
        'جميع ما سبق',

    ],
    "answer_index": 3,
  },
  {
    "id": 3,
    "question": "لايجوز حمل السلاح فى صلاة الخوف",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "إذا هجم العدو على المسلمين فى الصلاة",
    "options": [
  'يخرجوا من الصلاة',
  'ينفردوا عن الإمام ويتموا صلاتهم رجالا أو ركبانا',
  'يخرجوا من صلاة الجماعة',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "يشرع للمرأة الحائض حضور صلاة العيد ولكن تعتزل المصلى",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " يسن أن تصلى العيد فى المساجد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من السنة ........",
    "options": [
  'تعجيل صلاة عيد الأضحى وتأخير صلاة عيد الفطر',
  'تعجيل صلاة عيد الفطر وتأخير صلاة عيد الأضحى',
  'تعجيل صلاة عيد الفطر والأضحى',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " يسن قضاء صلاة العيد لمن فاتته",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من سنن العيد أن يذهب ويعود لصلاة العيد من نفس الطريق",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "لو ترك التكبيرات الزائدة في صلاة العيد متعمدا تبطل الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];














const List purityHNineteen =
[
  {
    "id": 1,
    "question": " الخطبة فى صلاة الاستسقاء تكون قبل الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " من السنة فى صلاة الاستقساء تحويل الرداء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من السنة أن يخرج إلى صلاة الاستقساء النساء والصبيان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "صلاة الكسوف ركعتان فى كل ركعة يركع",
    "options": [
  'مرة واحدة',
  'مرتان',
 ' 4 مرات',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " إذا انتهى الكسوف يسن قضاء الصلاة لمن لم يصلها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "وقت صلاة الكسوف من ابتداء الكسوف إلى انتهائه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "إذا انتهت صلاة الكسوف ومازال الكسوف قائما فماذا يفعل المسلم",
    "options": [
      'يقوم ويصلى ركعتين مرة ثانية',
      'ينشغل بالدعاء والاستغفار',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "تغسيل الميت فرض عين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "يجوز للرجل أن يغسل زوجته والعكس",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "شهيد المعركة",
    "options": [
  'لايغسل ولا يكفن ولكن يصلى عليه'
  'يغسل ولكن لا يكفن ولا يصلى عليه'
  'لا يغسل ولا يكفن ولا يصلى عليه'
    ],
    "answer_index": 2,
  },
];














const List purityHTwenty =
[
  {
    "id": 1,
    "question": " لو مات الشخص وهو محرم فلا يغطى رأسه عند التكفين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "السنة يكفن الرجل فى .......لفائف بيض والمرأة فى ......أثواب من قطن",
    "options": [
      'أربع - ستة',
      'ثلاثة - خمسة',
      'خمسة - سبعة',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": " الصلاة على الميت",
    "options": [
  'سنة',
  'فرض عين',
  'فرض كفاية',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": " من السنة الصلاة على الميت قبل تغسيله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من فاتته صلاة الجنازة فله أن يصلى على القبر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " السنة فى صلاة الجنازة أن يسلم",
    "options": [
      'تسليمة واحدة',
      'تسليمتان',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "صلاة الجنازة لا يلزم أن نقرأ فيها بفاتحة الكتاب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "لو سقط الولد من بطن أمه بعد خمسة أشهر فإننا نصلى عليه وندعو لوالديه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];














const List purityHTwentyOne =
[
  {
    "id": 1,
    "question": "من شهد الجنازة حتى يصلى عليها فله ...... ومن شهدها حتى تدفن فله ......",
    "options": [
      'جنة - جنتان',
      'قيراط - قيراطان',
      'قيراطان - قراريط',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "من السنة الإسراع فى حمل الجنازة والصلاة عليها ودفنها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "حمل الجنازة وتشيعها مستحب للرجال والنساء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "فى الحديث ( الشق لنا واللحد لغيرنا )",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من المحرمات عند القبر ......",
    "options": [
  'إسراج القبور',
  'بناء المساجد عليها',
  'الجلوس عليها',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "من الأمور المستحبة أن يصنع أقرباء الميت وجيرانه لأهل الميت طعاما",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من السنة الدعاء للميت عند قبره وليس من السنة قراءة القرآن على قبره",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " البكاء والحزن على الميت يتعارض مع الرضا بالقضاء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من المحرمات عند التعزية",
    "options": [
  'لطم الخدود',
  'الندب',
  'شق الجيوب',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 10,
    "question": "فى الحديث ( النائحة إذا لم تتب قبل موتها تقام يوم القيامة وعليها سربال من قطران ودرع من جرب )",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];


const List purityHTwentyTwo =
[
  {
    "id": 1,
    "question": "فى قول الله تعالى : (وكلوا واشربوا حتى يتبين لكم الخيط الأبيض من الخيط الأسود من الفجر) معنى الخيط الأبيض والخيط الأسود : بياض النهار وسواد الليل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " الصيام الواجب هو",
    "options": [
  'صيام رمضان',
  'صيام النذر',
  'صيام المكفرات',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 3,
    "question": "يجب الصيام على الصبى المميز دون البلوغ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "لو صام المريض الذى يشق عليه الصيام فإن صيامه لايقبل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "يحرم على الحائض والنفساء الصيام ولا يصح منها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "يثبت دخول شهر رمضان ب..",
    "options": [
  'رؤية الهلال بنفسه'
  'شهادة غيره على رؤيته'
  'اكتمال شعبان 30 يوما'
  'جميع ما سبق'
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "لاتكفى شهادة مسلم عدل واحد فى رؤية هلال رمضان بل لابد من شهادة إثنين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من لم يبيت نية الصيام من الليل فلا يصح صيام ذلك اليوم فى رمضان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " يصح أن ينوى الصيام فى النهار لو صيام تطوع بشرط ألا يكون قد أكل شيئا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "من حكم الصيام العظيمة",
    "options": [
  'تزكية النفس',
  'تعلم الزهد فى الدنيا',
  'الشعور بآلام المساكين',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
];








const List purityHTwentyThree =
[
  {
    "id": 1,
    "question": "المريض الذى لايرجى شفاؤه",
    "options": [
'يلزمه القضاء ولو بعد حين',
'يلزمه الفدية عن كل يوم إطعام مسكين',
'يلزمه القضاء مع الفدية',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "إن صام المريض المعذور فى الإفطار يصح صيامه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "جوز الإفطار فى السفر وإن لم يكن سفرا فيه مشقة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "لو صامت الحائض صح صيامها مع الكراهة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من جامع فى نهار رمضان فعليه",
    "options": [
  'قضاء ذلك اليوم'
  'عليه الكفارة'
  'التوبة والاستغفار'
  'جميع ما سبق'
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "ذا احتلم الصائم فى نهار رمضان",
    "options": [
  'بطل صيامه وعليه القضاء',
  'بطل صيامه وعليه الكفارة',
  'بطل صيامه وعليه القضاء والكفارة',
  'يصح صيامه وليس عليه شيء',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "من تقيئ رغما عنه فصيامه صحيح",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "شخص عزم على الإفطار فى نهار رمضان ثم ذهب ليفطر فلم يجد ما يأكله ......ماحكمه ؟",
    "options": [
  'يكمل صيامه ولا شيئ عليه',
  'بطل صيامه ويلزمه القضاء والتوبة',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "لو طهرت المرأة من الحيض قبل أذان الفجر ولكن لا يوجد وقت لتغتسل قبل أذان الفجر",
    "options": [
  'يلزمها أن تنوى الصيام ويصح منها',
  'لا يلزمها الصيام',
  'يجب أن تتيمم قبل أن تنوى الصيام',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " من أكل أو شرب ناسيا فصيامه صحيح",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];









const List purityHTwentyFour =
[
  {
    "id": 1,
    "question": "تسحروا فإن فى السحور ........",
    "options": [
      'خير',
      'بركة',
      'رحمة',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "يستحب الإفطار على  ............... ",
    "options": [
  ' رطبات فإن لم يجد فتمرات فإن لم يجد فجرعات من ماء',
   'تمرات فإن لم يجد فرطبات فإن لم يجد فجرعات من ماء',
   'جرعات من ماء فإن لم يجد فرطبات فإن لم يجد فتمرات',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من مستحبات الصيام  ............... .",
    "options": [
   'تأخير الفطر',
   'تبكير السحور',
   'الدعاء عند الفطر',
   'جميع ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "كان النبى صلى الله عليه وسلم إذا دخل العشر شد مئزره وأحيا ليله وأيقظ أهله  ............... ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": " لابأس أن يقبل الصائم زوجته إن كان يأمن على نفسه ............... ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "يستحب المبالغة فى المضمضة والاستنشاق أثناء الصيام  ...............",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " يجب قضاء ما عليك من رمضان متتابعا ولا يصح متفرقا  ............... ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "صيام يوم عرفة يكفر  ............... وصيام يوم عاشوراء يكفر ............... ",
    "options": [
      'سنة ، سنتين',
      'سنتين ، سنة',
      ' الكبائر ، الصغائر',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": " أفضل الصيام  ............... ",
    "options": [
      'الإثنين والخميس',
      ' ثلاثة أيام من كل شهر',
      'صوم يوم وإفطار يوم',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "لا يستحب صيام يوم عرفة للحاج  ............... ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];









const List purityHTwentyFive =
[
  {
    "id": 1,
    "question": "يكره إفراد يوم الجمعة بصيام لكن لو صامه مع غيره فلا بأس.",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " لو وافق يوم العيد يوم اثنين أو خميس فلا يحرم صومه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "فى الحديث ذكر النبى صلى الله عليه وسلم ( أن أيام التشريق أيام ................)",
    "options": [
  ' أكل وشرب',
  ' أكل وشرب وذكر لله تعالى',
  ' أكل وشرب ولعب',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " حكم الاعتكاف فى العشر الأواخر من رمضان ..................",
    "options": [
  ' واجب',
  ' مستحب',
  ' مباح',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " يجوز الاعتكاف فى غير المساجد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " الاعتكاف لا يشرع إلا فى العشر الأواخر من رمضان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "الخروج لما لابد منه من قضاء الحاجة والأكل و الشرب لا يقطع الاعتكاف.",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " يستحب للمعتكف .................. ",
    "options": [
  ' الإكثار من ذكر الله والصلاة',
  ' ترك التحدث مع الناس إلا فيما يفيد',
  ' أن يخلوا بخالقه سبحانه وتعالى',
  ' جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": " لو أكل أو شرب فى الاعتكاف بطل اعتكافه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من مبطلات الاعتكاف الجماع والاستمناء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];





const List purityHTotal =
[

  {
    "id": 1,
    "question": "الصلوات الخمس والجمعة إلى الجمعة ورمضان إلى رمضان مكفرات لما بينهن ما اجتنبت ......",
    "options": [
'الصغائر',
'الكبائر',
'الشركيات',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "يؤمر الأولاد بالصلاة عند تمام.....سنين ويضربون على تركها عند تمام ......سنين",
    "options": [
 'خمس  ،  سبع',
 'سبع  ، عشر',
 'ست  ، تسع',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "الطهارة ليست شرطا لصحة الأذان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "الصلاة خير من النوم تقال فى",
    "options": [
  'آذان الفجر بعد الشهادتين',
  'أذان الفجر بعد انتهائه',
  'اذان الفجر بعد حى على الفلاح',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "وقت صلاة المغرب من غروب الشمس إلى......",
    "options": [
  'مغيب الشفق الأحمر',
  'مغيب الشفق الأبيض',
  'ثلث الليل',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "لصبى دون البلوغ لو صلى فله أجر ولو ترك الصلاة عامدا فعليه وزر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "لو وجد فى ثوبه نجاسة بعد الصلاة ولم يعلم بها فصلاته صحيحة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " فى الحديث ( لايقبل الله صلاة.....إلا بخمار )",
    "options": [
  'حائض',
  'بالغ',
  'امرأة',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " أركان الصلاة لاتسقط عمدا ولا سهوا ولا جهلا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " من أركان الصلاة....",
    "options": [
  'الركوع والسحود والطمأنينة',
  'التسبيح فى الركوع والسجود',
  'التشهد الأول',
  'جميع ما سبق',
    ],
    "answer_index": 0,
  },


  {
    "id": 11,
    "question": " من واجبات الصلاة .....",
    "options": [
  'قول (ربنا ولك الحمد) للمأموم فقط'
  'التشهد الأوسط'
  'الجلوس للتشهد الأوسط'
  'جميع ما سبق'
    ],
    "answer_index": 3,
  },
  {
    "id": 12,
    "question": "لو نسى واجبا من واجبات الصلاة فلا يلزمه الإتيان به ، ويجبره بسجود السهو",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "دعاء الاستفتاح من سنن الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "لو تكلم فى الصلاة متعمدا تبطل صلاته",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "من مكروهات الصلاة",
    "options": [
  'تعمد زيادة ركن فعلى',
  'تكرار الفاتحة',
  'تقديم السجود على الركوع',
    ],
    "answer_index": 1,
  },
  {
    "id": 16,
    "question": "كفر تارك الصلاة تكاسلا كفر تخرج من الملة اختلف فيه العلماء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 17,
    "question": " تسن صلاة الجماعة فى .....",
    "options": [
  'صلاة التراويح',
  'صلاة الإستسقاء',
  'صلاة الكسوف',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 18,
    "question": "صلاة الوتر سنة مؤكدة على الراجح",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 19,
    "question": " لو زاد ركوعا فى إحدى الركعات نسيانا",
    "options": [
  'تبطل صلاته',
  'تبطل الركعة',
  'يكمل صلاته ويسجد للسهو ولا تبطل الصلاة ولا الركعة',
    ],
    "answer_index": 2,
  },
  {
    "id": 20,
    "question": "لو تشهد وسلم فى صلاة رباعية بعد الركعة الثالثة",
    "options": [
  'تبطل صلاته ويلزمه الاعادة',
  'يقوم ويأت بالركعة الرابعة ويتم الصلاة ويسجد للسهو',
  'يكفيه أن يسجد للسهو فقط ولا يأت بالركعة الرابعة',
    ],
    "answer_index": 1,
  },


  {
    "id": 21,
    "question": "يشرع سجود التلاوة  فى حق القارئ والمستمع",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 22,
    "question": " يستحب سجود الشكر لمن بشر بما يسره",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 23,
    "question": "يعذر بترك الجماعة",
    "options": [
 ' لو حصل له أذى شديد بسبب ثلج أو ريح شديده',
 ' إذا حضر الطعام وهو محتاج إليه',
 ' أن يخاف من فوات الرفقة فى السفر',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 24,
    "question": " من أدرك .......فقد أدرك الركعة",
    "options": [
  'الركوع',
  'السجود',
  'الفاتحة',
    ],
    "answer_index": 0,
  },
  {
    "id": 25,
    "question": "فى الحديث ( لا صلاة ........خلف الصف)",
    "options": [
  'لامرأة',
  'لجماعة',
  'لمنفرد',
  'للصبيان',
    ],
    "answer_index": 2,
  },
  {
    "id": 26,
    "question": "تصح إمامة المرأة بالرجل إذا كانت أقرأ منه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 27,
    "question": " لو صلى مع الإمام رجل واحد فقط فإنه",
    "options": [
  'يقف خلفه',
  'يقف عن يمينه محاذيا له',
  'يقف عن يساره محاذيا له',
  'يقف عن يمينه ويتأخر عنه قليلا',
    ],
    "answer_index": 1,
  },
  {
    "id": 28,
    "question": " لو نسى الإمام التشهد الأوسط وقام للثالثة",
    "options": [
  'يتابعه المأموم ويسجد معه للسهو',
  'يسبح له المأموم حتى يعود للتشهد الأوسط',
  'ينفرد عنه المأموم ويكمل الصلاة وحده',
    ],
    "answer_index": 0,
  },
  {
    "id": 29,
    "question": "من عجز عن الركوع فقط فى الصلاة فله أن يصلى جالسا من اول الصلاة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 30,
    "question": " السفر المحرم لا يستباح فيه الرخص كالقصر والجمع",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },


  {
    "id": 31,
    "question": "إذا أئتم المسافر بمقيم فإنه....",
    "options": [
  'يلزمه الإتمام وليس له القصر',
  'له أن يقصر الصلاة',
  'كلاهما صحيح فله الاتمام أو القصر',
    ],
    "answer_index": 0,
  },
  {
    "id": 32,
    "question": "المسافر يجب عليه صلاة الجمعة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 33,
    "question": "مما يحرم فعله فى صلاة الجمعة",
    "options": [
  'الكلام والإمام يخطب',
  'تخطى رقاب الناس أثناء الخطبة',
 ' جميع ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 34,
    "question": "يسن لمن دخل المسجد يوم الجمعة أن يصلى ركعتين حتى لو الإمام يخطب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 35,
    "question": " تختلف صلاة الخوف فى الحرب عن الصلاة العادية فى",
    "options": [
  'عدد الركعات',
  'صفة الصلاة نفسها',
  'حمل السلاح فيها',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 36,
    "question": "تشرع صلاة الخوف عند",
    "options": [
  'الخوف من هجوم العدو',
  'الهروب من العدو لو كان الهرب مباحا',
  'الهرب مما يخاف منه مثل الصائل أو السبع',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 37,
    "question": "يسن قضاء صلاة العيد لمن فاتته...",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 38,
    "question": "من السنة .....",
    "options": [
  'تعجيل صلاة عيد الفطر وتأخير صلاة عيد الأضحى',
  'تعجيل صلاة عيد الفطر والأضحى',
  'تعجيل صلاة عيد الأضحى وتأخير صلاة عيد الفطر',
    ],
    "answer_index": 2,
  },
  {
    "id": 39,
    "question": "يستحب للإمام قبل صلاة الاستسقاء أن يأمر الناس بالتوبة والخروج من المظالم",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 40,
    "question": "لايجوز خروج النساء لصلاة الاستسقاء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },


  {
    "id": 41,
    "question": " إذا انتهت صلاة الكسوف ومازال الكسوف قائما فماذا يفعل المسلم ؟",
    "options": [
  'يقوم ويصلى ركعتين مرة تانية',
  'ينشغل بالدعاء والاستغفار',
    ],
    "answer_index": 1,
  },
  {
    "id": 42,
    "question": "صلاة الكسوف ركعتان فى كل ركعة يركع",
    "options": [
  'مرة واحدة',
  'مرتان',
  '4 مرات',
    ],
    "answer_index": 1,
  },
  {
    "id": 43,
    "question": " لو مات شخص بالغرق أو الطاعون فإنه.......",
    "options": [
  'يغسل ويكفن ويصلى عليه',
  'يغسل ولكن لا يكفن ولا يصلى عليه',
  'لا يغسل ولا يكفن ولا يصلى عليه',
    ],
    "answer_index": 0,
  },
  {
    "id": 44,
    "question": "بعد التكبيرة الثانية فى صلاة الجنازة",
    "options": [
  'نقرأ الفاتحة',
  'نصلى على النبى كما فى التشهد',
  'ندعو للميت',
    ],
    "answer_index": 1,
  },
  {
    "id": 45,
    "question": "يسن صلاة الغائب عن من لم يصلى عليه من المسلمين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 46,
    "question": "لو مات رجل وهو محرم فلا تغطى رأسه عند التكفين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 47,
    "question": "يوضع الميت فى لحده على شقه الأيسر مستقبل القبلة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 48,
    "question": " من المحرمات عند القبر ......",
    "options": [
  'إسراج القبور',
  'بناء المساجد عليها',
  'الجلوس عليها',
  'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 49,
    "question": " من المحرمات عند التعزية",
    "options": [
  'الحزن',
  'البكاء',
  'النياحة',
    ],
    "answer_index": 2,
  },
  {
    "id": 50,
    "question": " ليس منا من لطم الخدود وشق الجيوب ودعا بدعوى الجاهلية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

];









// const List mohamed =
// [
//    {
//     "id": 1,
//     "question": "",
//      "options": [
//        'صح',
//        'خطأ',
//      ],
//     "answer_index": 0,
//   },
//    {
//       "id": 2,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 3,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 4,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 5,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 6,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 7,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 8,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 9,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
//    {
//       "id": 10,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": 0,
//     },
// ];
