const List mohamedOne =
[
  {
    "id": 1,
    "question": "من هو النبي الذي رأه الرسول (صلى الله عليه وسلم) في السماء الخامسة ......",
    "options": [
      'هارون',
      'موسى',
      'يوسف',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "في ليلة الإسراء ما الوسيلة التى كانت تنقل الرسول(صلى الله عليه وسلم) بين السماوات.....",
    "options": [
      'الزرابي',
      'البراق',
      'القصواء',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "اسم السيف الذي كان لا يفارق النبي (صلى الله عليه وسلم).....",
    "options": [
      'البراق',
      'الزرابي',
      'ذو الفقار',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "ما كانت سنة الرسول (صلى الله عليه وسلم) في النوم.....",
    "options": [
      'النوم على الظهر',
      'النوم على الشق الأيمن',
      'النوم على الشق الأيسر',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "فيمن نزلت سورة الحشر......",
    "options": [
      'بني النضير',
      'بني قريظة',
      'بني المصطلق',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "نبي قال عنه الرسول (صلى الله عليه وسلم) هو الكريم بن الكريم بن الكريم بن الكريم......",
    "options": [
      'يوسف',
      'موسى',
      'زكريا',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من المرأة التي نزل بشأنها أوائل سورة المجادلة .......",
    "options": [
      'أم سلمة',
      'خولة بنت ثعلبة',
      'أسماء بنت يزيد',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "كم عدد أبناء الرسول (صلى الله عليه وسلم).....",
    "options": [
      'خمسة',
      'سبعة',
      'تسعة',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من كان دليل الرسول (صلى الله عليه وسلم) في هجرته.....",
    "options": [
      'الزبير بن العوام',
      'عروة بن الزبير',
      'عبدالله بن أريقط',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "من الصحابي الملقب بسيد القراء......",
    "options": [
      'أبي بن كعب',
      'عبدالرحمن بن عوف',
      'سعد بن أبي وقاص',
    ],
    "answer_index": 0,
  },
   {
    "id": 11,
    "question": "من الصحابي الذي كانت تستحي منه الملائكة......",
     "options": [
       'على بن أبي طالب',
       'عثمان بن عفان',
       'عمر بن الخطاب',
     ],
    "answer_index": 1,
  },
   {
      "id": 12,
      "question": "من الصحابي الذي قال له النبي صلى الله عليه وسلم ( قم يا أبا تراب)......",
      "options": [
        'على بن أبي طالب',
        'أبوبكر الصديق',
        'عثمان بن عفان',
      ],
      "answer_index": 0,
    },
   {
      "id": 13,
      "question": "من الذي حفر ـ لوحده ـ قبر النبي صلى الله عليه وسلم؟.....",
      "options": [
        'أبو بكر الصديق',
        'عمر بن الخطاب',
        'أبو طلحة زيد بن سهل الأنصاري',
      ],
      "answer_index": 2,
    },
   {
      "id": 14,
      "question": "آخر الصحابة موتاً وقد توفي بالبصرة....",
      "options": [
        'مالك بن أنس',
        'أنس بن مالك',
        'زيد بن ثابت',
      ],
      "answer_index": 1,
    },
   {
      "id": 15,
      "question": "من الصحابي الذي ذُكر في القرآن.....",
      "options": [
        'زيد بن حارثة',
        'زيد بن ثابت',
        'على بن أبي طالب',
      ],
      "answer_index": 0,
    },
   {
      "id": 16,
      "question": "من الصحابي الذي قال عنه النبي (صلى الله عليه وسلم ) لقد اهتز لموته العرش ، ولقد تبادر إلى غسله سبعون ألف ملك......",
      "options": [
        'الحارثة بن النعمان',
        'سعد بن معاذ',
        'جعفر بن أبي طالب',
      ],
      "answer_index": 1,
    },
   {
      "id": 17,
      "question": "من هو أبو حفص العدوي القرشي.....",
      "options": [
        'جعفر بن أبي طالب',
        'عمر بن الخطاب',
        'عثمان بن عفان',
      ],
      "answer_index": 1,
    },
   {
      "id": 18,
      "question": "الصحابي الملقب بأبي المساكين.....",
      "options": [
        'جعفر بن أبي طالب',
        'حنظلة بن أبي عامر',
        'حارثة بن النعمان',
      ],
      "answer_index": 0,
    },
   {
      "id": 19,
      "question": "من الصحابي الذي كان يأتي جبريل عليه السلام في صورته للنبي صلى الله عليه وسلم ......",
      "options": [
        'دحية بن خليفة الكلبي',
        'حارثة بن سراقة',
        'حبيب بن مسلمة',
      ],
      "answer_index": 0,
    },
   {
      "id": 20,
      "question": "من هو خطيب النبي صلى الله عليه وسلم...",
      "options": [
        'ثابت بن قيس بن شماس',
        'جرير بن عبدالله البجلي',
        'حذيفة بن اليمان',
      ],
      "answer_index": 0,
    },

];





const List mohamedOneOne =
[
  {
    "id": 1,
    "question": "ما هو اسم نبينا محمد صلى الله عليه وسلم.....",
    "options": [
      'محمد بن عبدالله بن عبد المطلب',
      'محمد بن عبدالله بن هاشم',
      'محمد بن عبدالله بن أبي طالب',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " كم كان عمر الرسول صلى الله عليه وسلم عندما بُعث بالرسالة.....",
    "options": [
      '60 عاماً',
      '	50 عاماً',
      '	40 عاماً',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "ما هي كنية الرسول صلى الله عليه وسلم.....",
    "options": [
      '	أبو طالب',
      'أبو القاسم',
      'أبو عبدالمطلب',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "يُنسب الرسول صلى الله عليه وسلم.....",
    "options": [
      '	بني أمية',
      'بني بكر',
      '	بني هاشم',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "متى ولد النبي صلى الله عليه وسلم.....",
    "options": [
      'عام الفيل =450م',
      'عام الفيل = 571م',
      'عام الفيل = 760م',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " ما هو اللقب التي أطلقته أهل مكة على النبي صلى الله عليه وسلم.....",
    "options": [
      'الكريم',
      '	سيد القوم',
      '	الصادق الأمين',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "ما هي الحرفة التي عمل بها جميع الأنبياء....",
    "options": [
      'رعي الأغنام',
      'الصيد',
      'الزراعة',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من أول زوجة تزوجها النبي صلى الله عليه وسلم.....",
    "options": [
      'السيدة ميمونة بنت الحارث رضي الله عنها',
      '	السيدة خديجة رضي الله عنها',
      '	السيدة عائشة رضي الله عنها',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من هي البكر الوحيدة التي تزوجها النبي صلى الله عليه وسلم......",
    "options": [
      '	السيدة عائشة رضي الله عنها',
      'أم سلمة رضي الله عنها',
      'السيدة خديجة رضي الله عنها',
    ],
    "answer_index": 0,
  },

];





const List mohamedOneTwo =
[
  {
    "id": 1,
    "question": " إلى من بُعث رسول الله صلى الله عليه وسلم.....",
    "options": [
      '	إلى العرب فقط',
      '	إلى الإنس فقط',
      'إلى الإنس والجن',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": " من هي البكر الوحيدة التي تزوجها الرسول صلى الله عليه وسلم....",
    "options": [
      'السيدة خديجة رضي الله عنها',
      'السيدة عائشة رضي الله عنها',
      'أم سلمة رضي الله عنها',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": " ما هي آخر وصايا الرسول صلى الله عليه وسلم.....",
    "options": [
      'الصلاة الصلاة وما ملكت أيمانكم',
      'الحج',
      'الصوم',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": " ما هي الدار الذي كان يجتمع بها النبي بأصحابه في بداية الدعوة....",
    "options": [
      'دار علي',
      'دار الأرقم بن أبي الأرقم',
      '	دار الندوة',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "ما هي الغزوة التي أُشيع فيها مقتل النبي صلى الله عليه وسلم.....",
    "options": [
      '	غزوة أحد',
      '	غزوة الخندق',
      '	غزوة بدر',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "كم رمضان صامه النبي صلى الله عليه وسلم.....",
    "options": [
      '	5 مرات',
      '	7 مرات',
      '	9 مرات',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "ما اسم الغار الذي نزل به الوحي على الرسول عندما نزلت أول آية في القرآن (اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ )",
    "options": [
      '	غار ثور',
      'غار حراء',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من هي أفقه أمهات المؤمنين....",
    "options": [
      '	السيدة صفية رضي الله عنها',
      '	السيدة عائشة رضي الله عنها',
      '	السيدة سودة بنت زمعة رضي الله عنها',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من هي أكبر بنات النبي صلى الله عليه وسلم",
    "options": [
      '	رقية رضي الله عنها',
      'فاطمة رضي الله عنها',
      'زينب رضي الله عنها',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "من هي أم ولده إبراهيم...",
    "options": [
      '	السيدة مارية القبطية',
      '	عائشة بنت أبي بكر',
    ],
    "answer_index": 0,
  },
    {
    "id": 11,
    "question": "كم عدد أبناء الرسول صلى الله عليه وسلم.....",
    "options": [
      'سبعة (أربعة من البنات وثلاثة من البنين)',
      '	خمسة (أربعة من البنات وصبي فقط)',
      '	أربعة بنات فقط',
    ],
    "answer_index": 0,
  },


];














const List mohamedTwo =
[
  {
    "id": 1,
    "question": "ما هو اسم  الرسول ﷺ  .....",
    "options": [
      'محمد بن عبدالله بن عبدالمطلب بن هاشم بن عبد مناف',
      'محمد بن عبدالله بن عبدالمطلب بن عبد مناف بن هاشم',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "متى ولد الرسول  ﷺ....",
    "options": [
      '571 ميلادية',
      '573 ميلادية',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "إن النبي ﷺ  كان من نسل.....",
    "options": [
      'إسحاق عليه السلام',
      'إسماعيل عليه السلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "كم  مُرضعة أرضعت الرسول ﷺ   غير أمه.....",
    "options": [
      'اثنتان',
      'ثلاثة',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من الذي تكفل برعاية الرسول ﷺ   بعد موت جده.....",
    "options": [
      'عمه أبو طالب',
      'عمه أبو لهب',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "بعث الرسول ﷺ   إلى ......",
    "options": [
      'العرب فقط',
      'العالم أجمعين',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "لُقب النبي ﷺ   قبل النبوة ب......",
    "options": [
      'الصادق الأمين',
      'الكريم المغوار',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "تزوج النبي ﷺ  السيدة خديجة وهو في عمر.....",
    "options": [
      'خمسة وعشرون عاماً',
      'أربعون عاماً',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "كم عدد أولاد الرسول ﷺ   من السيدة خديجة......",
    "options": [
      'ستة',
      'سبعة',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "كم عدد زوجات الرسولﷺ  ......",
    "options": [
      'تسعة',
      'إحدى عشر',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "بدأ نزول الوحي على النبي ﷺ  وهو في عمر....",
    "options": [
      'أربعون عاماً',
      'خمسون عاماً',
    ],
    "answer_index":0 ,
  },
  {
    "id": 12,
    "question": "كم عدد أولاد الرسول ﷺ من الذكور....",
    "options": [
      'اثنان',
      'ثلاثة',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "أكبر بنات الرسول ﷺ  ......",
    "options": [
      'زينب',
      'فاطمة',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "كان النبي يحب أن يخلوا للعبادة في .......",
    "options": [
      'غار حراء',
      'جبل عرفات',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "استمرت الدعوة السرية.....",
    "options": [
      'ثلاثة أعوام',
      'ثلاثة عشر عاماً',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": "كم عام قضاه الرسول ﷺ  في مكة بعد البعثة......",
    "options": [
      'عشرة أعوام',
      'ثلاثة عشر عاماً',
    ],
    "answer_index":1 ,
  },
  {
    "id": 17,
    "question": "كم عام قضاه الرسول ﷺ   في المدينة بعد بعثه......",
    "options": [
      'عشرة أعوام',
      'ثلاثة عشر عاماً',
    ],
    "answer_index": 0,
  },
  {
    "id": 18,
    "question": "أول ما أُنزل على الرسول  ﷺ   من القرآن......",
    "options": [
      '(قُلْ هُوَ اللَّهُ أَحَدٌ)',
      '(اقْرَأْ بِاسْمِ رَبِّكَ الَّذِي خَلَقَ)',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "توفي الرسولﷺ   عام.....",
    "options": [
      'التاسعة من الهجرة',
      'الحادية عشر من الهجرة',
    ],
    "answer_index": 1,
  },
  {
    "id": 20,
    "question": "آخر من توفت من زوجات الرسولﷺ  ......",
    "options": [
      'أم سلمة',
      'أم حبيبة',
    ],
    "answer_index": 0,
  },
];



const List mohamedTwoZero =
[
  {
    "id": 1,
    "question": "من هي أول زوجات النبي صلى الله عليه وسلم......",
    "options": [
      'عائشة رضي الله عنها',
      'خديجة رضي الله عنها',
      'زينب بنت جحش',
    ],
    "answer_index":1 ,
  },
  {
    "id": 2,
    "question": "كانت السيدة عائشة رضى الله عنها....",
    "options": [
      'بكر',
      'ثيبة',
      'أرملة',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "أنجبت السيدة خديجة....",
    "options": [
      'البنات فقط',
      'البنين فقط',
      'البنات والبنين',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "المرأة التي يتزوجها الرسول صلى الله عليه وسلم يطلق عليها.....",
    "options": [
      'سيدة المؤمنين',
      'أم المؤمنين',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "من التي زوجها الله للنبي من فوق سبع سماوات....",
    "options": [
      'حفصة بنت عمر رضي الله عنهما',
      'ميمونة بنت الحارث',
      'زينب بنت جحش',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "من آخر زوجة تزوجها النبي صلى الله عليه وسلم......",
    "options": [
      'سودة بنت زمعة',
      'عائشة بنت أبي بكر',
      'ميمونة بنت الحارث',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "من هي أم ولده إبراهيم....",
    "options": [
      'صفية بنت حيي',
      'مارية القبطية',
      'حفصة بنت عمر رضي الله عنهما',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من من زوجات النبي برأها الله من فوق سبع سماوات.....",
    "options": [
      'عائشة بنت أبي بكر',
      'خديجة بنت خويلد',
      'أم سلمة',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "من التي طلقها النبي ثم ردها بعد طلاقها لأنها كانت صوامة قوامة.....",
    "options": [
      'خديجة بنت خويلد',
      'زينب بنت خزيمة',
      'حفصة بنت عمر',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "من هي زوجته التي كانت يهودية فاسلمت وتزوجها.....",
    "options": [
      'صفية بنت حيي',
      'مارية القبطية',
      'زينب بنت خزيمة',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "من المرأتان التي قال فيهم الله (إِن تَتُوبَا إِلَى اللَّهِ فَقَدْ صَغَتْ قُلُوبُكُمَا)",
    "options": [
      'خديجة وعائشة',
      'عائشة وحفصة',
      'حفصة وزينب بنت جحش',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "الحكمة التشريعية من زواج الرسول صلى الله عليه وسلم من السيدة زينب بنت جحش......",
    "options": [
      'إحلال الزواج من الثيب',
      'تعدد الزواجات',
      'إبطال عادة التبني',
    ],
    "answer_index": 2,
  },
  {
    "id": 13,
    "question": "من من أزواج النبي رأها النبي في قطعة حرير قبل أن يتزوجها......",
    "options": [
      'جويرية بنت الحارث',
      'رملة بنت أبي سفيان',
      'عائشة رضي الله عنها',
    ],
    "answer_index": 2,
  },
  {
    "id": 14,
    "question": "من هي أول زوجة ماتت بعد النبي صلى الله عليه وسلم ......",
    "options": [
      'زينب بنت جحش',
      'عائشة بنت أبي بكر',
      'خديجة بنت خويلد',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "لقيت بحارسة القرآن.....",
    "options": [
      'خديجة رضي الله عنها',
      'حفصة بنت عمر',
      'رملة بنت أبي سفيان',
    ],
    "answer_index": 1,
  },
  {
    "id": 16,
    "question": "من التي تزوجها النبي صلى الله عليه وسلم وكانت كبيرة في السن وأتى بها وأولادها إلى بيته....",
    "options": [
      'سودة بنت زمعة',
      'جويرية بنت الحارث',
      'أم سلمة',
    ],
    "answer_index":2 ,
  },
  {
    "id": 17,
    "question": "ما اسم أم المؤمنين أم حبيبة رضي الله عنها.....",
    "options": [
      'رملة بنت أبي سفيان',
      'زينب بنت جحش',
      'عائشة بنت أبي بكر',
    ],
    "answer_index": 0,
  },
  {
    "id": 18,
    "question": "آخر أمهات المؤمنين موتاً....",
    "options": [
      'خديجة بنت خويلد',
      'أم سلمة',
      'زينب بنت جحش',
    ],
    "answer_index": 1,
  },
];










const List mohamedTwoOne =
[
  {
    "id": 1,
    "question": "من النبي الذي كان يسبح معه الطير والجبال....",
    "options": [
      '	داوود عليه السلام',
      '	أيوب عليه السلام',
      '	إدريس عليه السلام',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "من النبي الملقب بذي النون....",
    "options": [
      'موسى عليه السلام',
      'يوسف عليه السلام',
      'يونس عليه السلام',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "من النبي الذي قال عنه الله وفديناه بذبح عظيم....",
    "options": [
      '	إسماعيل عليه السلام',
      '	يعقوب عليه السلام',
      '	لوط عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "زوجتا رسولين ضرب الله بهما المثل للذين كفروا....",
    "options": [
      '	امرأة نوح وامرأة لوط',
      '	امرأة أيوب وامرأة نوح',
      '	امرأة لوط وامرأة يعقوب',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "الزبور هو كتاب نبي الله....",
    "options": [
      'أيوب عليه السلام',
      'إبراهيم عليه السلام',
      'داوود عليه السلام',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "كم عدد إخوة نبي الله يوسف.....",
    "options": [
      '10',
      '11',
      '12',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من النبي الذي قال عنه الله لم نجعل له من قبل سميًّا.....",
    "options": [
      '	يحيى عليه السلام',
      '	عيسى عليه السلام',
      '	إلياس عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " النمرود كان عدو نبي الله.....",
    "options": [
      '	موسى عليه السلام',
      '	نوح عليه السلام',
      '	إبراهيم عليه السلام',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "ما اسم اليوم الذى نجى الله فيه موسى عليه السلام وأغرق فيه فرعون وجنوده....",
    "options": [
      '	يوم تاسوعاء',
      '	يوم عاشوراء',
      '	يوم عرفة',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من النبي المقصود بهذه الآية (وَءَاتَيناهُ الحُكمَ صَبِيًّا).....",
    "options": [
      'يحيى عليه السلام',
      '	زكريا عليه السلام',
      '	إدريس عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "من النبي الذي أخلفه موسى عليه السلام في قومه.....",
    "options": [
      '	عيسى عليه السلام',
      '	يونس عليه السلام',
      'هارون عليه السلام',
    ],
    "answer_index": 2,
  },
  {
    "id": 12,
    "question": "من النبي الذي أهلك الله قومه بريح صرصر عاتية....",
    "options": [
      'هود عليه السلام',
      'نوح عليه السلام',
      'موسى عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "أول من قال السلام عليكم.....",
    "options": [
      'نوح عليه السلام',
      'آدم عليه السلام',
      'إبراهيم عليه السلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "أول من يُكسى يوم القيامة.....",
    "options": [
      'يوسف عليه السلام',
      'يعقوب عليه السلام',
      'إبراهيم عليه السلام',
    ],
    "answer_index":2 ,
  },
  {
    "id": 15,
    "question": "ما اسم أبو نبي الله إبراهيم.....",
    "options": [
      'مناة',
      'آزر',
    ],
    "answer_index": 1,
  },
  {
    "id": 16,
    "question": "من النبي الذي أسلمت على يده ملكة سبأ.....",
    "options": [
      'داوود عليه السلام',
      'سليمان عليه السلام',
      'يوسف عليه السلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 17,
    "question": " من النبي الذي أرسله الله إِلَى مِائَةِ أَلْفٍ أَوْ يَزِيدُونَ ..........",
    "options": [
      'يونس عليه السلام',
      'داوود عليه السلام',
      'أيوب عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 18,
    "question": "من النبي الذي أرسله الله إلى أصحاب الأيكة....",
    "options": [
      'هود عليه السلام',
      'شعيب عليه السلام',
      'صالح عليه السلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "من النبي الذي ضرب الحجر فانفجرت منه اثنتا عشرة عينًا......",
    "options": [
      'سليمان عليه السلام',
      'يونس عليه السلام',
      'موسى عليه السلام',
    ],
    "answer_index": 2,
  },

];








const List mohamedThree =
[
  {
    "id": 1,
    "question": "من هو عبدالله بن أبي قحافة......",
    "options": [
      'أبي بكر الصديق',
      'عمر بن الخطاب',
      'زيد بن ثابت',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "من الصحابي الملقب بالفاروق.....",
    "options": [
      'أبي بكر الصديق',
      'عمر بن الخطاب',
      'عثمان بن عفان',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من الصحابي الملقب ب ذي النورين.....",
    "options": [
      'عمر بن الخطاب',
      'عثمان بن عفان',
      'على بن أبي طالب',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "من الصحابي الملقب ب أبي تراب....",
    "options": [
      'أبي بكر الصديق',
      'عمر بن الخطاب',
      'على بن أبي طالب',
    ],
    "answer_index":2 ,
  },
  {
    "id": 5,
    "question": "من هو مؤذن الرسول صلى الله عليه وسلم.....",
    "options": [
      'عمر بن الخطاب',
      'بلال بن رباح',
      'الزبير بن العوام',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من الصحابي الملقب ب سيف الله المسلول......",
    "options": [
      'حمزة بن عبدالمطلب',
      'خالد بن الوليد',
      'عمرو بن العاص',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من الصحابي الملقب بالطّيب المُطيب.....",
    "options": [
      'حسان بن ثابت',
      'عمار بن ياسر',
      'عبدالله بن الزبير',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من الصحابي الملقب ب أسد الله.....",
    "options": [
      'عمر بن الخطاب',
      'خالد بن الوليد',
      'حمزة بن عبدالمطلب',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "من الصحابي الملقب ب سفير الإسلام......",
    "options": [
      'مصعب بن عمير',
      'حذيفة بن اليمان',
      'عبدالله بن عباس',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "من الصحابي الملقب ب حمامة المسجد....",
    "options": [
      'زيد بن ثابت',
      'عبدالله بن الزبير',
      'أسامة بن زيد',
    ],
    "answer_index": 1,
  },

  {
    "id": 11,
    "question": "من هو أمير الرماة يوم أحد ....",
    "options": [
      'عبدالله بن جبير',
      'ثابت بن قيس',
      'أُبي بن كعب',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "من هو صاحب سر رسول الله صلى الله عليه وسلم.....",
    "options": [
      'عمرو بن العاص',
      'حذيفة بن اليمان',
      'أسامة بن زيد',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "من الصحابي الملقب ب داهية الإسلام(داهية أي عالي الذكاء).....",
    "options": [
      'عبدالله بن عباس',
      'الزبير بن العوام',
      'عمرو بن العاص',
    ],
    "answer_index": 2,
  },
  {
    "id": 14,
    "question": "من الصحابي الملقب ب حواريّ رسول الله صلى الله عليه وسلم.....",
    "options": [
      'مصعب بن عمير',
      'الزبير بن العوام',
      'زيد بن ثابت',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "من هو جامع القرآن.....",
    "options": [
      'حسان بن ثابت',
      'زيد بن ثابت',
      'أبو عبيدة بن الجراح',
    ],
    "answer_index": 1,
  },
  {
    "id": 16,
    "question": "من هو أمين الأمة.....",
    "options": [
      'أبو عبيدة بن الجراح',
      'عمار بن ياسر',
      'حذيفة بن اليمان',
    ],
    "answer_index":0 ,
  },
  {
    "id": 17,
    "question": "من شاعر رسول الله صلى الله عليه وسلم......",
    "options": [
      'أُبي بن كعب',
      'حسان بن ثابت',
      'عبدالله بن عباس',
    ],
    "answer_index": 1,
  },
  {
    "id": 18,
    "question": "من هو خطيب الرسول صلى الله عليه وسلم",
    "options": [
      'ثابت بن قيس',
      'زيد بن ثابت',
      'حسان بن ثابت',
    ],
    "answer_index": 0,
  },
  {
    "id": 19,
    "question": "من هو أسد معركة اليرموك.....",
    "options": [
      'سعيد بن زيد',
      'عبدالله بن عباس',
      'خالد بن الوليد',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "من هو حبر الأمة......",
    "options": [
      'ثابت بن قيس',
      'أبو عبيد بن الجراح',
      'عبدالله بن عباس',
    ],
    "answer_index": 2,
  },
];



const List mohamedFour =
[
  {
    "id": 1,
    "question": "كانت معجزة نبي الله آدم هي......",
    "options": [
      'انشقاق القمر',
      '	تسخير الجن',
      '	خلق الله من ضلعه أم البشر حواء',
    ],
    "answer_index":2 ,
  },
  {
    "id": 2,
    "question": "كانت معجزة نبي الله إدريس هي.....",
    "options": [
      '	أنجاه الله من النار',
      '	أول من خط بالقلم',
      '	تكليم الله',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": " كانت معجزة نبي الله نوح هي.....",
    "options": [
      'أنجاه الله من النار',
      '	سفينة النجاة حيث أوحى الله له صناعة الفلك',
      'جميع الاجابات صحيحة',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " كانت معجزة نبي الله صالح هي.....",
    "options": [
      '	انشقاق الصخر وخروج منه الناقة',
      '	انشقاق القمر',
      '	انشقاق الصخر وخروج منه الفيل',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "من معجزات نبي الله لوط هي.....",
    "options": [
      'عذاب مفجع لقومه الذين لم يؤمنوا به حيث قُلبت أرضهم فوق رؤوسهم ودفنوا تحتها ثم أمطر الله عليهم حجارة من سجيل',
      '	إلانة الحديد',
      '	كبش من السماء',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " كانت معجزة نبي الله هود هي.....",
    "options": [
      '	احياء الموتى',
      'العقاب الأليم حيث أهلك الله قومه بريح شديدة أهلكتهم',
      '	نبع ماء زمزم',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من هو أبو البشر الثاني.....",
    "options": [
      'نوح',
      'إبراهيم',
      'شعيب',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "كانت معجزة نبي الله إبراهيم هي.....",
    "options": [
      'أنجاه الله من بطن الحوت',
      'أنجاه الله من الغرق',
      'أنجاه الله من النار',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "كانت معجزة نبي الله إسماعيل هي.....",
    "options": [
      '	نبع ماء زمزم',
      '	فداه الله بكبش من السماء',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "من هو أبو الأنبياء.....",
    "options": [
      '	نبي الله موسى',
      '	نبي الله إبراهيم',
      '	نبي الله يعقوب',
    ],
    "answer_index": 1,
  },

  {
    "id": 11,
    "question": "كانت معجزة نبي الله يوسف هي.....",
    "options": [
      '	تحويل العصا إلى حية',
      'تسبيح الجبال والطير معه',
      '	تأويل الرؤيا',
    ],
    "answer_index": 2,
  },
  {
    "id": 12,
    "question": "كانت معجزة نبي الله أيوب هي....",
    "options": [
      '	تكليم الله',
      'شفاءه حيث ضرب برجله فانفجر ينبوع من الماء واغتسل وشرب منه فرجعت صحته في لحظات',
      'تكليم الموتى',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "كانت معجزة نبي الله داوود هي.....",
    "options": [
      '	إلانة الحديد',
      '	تسبيح الطير والجبال معه',
      '	جميع الاجابات صحيحة',
    ],
    "answer_index": 2,
  },
  {
    "id": 14,
    "question": "كانت معجزة نبي الله سليمان هي .....",
    "options": [
      '	علمه الله منطق الطير',
      'تسخير الجن والرياح',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index": 2,
  },
  {
    "id": 15,
    "question": " كانت معجزة نبي الله موسى هي....",
    "options": [
      'تحول عصاه إلى حية تسعى',
      'انشقاق البحر إلى نصفين',
      '	تكليم الله',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index": 3,
  },
  {
    "id": 16,
    "question": "كانت معجزة نبي الله إلياس هي.....",
    "options": [
      '	التكلم في المهد',
      '	حبس المطر (طلب من الله أن يمسك السماء على بني إسرائيل فهلك الزرع وماتت الماشية',
      '	انشقاق القمر',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index":1 ,
  },
  {
    "id": 17,
    "question": "كانت معجزة نبي الله يونس هي....",
    "options": [
      '	أنجاه الله من بطن الحوت',
      '	أنجاه الله من بطن الفيل',
      '	أنجاه الله من النار',
    ],
    "answer_index": 0,
  },
  {
    "id": 18,
    "question": "كانت معجزة نبي الله عيسى هي.....",
    "options": [
      '	التكلم في المهد',
      '	النفخ في الطين',
      '	دعى الله فأنزل عليه مائدة من السماء',
      'جميع الإجابات صحيحة',
    ],
    "answer_index": 3,
  },
  {
    "id": 19,
    "question": "من معجزات نبي الله محمد صلى الله عليه وسلم......",
    "options": [
      'الإسراء والمعراج',
      'انشقاق القمر',
      'سماعه أهل القبور',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index": 3,
  },
];




const List mohamedFive =
[
  {
    "id": 1,
    "question": "كانت مهنة نبي الله آدم عليه السلام.....",
    "options": [
      'التجارة',
      'الزراعة',
      'الحدادة',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "كانت مهنة نبي الله إدريس عليه السلام....",
    "options": [
      'الخياطة',
      'الصيد',
      'البناء',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "",
    "options": [
      'صياد',
      'نساج',
      'نجار وبحار',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "كانت مهنة نبي الله هود عليه السلام....",
    "options": [
      'الزراعة',
      'الخياطة',
      'التجارة',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "كانت مهنة نبي الله يعقوب عليه السلام......",
    "options": [
      '	رعي الأغنام',
      'الصيد',
      'الحدادة',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "كانت مهنة نبي الله داوود عليه السلام.....",
    "options": [
      'التجارة',
      'الحدادة',
      'الزراعة',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "كانت مهنة نبي الله صالح عليه السلام.....",
    "options": [
      '	البناء ورعي الإبل',
      '	التجارة',
      '	الخياطة',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " كانت مهنة نبي الله إلياس عليه السلام.....",
    "options": [
      'نساج',
      'خياط',
      'خباز',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " كانت مهنة نبي الله يونس عليه السلام.....",
    "options": [
      'الصيد',
      'التجارة',
      'النجارة',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "كانت مهنة نبي الله موسى عليه السلام (بعد خروجه من المدينة)......",
    "options": [
      'الزراعة',
      '	رعي الأغنام',
      'الخياطة',
    ],
    "answer_index": 1,
  },
    {
    "id": 11,
    "question": " كانت مهنة نبي الله لوط عليه السلام.....",
    "options": [
      '	صياد ومترجم',
      'نجار',
      '	مؤرخ ورحالة',
    ],
    "answer_index": 2,
  },
    {
    "id": 12,
    "question": "كانت مهنة نبي الله محمد صلى الله عليه وسلم في الصغر......",
    "options": [
      'رعي الأغنام',
      'الزراعة',
      'البناء',
    ],
    "answer_index": 0,
  },

];







const List mohamedTwoTwo =
[
  {
    "id": 1,
    "question": "من هو الصادق الأمين....",
    "options": [
      'محمد صلى الله عليه وسلم',
      'موسى عليه عليه السلام',
      'هارون عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "من هو كليم الله....",
    "options": [
      'هارون عليه السلام',
      '	موسى عليه السلام',
      'زكريا عليه السلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من هو ذي النون....",
    "options": [
      'نوح عليه السلام',
      '	إبراهيم عليه السلام',
      '	يونس عليه السلام',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "من هو الصديق....",
    "options": [
      'يوسف عليه السلام',
      '	عيسى عليه السلام',
      '	يونس عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "من هو أبو الأنبياء وخليل الله....",
    "options": [
      'إدريس عليه السلام',
      '	شعيب عليه السلام',
      'إبراهيم عليه السلام',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "من هو أبو البشر....",
    "options": [
      '	آدم عليه السلام',
      '	نوح عليه السلام',
      '	إبراهيم عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من هو خطيب الأنبياء....",
    "options": [
      'هود عليه السلام',
      '	يونس عليه السلام',
      '	شعيب عليه السلام',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": " من هو شيخ المرسلين....",
    "options": [
      'نوح عليه السلام',
      'ابراهيم عليه السلام',
      '	يونس عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "من هو ابن الذبيحين....",
    "options": [
      '	نوح عليه السلام',
      'إبراهيم عليه السلام',
      'محمد صلى الله عليه وسلم',
    ],
    "answer_index": 2,
  },
];







// const List mohamed =
// [
//    {
//     "id": 1,
//     "question": "",
//      "options": [
//        'صح',
//        'خطأ',
//      ],
//     "answer_index": ,
//   },
//    {
//       "id": 2,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 3,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 4,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 5,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 6,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 7,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 8,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 9,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 10,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
// ];
