const List hadithOne =
[
  {
    "id": 1,
    "question": " قال رسول الله ـ صلى الله عليه وسلم: لما عُرِجَ بي مررت بقوم لهم أظفار من نحاس يخمشون وجوههم وصدورهم، فقلت: من هؤلاء يا جبريل قال هؤلاء......",
    "options": [
      'الذين يأكلون لحوم الناس ويقعون في أعراضهم',
      'خطباء أمتك من أهل الدنيا، كانوا يأمرون الناس بالبر وينسون أنفسهم وهم يتلون الكتاب، أفلا يعقلون',
      'الناس ذا الوجهين الذي يأتي هؤلاء بوجه ويأتي هؤلاء بوجه',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "قال رسول الله صلى الله عليه وسلم: بينما أنا أسير في الجنة إذا أنا بنهر حافتاه قباب الدر المجوف، قلت ما هذا يا جبريل قاله إنه...",
    "options": [
      'نهر البيذخ',
      'نهر الكوثر',
      'نهر بارق',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "رأى النبي أقوامًا تقطَّع ألسنتهم وشفاههم بمقاريض من نار فقال لجبريل من هم فقال له جبريل هؤلاء......",
    "options": [
      'الذين يأكلون لحوم الناس ويقعون في أعراضهم',
      'آكل الربا، وموكله، وكاتبه، وشاهديه، وقال: هم سواء',
      'هؤلاء خطباء أمتك من أهل الدنيا، كانوا يأمرون الناس بالبر وينسون أنفسهم وهم يتلون الكتاب، أفلا يعقلون',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "في رحلة الإسراء قال النبي(فانطلقتُ مع جبريلَ حتى أتينا السماءَ الدنيا، قيل : من هذا؟ قال جبريلُ، قيل: من معك؟، قيل: محمدٌ، قيل: وقد أُرسِلَ إليه، قال: نعم، قيل: مرحبًا ولنِعمَ المجيءُ جاءَ، فأتيتُ على.......",
    "options": [
      'يوسف فسلمت عليه',
      'إدريس فسلمت عليه',
      'آدم فسلمت عليه',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "في رحلة الإسراء قال النبي صلى الله عليه وسلم (فأتينا السماءَ الثانيةَ، قيل: من هذا، قال: جبريل، قيل: من معك؟، قال محمدٌ ـ صلى الله عليه وسلم ـ، قيل: أُرسِلَ إليه، قال: نعم، قيل: مرحبًا به ولنِعمَ المجيءُ جاءَ، فأتيت على.....",
    "options": [
      'عيسى ويحيى',
      'عيسى وزكريا',
      'موسى وهارون',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "في رحلة الإسراء قال النبي صلى الله عليه وسلم (فأتينا السماءَ الثالثةَ, قيل: من هذا، قيل: جبريلُ، قيل: من معك؟، قيل: محمدٌ، قيل: وقد أُرسِلَ إليه، قال: نعم، قيل: مرحبًا به ولنِعمَ المجيءُ جاءَ، فأتيتُ على .....",
    "options": [
      'زكريا',
      'موسى',
      'يوسف',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "في رحلة الإسراء قال النبي صلى الله عليه وسلم( فأتينا السماءَ الرابعةَ، قيل: من هذا؟، قيل: جبريلُ، قيل: من معك؟، قيل: ـ محمدٌ صلى الله عليه وسلم ـ، قيل: وقد أُرسِلَ إليه، قيل: نعم، قيل: مرحبًا به ولنِعمَ المجيءُ جاءَ، فأتيتُ على ......",
    "options": [
      'إدريس',
      'يوسف',
      'هارون',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "في رحلة الإسراء قال النبي صلى الله عليه وسلم (فأتينا السماءَ الخامسةَ ، قيل: من هذا؟، قال: جبريلُ، قيل: ومن معك؟، قيل: محمدٌ، قيل: وقد أُرسِلَ إليه، قال: نعم، قيل: مرحبًا به ولنِعمَ المجيءُ جاءَ، فأتينا على.....",
    "options": [
      'موسى',
      'هارون',
      'يعقوب',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "في رحلة الإسراء قال النبي صلى الله عليه وسلم (فأتينا على السماءَ السادسةَ، قيل: من هذا؟، قيل: جبريلُ، قيل: من معك؟، قيل: محمدٌ ـ صلى الله عليه وسلم ـ، قيل: وقد أُرسِلَ إليه، مرحبًا به ولنِعمَ المجيءُ جاءَ، فأتيتُ على ......",
    "options": [
      'موسى',
      'إبراهيم',
      'لوط',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "في رحلة الإسراء قال النبي صلى الله عليه وسلم (فأتينا السماءَ السابعةَ، قيل: من هذا؟، قيل: جبريلُ، قيل: من معك؟، قيل: محمدٌ، قيل: وقد أُرسِلَ إليه، مرحبًا به ونِعمَ المجيءُ جاءَ ، فأتيتُ على......",
    "options": [
      'إبراهيم',
      'إسحاق',
      'إسماعيل',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "قال رسول الله صلى الله عليه وسلم : ( يُقَالُ لِصَاحِبِ الْقُرْآنِ : اقْرَأْ وَارْتَقِ وَرَتِّلْ ، كَمَا كُنْتَ تُرَتِّلُ فِي الدُّنْيَا ، فَإِنَّ مَنْزِلَكَ عِنْدَ.....",
    "options": [
      'أولِ آيَةٍ تَقْرَؤُهَا',
      'أوسطِ آيَةٍ تَقْرَؤُهَا',
      'آخِرِ آيَةٍ تَقْرَؤُهَا',
    ],
    "answer_index": 1,
  },

];













// const List mohamed =
// [
//    {
//     "id": 1,
//     "question": "",
//      "options": [
//        'صح',
//        'خطأ',
//      ],
//     "answer_index": ,
//   },
//    {
//       "id": 2,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 3,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 4,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 5,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 6,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 7,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 8,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 9,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 10,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
// ];
