
const List artOfLivingOne =
[
  {
    "id": 1,
    "question": " لا يوجد محاباة في تصحيح الأخطاء فهو منهج قرآني نبوي",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " أنت حر ما لم .....",
    "options": [
   'تضر',
   'تعص الله تعالى',
   'تجهر بالمعصية',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من حقك أن تنكر المنكر و ليس من حق فاعل المنكر أن يقول لك ( لا شأن لك فأنا حر )",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "إذا كنت تفعل نفس المنكر فليس لك أن تنكر على أحد حتي تتوب مما تفعل أولا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "التعامل مع المخطئ الجاهل يختلف عن التعامل مع المخطئ المتعمد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "كان النبي صلى الله عليه و سلم يكثر من استعمال أسلوب الزجر بالهجر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "العدل يعني المساواة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "إذا اجتمعت المفاسد .....",
    "options": [
   'تقدم المفسدة الأصغر',
   'تقدم المفسدة الأكبر',
   'نتوقف',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "الفقيه هو الذي يعرف .....",
    "options": [
   'أنواع الخير',
   'أنواع الشر',
   'خير الخيرين و شر الشرين',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "يلزم تغيير المنكر و لو ترتب عليه منكر أكبر منه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];


















const List artOfLivingTwo =
[
  {
    "id": 1,
    "question": " أي أسلوب تستعمله سيؤدي مقصد ..... و لكن استعمال الأسلوب المناسب سيساعد على ......",
    "options": [
      'الاعتذار إلى الله ، هداية المدعو',
      'هداية المدعو ، الاعتذار إلى الله',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " كيف تعامل النبي صلى الله عليه  و سلم مع الثلاثة الذين رأوا عبادته قليلة؟!",
    "options": [
   'أنكر عليهم ثم أزال الشبهة و استعمل أسلوب التعميم',
   'أزال الشبهة و استعمل أسلوب التعميم ثم أنكر المنكر',
   'أزال الشبهة و أنكر المنكر و لم يستعمل أسلوب التعميم',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "لا داعي لاحراج صاحب المنكر إذا كان يفهم بالتعريض ؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": " الأسلوب الذي استعمله النبي صلى الله عليه و سلم في إنكاره على أسامة بن زيد حين قتل رجل بعد أن قال لا إله إلا الله ؟!",
    "options": [
   'أسلوب إعطاء البديل',
   'أسلوب إثارة الناس على المخطئ',
   'أسلوب معالجة الخطأ بالموعظة',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": " موقف عمر بن الخطاب مع هشام بن حكيم بن حزام كان مشكلته في",
    "options": [
   'استعمال الرفق في موضع الشدة',
   'التسرع و عدم التثبت',
   'الرياء و عدم الإخلاص',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من أساليب النبي صلى الله عليه و سلم في تصحيح الخطأ بيان ضرر الخطأ ؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "المدح دائما ممنوع و لا يباح لأي أحد ؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " استعمل النبي صلى الله عليه و سلم أسلوب إثارة الناس على المخطئ مع",
    "options": [
   'مخطئ جاهل',
   'مخطئ متعمد تم وعظه مرة واحدة',
   'مخطئ متعمد لم تنفع معه المواعظ المتعددة',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "لو كان للشخص سوابق خير كثيرة فهذا غير مؤثر على اختيار أسلوب الإنكار عليه ؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": " استعمل النبي صلى الله عليه و سلم مع الذي رفض أن يأكل بيمينه عنادا و استكبارا أسلوب",
    "options": [
   'التذكير بالآخرة',
   'أسلوب الإعراض',
   'الدعاء على المخطئ',
    ],
    "answer_index": 2,
  },
];


















const List artOfLivingThree =
[
  {
    "id": 1,
    "question": " أمر الله للملائكة بالسجود لآدم لم يكن إبليس مخاطبا به؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "من ملامح الابتلاء أنه",
    "options": [
   'مقدور عليه',
   'الأدوات التي تحتاج لها متاحة مسخرة',
   'هناك تيسير و توفيق و إعانة',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 3,
    "question": "نزلنا إلى الأرض بسبب امتحان و لن نعود للجنة إلا بامتحان؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "كل أحداث حياتك هي عبارة عن اختبارات في امتحان كبير و الدليل",
    "options": [
       "لِّلَّذِينَ أَحْسَنُوا الْحُسْنَىٰ وَزِيَادَةٌ ۖ وَلَا يَرْهَقُ وُجُوهَهُمْ قَتَرٌ وَلَا ذِلَّةٌ ۚ أُولَٰئِكَ أَصْحَابُ الْجَنَّةِ",
       "إِنَّا جَعَلْنَا مَا عَلَى الْأَرْضِ زِينَةً لَّهَا لِنَبْلُوَهُمْ أَيُّهُمْ أَحْسَنُ عَمَلًا",
       "أَلا إِنَّ أَوْلِيَاءَ اللَّهِ لاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ",
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " الخير و الشر إنما هو في نوع الابتلاء و ليس في نتيجته؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " الله تعالى يبتلينا ",
    "options": [
   'شرعا فقط',
   'قدرا فقط',
   'شرعا و قدرا',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "قوله تعالى ( يَا أَيُّهَا الَّذِينَ آمَنُوا لَيَبْلُوَنَّكُمُ اللَّهُ بِشَيْءٍ مِّنَ الصَّيْدِ تَنَالُهُ أَيْدِيكُمْ وَرِمَاحُكُمْ لِيَعْلَمَ اللَّهُ مَن يَخَافُهُ بِالْغَيْبِ ) دل على",
    "options": [
   'خطورة الصحبة السيئة',
   'من الابتلاء تيسير الحرام',
   'عدم جواز مبيت المحرم في مكان فيه صيد',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " لا يصح أن نسمي النعم ابتلاءات؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "الله تعالى",
    "options": [
   'خالق الخير و الشر',
   'يفعل الخير و الشر',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "الابتلاء يكشف لك ",
    "options": [
   'حقيقة نفسك',
   'حقيقة من حولك',
   'صفات لله',
   'جميع ما سبق',
   '1 و 2 فقط',
    ],
    "answer_index": 3,
  },
];


















const List artOfLivingFour =
[
  {
    "id": 1,
    "question": " كل واحد منا يعتبر فتنة للآخر و سؤال في امتحانه؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "من هو تلميذ ابن عباس المذكور في حديث المرأة؟",
    "options": [
   'مجاهد',
   'عطاء بن أبي رباح',
   'قتادة',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": " من الطبيعي أن يتحطم الإنسان عند المصائب و لا يقدر على الاستمرار؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "من الذي أخبره النبي صلى الله عليه و سلم أن تقتله الفئة الباغية؟",
    "options": [
   'الزبير بن العوام',
   'طلحة بن عبيد الله',
   'عمار بن ياسر',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": " أحيانا البلاء لا يتغير لكن تستطيع أن تغيره..... ب ...",
    "options": [
   'الإحباط و التباؤس',
   'تغيير نظرتك و توجهك الذهني ناحيته',
   'اعتزال الواقع',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "الهم يكون على الأمور الماضية و الحزن على الأمور المستقبلية؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من زار مسلما صلى عليه .... ألف ملك",
    "options": [
   'ستون',
   'سبعون',
   'مائة',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "يصح أن نقول أن المرض عملية تجميل؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " مما يعين على مواجهة الابتلاء التركيز على المفقود دون الموجود ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": " حين تدعو الله سبحانه و تعالى ماذا سيحصل",
    "options": [
   'يعطيني ما طلبت',
   'يصرف عني من السوء مثل ما طلبت',
   'يدخر لي الأجر يوم القيامة',
   'يحتمل أي اختيار من الاختيارات السابقة',
    ],
    "answer_index": 3,
  },
];


















const List artOfLivingFive =
[
  {
    "id": 1,
    "question": "الأصل في المباحات أن لك عليها أجر؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " مشروع حياتك الذي تتمناه مع الاجتهاد لابد أن يتحقق؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "ما هي العبارة الصحيحة فيما يتعلق بالضروريات الخمس",
    "options": [
   'المال يقدم على النفس',
   'النفس تقدم على الدين',
   'الدين يقدم على النفس',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": " المحافظة على البدن ركن أساسي في مشروع حياتك و يشمل",
    "options": [
   'الغذاء الصحي',
   'تجنب الخمور و السجائر و الأطعمة الضارة',
   'ممارسة الرياضة',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 5,
    "question": "من شرط نجاح مقصد حفظ العرض أن تجد كل المواصفات التي تبحث عنها في شريك حياتك؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " من أهم الأمور لنجاح عملية تحديد نقاط قوتك و ضعفك",
    "options": [
   'الكبر',
   'التواضع',
   'الإنصاف',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "عند تعدد المسارات تكون الرغبة عامل مؤثر في الاختيار؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من التحليلات الحديثة التي تساعدك على اختيار مشروع حياتك",
    "options": [
       'SWOT analysis',
           'MASLO analysis',
           'MASLO pyramid',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " من عيوب عدم التوازن نظرة الانتقاص من قيمة المجالات الأخري؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " العمل المباح قد يكون طاعة أو معصية حسب...",
    "options": [
   'الهمة في العمل',
   'المسارعة في العمل',
   'النية',
   'جميع ما سبق',
    ],
    "answer_index": 2,
  },
];


















const List artOfLivingSix =
[
  {
    "id": 1,
    "question": " قامت دعوات الأنبياء على الدعوة الجماعية ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " مصعب بن عمير فتح المدينة من خلال ",
    "options": [
   'المسجد',
   'الدروس العامة',
   'الدعوة الفردية',
   'جميع ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "عدم استجابة الناس يصيب الداعية الصادق بالإحباط ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "عدم الوصول بالمدعو للشخصية الإسلامية المتكاملة يعني الفشل ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " أيهما أقوى في تغيير النفوس....",
    "options": [
   'الدعوة الجماعية',
   'الدعوة الفردية',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " يوسف عليه السلام في السجن بدأ دعوته مع المسجونين ",
    "options": [
   'بالكلام عن الله',
   'بالإحسان إليهم',
   'بالنهي عن الشرك',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " الدعوة الفردية",
    "options": [
   'لا يمكن منعها',
   'لا تكلف مال',
   'لا تحتاج لمكان خاص',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 8,
    "question": "علاقة الداعية الشخصية مع الله ليس لها أثر في دعوته الفردية...",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": " من أكبر الآفات المؤثرة سلبا على الدعوة الفردية",
    "options": [
   'الحسد',
   'التعلق',
   'العجلة',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "من الأساليب الناجحة في الدعوة الفريدة أن يشعر المدعو أنك قريب منه و لست تتكلم من برج عالي؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];


















const List artOfLivingSeven =
[
  {
    "id": 1,
    "question": "الطفيل بن عمرو الدوسي كان شديدا على قومه فعلمه النبي صلى الله عليه و سلم ",
    "options": [
 'الأوراد و الأذكار',
 'الدعاء لهداية قومه',
 'صلاة الحاجة',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " الدعوة الفردية أمر جبلي لا يكتسب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "أول خطوات الدعوة الفردية",
    "options": [
   'التعرف على شريحة كبيرة',
   'الانتقاء',
   'التربية',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "طرق خفة الظل لكسب المدعو تصلح مع الجميع",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " من الأمور المؤثرة في مرحلة التعارف ",
    "options": [
   'الزيارة المنزلية',
   'مجالس العلم',
   'الانطباعات الأولى',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": " المرحلة الثانية في الدعوة الفردية",
    "options": [
   'التعرف على شريحة كبيرة',
   'الانتقاء',
   'جمع المعلومات',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "كثرة أو قلة القواسم المشتركة بينك و بين المدعو أمر غير مؤثر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "ما هي أكثر مرحلة فيها تأثير نفسي",
    "options": [
   'مرحلة التعارف',
   'مرحلة الانتقاء',
   'مرحلة التقارب',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "لابد من تغيير كل منكرات المدعو أُناء مرحلة التقارب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "تعلق المدعو بك بشكل دائم هو أمر جيد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];


















const List artOfLivingEight =
[
  {
    "id": 1,
    "question": " نيتك عند النصيحة لها أثر في استجابة المدعو",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " تتأكد النصحية في حالة",
    "options": [
   'المسائل التي فيها خلاف سائغ',
   'المسائل التي فيها إجماع',
   'المسائل التي لا تعلم حكمها',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "استعمال أسلوب الهجر لردع المخالف هو أسلوب نافع دائما ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " لم يشتد النبي صلى الله عليه و سلم على الأعرابي في الإنكار لما بال في المسجد",
    "options": [
   'لأنه أعرابي',
   'لأنه جاهل',
   'لأن المنكر حصل في المسجد',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "إنما نعذر عند الخطأ في الاجتهاد من كان عنده أدوات الاجتهاد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "لا يجوز إنكار المنكر إذا",
    "options": [
   'غلبت المصلحة على المفسدة',
   'تساوت المصلحة و المفسدة',
   'غلبت المفسدة على المصلحة',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": " ليس الفقيه الذي يعرف خير الخيرين و شر الشرين لكنه الفقيه الذي يعرف الخير من الشر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " إذا كان التعريض يكفي فهو أولى من التصريح",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "عادة يستعمل أسلوب معالجة الخطأ بالموعظة مع",
    "options": [
   'الجاهل',
   'من عنده ديانة و خوف من الله',
   'المتعمد',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من يأتيك منكسرا نادما متأسفا على ذنبه فاستعمل معه أسلوب ",
    "options": [
   'الموعظة',
   'إثارة الناس على المخطئ',
   'الرفق و الرحمة',
    ],
    "answer_index": 2,
  },
  {
    "id": 11,
    "question": " أصحاب سوابق الخير الكبيرة يتعامل معهم تعامل مختلف عند الإنكار",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "نزلنا الأرض بسبب امتحان و لن نعود للجنة إلا بامتحان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": " الله تعالى يبتلينا",
    "options": [
   'بالتكاليف الشرعية',
   'بالأحداث القدرية',
   'كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 14,
    "question": "( إنا بلوناهم كما بلونا أصحاب الجنة ... ) بمائا ابتلى الله أصحاب الجنة",
    "options": [
   'بالأمراض',
   'بالفقر',
   'بزكاة المال',
    ],
    "answer_index": 2,
  },
  {
    "id": 15,
    "question": "سترى الأمور أحسن بكثير إذا ركزت على",
    "options": [
   'المفقود',
   'الموجود',
    ],
    "answer_index": 1,
  },
  {
    "id": 16,
    "question": " قد تكون إجابة دعاءك أن يصرف عن من السوء مثل ما دعوت",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 17,
    "question": " تحليلك لمشروع حياتك يركز على محورين فقط : نقاط قوتك و نقاط ضعفك",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 18,
    "question": "العمل عبادة ( هذه العبارة صحيحة )",
    "options": [
   'نعم صحيحة مطلقا',
   'صحيحة بشرط النية',
   'غير صحيحة',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": " الحد الأدنى من أهداف الدعوة ",
    "options": [
   'استجابة المدعو',
   'حصول نكاية في قلب المدعو',
   'الاعتذار إلى الله',
    ],
    "answer_index": 2,
  },
  {
    "id": 20,
    "question": " يأتيك الحماس في الدعوة بسبب ",
    "options": [
   'علمك أنك على الحق المبين',
   'إحساسك بخطورة المرحلة و حاجة الشباب الشديدة',
   'اعتمادك على نفسك',
   'جميع ما سبق',
   '1 و 2 فقط',
    ],
    "answer_index": 4,
  },
];


















const List artOfLivingNine =
[
  {
    "id": 1,
    "question": " أمر الله تعالى جميع الناس بالإيمان هو",
    "options": [
 'أمر شرعي',
 'أمر كوني',
 'كلاهما',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "قد تتعارض الإرادة الشرعية مع الإرادة الكونية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " اختلافنا في الأعمال و المهن هو من ",
    "options": [
   'الاختلاف المحمود',
   'الاختلاف المذموم',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "خلاف التنوع مذموم و ينبغي أن نجتهد في إزالته ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "كل أنواع خلاف التضاد غير سائغة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " من أنواع الخلاف السائغ",
    "options": [
   'الخلاف بين السنة و الشيعة',
   'الخلاف بين الإسلام و النصرانية',
   'الاختلاف في حكم النقاب',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": " قطعي الثبوت تعني",
    "options": [
   'هناك خلاف في صحته',
   'لا خلاف في صحته',
   'هناك خلاف في فهمه',
   'لا خلاف في فهمه',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "قطعي الدلالة تعني",
    "options": [
   'هناك خلاف في صحته',
   'لا خلاف في صحته',
   'هناك خلاف في فهمه',
   'لا خلاف في فهمه',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": " لو هناك قول مخالف للإجماع فهو من الخلاف الغير سائغ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " اختر العبارة الصحيحة",
    "options": [
   'الحق لا يتعدد و من أصاب الحق هو المأجور',
   'الحق يتعدد و كل مجتهد مأجور',
   'الحق لا يتعدد و كل مجتهد مأجور',
    ],
    "answer_index": 2,
  },
  {
    "id": 11,
    "question": " في الخلاف السائغ يمكن للإنسان العامي أن يختر من المذاهب ما يشاء",
    "options": [
    'صح',
    'خطأ',
    ],
    "answer_index": 1,
  },
];


















const List artOfLivingTen =
[
  {
    "id": 1,
    "question": " من أصول فن التعامل مع الناس استقصاء الحق",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " طلب النبي صلى الله عليه و سلم من الأعرابي الذي سأله متى الساعة أن يخفض صوته",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "عند الصلح بين الزوجين",
    "options": [
   'يراعي رأي المصلح في تقدير الطباع',
   'يراعي ما يقبله الزوجين من الطباع',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " ليس الغبي بسيد في قومه و لكن سيد قومه",
    "options": [
   'المستقصي',
   'المتغابي',
   'المتعاون',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "لو شخص محسن أساء لك مرة و يغلب على ظنك أنها لا تتكرر منه فالتصرف الصحيح هو تنبيهه لذلك الخطأ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " الشخص يقاس بآخر أفعاله ... هذه الجملة",
    "options": [
      'صحيحة',
      'خاطئة',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " ما هو العفو المحمود",
    "options": [
   'كل أنواع العفو محمودة',
   'العفو الذي يترتب عليه إصلاح',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " كل ما تعارف عليه الناس يدخل في العرف الذي ينبغي أن نراعيه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": " العفو و الإعراض اختيارات تصلح مع الآدمي و لا تصلح مع الشيطان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "من صفات الأتقياء أنهم لا يمسهم طائف من الشيطان ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];


















const List artOfLivingEleven =
[
  {
    "id": 1,
    "question": "ذكرنا في الدرس أن أسس الاختيار ثلاثة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "الجانب الاجتماعي يشمل",
    "options": [
   'العبادات',
   'الطباع',
   'التعليم',
   'جميع ما سبق',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "مسألة الطباع مسألة نسبية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": " من شروط الجانب الديني في المواصفات تجنب جميع المعاصي",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من شروط الجانب النفسي الأساسية وجود حب بين الطرفين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " لو هناك عيب في فتاة تقدم لها صديقك و هذا العيب مؤثر بالنسبة له لكنك لما عرفت العيب رأيته تافها",
    "options": [
   'تضغط عليه حتى يتجاوز هذا العيب',
   'تتركه و شأنه',
   'تنصحه فقط بوجهة نظرك و لا تضغط عليه',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": " الأسس كلها لابد أن يكون لها نفس الوزن النسبي عند التقييم الكلي",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "لا يجوز بأي حال من الأحوال رفض العريس الذي نرضى دينه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": " لو هناك عيب مصيري بالنسبة لي موجود حاليا في الطرف الآخر",
    "options": [
   'نرفضه',
   'نتزوج و نحاول نغيره',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " لو العريس أقصر من العروسة",
    "options": [
   'سبب كاف للرفض',
   'سبب غير كاف للرفض',
   'العيب نسبي يتفاوت من فتاة لأخرى',
    ],
    "answer_index": 2,
  },
];


















const List artOfLivingTwelve =
[
  {
    "id": 1,
    "question": "رفع سقف التوقعات يساعد على مزيد من الرضى",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "جمال الشكل يغطي على باقي عيوب الطرف الآخر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": " كيف تعرف أن صلاة الاستخارة نتيجتها إيجابية",
    "options": [
   'لابد أن ترى رؤيا',
   'يكفي انشراح الصدر و تيسير الأمر',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " لنجاح العلاقات الزوجية لابد",
    "options": [
   'أن يكون الزوجان لهما نفس لغة الحب',
   'أن يكون الزوجان مختلفان في لغة الحب',
   'أن يعرف كل طرف لغة الحب التي يفهمها الطرف الآخر',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": " لو كانت لغة الحب عند الشخص هي الثناء فاحرص على",
    "options": [
   'الثناء و المديح على الأمور العادية',
   'الثناء و المديح أمام الأهل و الأولاد',
   'استعمال ألطف العبارات عند العتاب',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "قد يكون عند الشخص الواحد أكثر من لغة حب ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "لو كانت لغة الحب عند شخص هي تكريس الوقت فأحيانا يعرض عليك مشكلته لتسمعه و تتفاعل معه لا لتعطيه الحلول ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من المهم لمن لغته الهدايا",
    "options": [
   'أن تكون الهدية متسقة مع اهتماماته',
   'اختيار توقيت و طريقة تقديم الهدية',
   'الاهتمام بقيمة الهدية المادية',
   'جميع ما سبق',
   '1و 2 فقط',
    ],
    "answer_index": 4,
  },
  {
    "id": 9,
    "question": "عنصر المفاجأة غير مؤثر عند من لغته ( الهدايا )",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "كيف تعرف لغة الحب عند الطرف الآخر",
    "options": [
   'السؤال المباشر',
   'أن يصرح هو لك بها',
   'أن تلاحظ أثرها الإيجابي الواضح',
   'أن تلاحظ الأثر السلبي الواضح عند عدم تواجد هذه اللغة',
   'جميع ما سبق',
    ],
    "answer_index": 4,
  },
];






