String points = '....';
 List partOne =
[
  {
    "id": 1,
    "question": "سورة الفاتحة......",
    "options": [
      'سورة مكية',
      'سورة مدنية',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " تبدأ سورة البقرة ب ......",
    "options": [
      'الٓمٓ',
      'الٓمٓصٓ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "ذَٰلِكَ ٱلۡكِتَٰبُ لَا رَيۡبَۛ فِيهِۛ هُدٗى ......",
    "options": [
      'للمُؤْمنِينَ',
      '	لِّلۡمُتَّقِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ....... فَمَا رَبِحَت تِّجَٰرَتُهُمۡ وَمَا كَانُواْ مُهۡتَدِينَ",
    "options": [
      'ٱلضَّلَٰلَةَ بِٱلۡهُدَىٰ',
      'ٱلۡهُدَىٰ بٱلضَّلَٰلَةَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "(أَوۡ كَصَيِّبٖ مِّنَ ٱلسَّمَآءِ فِيهِ ظُلُمَٰتٞ وَرَعۡدٞ وَبَرۡقٞ) معنى صيب.....",
    "options": [
      'نار شديدة',
      'مطر شديد',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "(فَأَنزَلۡنَا عَلَى ٱلَّذِينَ ظَلَمُواْ رِجۡزٗا مِّنَ ٱلسَّمَآءِ بِمَا كَانُواْ يَفۡسُقُونَ ). معنى رجزاً",
    "options": [
      'عذاباً',
      'رحمةً ومغفرةً',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "وَإِذۡ وَٰعَدۡنَا مُوسَىٰٓ ..... لَيۡلَةٗ ثُمَّ ٱتَّخَذۡتُمُ ٱلۡعِجۡلَ مِنۢ بَعۡدِهِۦ وَأَنتُمۡ ظَٰلِمُونَ",
    "options": [
      'ثَلاثِينَ',
      '	أَرۡبَعِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " (قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٞ لَّا فَارِضٞ وَلَا بِكۡرٌ عَوَانُۢ بَيۡنَ ذَٰلِكَۖ فَٱفۡعَلُواْ مَا تُؤۡمَرُونَ) \nمعنى فارض....",
    "options": [
      '	صغيرة السن',
      'مسنة وهرمة',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "(قَالَ إِنَّهُۥ يَقُولُ إِنَّهَا بَقَرَةٞ لَّا ذَلُولٞ تُثِيرُ ٱلۡأَرۡضَ وَلَا تَسۡقِي ٱلۡحَرۡثَ مُسَلَّمَةٞ لَّا شِيَةَ فِيهَاۚ ) \nمعنى مُسَلَّمَةٞ....",
    "options": [
      'خالية من العيوب',
      '	ملئية بالعيوب',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "وَلَقَدۡ ءَاتَيۡنَا مُوسَى ..... وَقَفَّيۡنَا مِنۢ بَعۡدِهِۦ بِٱلرُّسُلِۖ",
    "options": [
      '	ٱلۡبَيِّنَٰت',
      '	ٱلۡكِتَٰبَ',
    ],
    "answer_index": 1,
  },
    {
    "id": 11,
    "question": " (وَإِذۡ أَخَذۡنَا مِيثَٰقَكُمۡ وَرَفَعۡنَا فَوۡقَكُمُ ٱلطُّورَ خُذُواْ مَآ ءَاتَيۡنَٰكُم بِقُوَّةٖ وَٱسۡمَعُواْۖ قَالُواْ سَمِعۡنَا ..... وَأُشۡرِبُواْ فِي قُلُوبِهِمُ ٱلۡعِجۡلَ بِكُفۡرِهِمۡۚ",
    "options": [
      'وَعَصَيۡنَا',
      'وَأَطعنَا',
    ],
    "answer_index": 0,
  },
    {
    "id": 12,
    "question": " وَلَٰكِنَّ ٱلشَّيَٰطِينَ كَفَرُواْ يُعَلِّمُونَ ٱلنَّاسَ ..... وَمَآ أُنزِلَ عَلَى ٱلۡمَلَكَيۡنِ بِبَابِلَ هَٰرُوتَ وَمَٰرُوتَۚ ",
    "options": [
      'الفِتنةَ',
      '	ٱلسِّحۡرَ',
    ],
    "answer_index": 1,
  },
    {
    "id": 13,
    "question": "وَمَنۡ ...... مِمَّن مَّنَعَ مَسَٰجِدَ ٱللَّهِ أَن يُذۡكَرَ فِيهَا ٱسۡمُهُۥ وَسَعَىٰ فِي خَرَابِهَآۚ",
    "options": [
      '	أَظۡلَمُ',
      '	كَفَرَ',
    ],
    "answer_index": 0,
  },
    {
    "id": 14,
    "question": " وَوَصَّىٰ بِهَآ إِبۡرَٰهِـۧمُ بَنِيهِ وَيَعۡقُوبُ يَٰبَنِيَّ إِنَّ ٱللَّهَ ٱصۡطَفَىٰ لَكُمُ ٱلدِّينَ فَلَا تَمُوتُنَّ إِلَّا وَأَنتُم .....",
    "options": [
      'مُّؤمِنونَ',
      'مُّسۡلِمُونَ',
    ],
    "answer_index": 1,
  },
    {
    "id": 15,
    "question": " سورة البقرة.....",
    "options": [
      '	مكية',
      'مدنية',
    ],
    "answer_index": 1,
  },
  {
    "id": 16,
    "question": "وَٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ ......",
    "options": [
      'إِنَّ اللَّهَ مَعَ الصَّابِرِينَ',
      '	وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلۡخَٰشِعِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 17,
    "question": "وَقَالُواْ لَن تَمَسَّنَا ٱلنَّارُ إِلَّآ أَيَّامٗا مَّعۡدُودَةٗۚ ......",
    "options": [
      'قُلۡ أَتَّخَذۡتُمۡ عِندَ ٱللَّهِ عَهۡدٗا فَلَن يُخۡلِفَ ٱللَّهُ عَهۡدَهُۥٓۖ أَمۡ تَقُولُونَ عَلَى ٱللَّهِ مَا لَا تَعۡلَمُونَ',
      '	وَغَرَّهُمْ فِي دِينِهِمْ مَا كَانُوا يَفْتَرُونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 18,
    "question": "وَإِذۡ قَالَ إِبۡرَٰهِـۧمُ رَبِّ ٱجۡعَلۡ هَٰذَا بَلَدًا ءَامِنٗا .....",
    "options": [
      '	وَاجْنُبْنِي وَبَنِيَّ أَن نَّعْبُدَ الْأَصْنَامَ',
      '	وَٱرۡزُقۡ أَهۡلَهُۥ مِنَ ٱلثَّمَرَٰتِ مَنۡ ءَامَنَ مِنۡهُم بِٱللَّهِ وَٱلۡيَوۡمِ ٱلۡأٓخِرِۚ',
    ],
    "answer_index": 1,
  },
  {
    "id": 19,
    "question": "أُوْلَٰٓئِكَ ٱلَّذِينَ ٱشۡتَرَوُاْ ٱلضَّلَٰلَةَ بِٱلۡهُدَىٰ ......",
    "options": [
      '	فَمَا رَبِحَت تِّجَٰرَتُهُمۡ وَمَا كَانُواْ مُهۡتَدِينَ',
      'وَٱلۡعَذَابَ بِٱلۡمَغۡفِرَةِۚ فَمَآ أَصۡبَرَهُمۡ عَلَى ٱلنَّارِ',
    ],
    "answer_index": 0,
  },
  {
    "id":20,
    "question": "صُمُّۢ بُكۡمٌ عُمۡيٞ ......",
    "options": [
      'فَهُمۡ لَا يَعقِلونَ',
      '	فَهُمۡ لَا يَرۡجِعُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id":21,
    "question": "ٱلَّذِي جَعَلَ لَكُمُ ٱلۡأَرۡضَ فِرَٰشٗا وَٱلسَّمَآءَ بِنَآءٗ وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ .......",
    "options": [
      '	وَسَخَّرَ لَكُمُ الْفُلْكَ لِتَجْرِيَ فِي الْبَحْرِ بِأَمْرِهِ ۖ وَسَخَّرَ لَكُمُ الْأَنْهَارَ',
      '	فَأَخۡرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ رِزۡقٗا لَّكُمۡۖ فَلَا تَجۡعَلُواْ لِلَّهِ أَندَادٗا وَأَنتُمۡ تَعۡلَمُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id":21,
    "question": "وَبَشِّرِ ٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ أَنَّ لَهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُۖ .......",
    "options": [
      '	كُلَّمَا رُزِقُواْ مِنۡهَا مِن ثَمَرَةٖ رِّزۡقٗا قَالُواْ هَٰذَا ٱلَّذِي رُزِقۡنَا مِن قَبۡلُۖ وَأُتُواْ بِهِۦ مُتَشَٰبِهٗاۖ',
      '	خَالِدِينَ فِيهَا أَبَدًا ذَلِكَ الْفَوْزُ الْعَظِيمُ',
    ],
    "answer_index": 0,
  },
  {
    "id":23,
    "question": "وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ لِأٓدَمَ فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ......",
    "options": [
      '	لَمۡ يَكُن مِّنَ ٱلسَّٰجِدِينَ',
      '	أَبَىٰ وَٱسۡتَكۡبَرَ وَكَانَ مِنَ ٱلۡكَٰفِرِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id":24,
    "question": "وَقُلۡنَا يَٰٓـَٔادَمُ ٱسۡكُنۡ أَنتَ وَزَوۡجُكَ ٱلۡجَنَّةَ......",
    "options": [
      '	وَكُلَا مِنۡهَا رَغَدًا حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هَٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّٰلِمِينَ',
      '	فَكُلَا مِنۡ حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هَٰذِهِ ٱلشَّجَرَةَ فَتَكُونَا مِنَ ٱلظَّٰلِمِينَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 25,
    "question": "وَإِذِ ٱسۡتَسۡقَىٰ مُوسَىٰ لِقَوۡمِهِۦ فَقُلۡنَا ٱضۡرِب بِّعَصَاكَ ٱلۡحَجَرَۖ..... مِنۡهُ ٱثۡنَتَا عَشۡرَةَ عَيۡنٗاۖ ",
    "options": [
      '	فَٱنفَجَرَتۡ',
      '	فَٱنبَجَستۡ',
    ],
    "answer_index": 0,
  },

];




const List partTwo =
[
  {
    "id": 1,
    "question": "(وَكَذَٰلِكَ جَعَلۡنَٰكُمۡ أُمَّةٗ وَسَطٗا لِّتَكُونُواْ شُهَدَآءَ عَلَى ٱلنَّاسِ وَيَكُونَ ٱلرَّسُولُ عَلَيۡكُمۡ شَهِيدٗاۗ وَمَا جَعَلۡنَا ٱلۡقِبۡلَةَ ٱلَّتِي كُنتَ عَلَيۡهَآ إِلَّا لِنَعۡلَمَ مَن يَتَّبِعُ ٱلرَّسُولَ مِمَّن يَنقَلِبُ عَلَىٰ عَقِبَيۡهِۚ). معنى يَنقَلِبُ عَلَىٰ عَقِبَيۡهِۚ.....",
    "options": [
      'يقع على وجهه',
      '	يرتد عن دينه',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱسۡتَعِينُواْ بِٱلصَّبۡرِ وَٱلصَّلَوٰةِۚ....... ",
    "options": [
      '	إِنَّ ٱللَّهَ مَعَ ٱلصَّٰبِرِينَ',
      '	وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى ٱلۡخَٰشِعِينَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "وَلَنَبۡلُوَنَّكُم بِشَيۡءٖ مِّنَ ٱلۡخَوۡفِ وَٱلۡجُوعِ وَنَقۡصٖ مِّنَ ٱلۡأَمۡوَٰلِ وَٱلۡأَنفُسِ وَٱلثَّمَرَٰتِۗ ....",
    "options": [
      'وَبَشِّرِ المُؤمِنينَ',
      '	وَبَشِّرِ ٱلصَّٰبِرِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "ٱلَّذِينَ إِذَآ أَصَٰبَتۡهُم مُّصِيبَةٞ قَالُوٓاْ إِنَّا لِلَّهِ وَإِنَّآ إِلَيۡهِ .....",
    "options": [
      '	رَٰجِعُونَ',
      '	قَادِمونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "(إِنَّ فِي خَلۡقِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ وَٱخۡتِلَٰفِ ٱلَّيۡلِ وَٱلنَّهَارِ وَٱلۡفُلۡكِ ٱلَّتِي تَجۡرِي فِي ٱلۡبَحۡرِ بِمَا يَنفَعُ ٱلنَّاسَ) معنى الفلك",
    "options": [
      '	السفن',
      '	الطائرات',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "يَٰٓأَيُّهَا ٱلنَّاسُ كُلُواْ ....... وَلَا تَتَّبِعُواْ خُطُوَٰتِ ٱلشَّيۡطَٰنِۚ إِنَّهُۥ لَكُمۡ عَدُوّٞ مُّبِينٌ",
    "options": [
      '	من طَيباتِ ما رَزقنَاكُم',
      '	مِمَّا فِي ٱلۡأَرۡضِ حَلَٰلٗا طَيِّبٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "وَمَثَلُ ٱلَّذِينَ كَفَرُواْ كَمَثَلِ ٱلَّذِي يَنۡعِقُ بِمَا لَا يَسۡمَعُ إِلَّا دُعَآءٗ وَنِدَآءٗۚ صُمُّۢ بُكۡمٌ عُمۡيٞ ..... ",
    "options": [
      '	فَهُمۡ لَا يَعۡقِلُونَ',
      'فَهُمۡ لَا يَفقَهونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "(وَٱلصَّٰبِرِينَ فِي ٱلۡبَأۡسَآءِ وَٱلضَّرَّآءِ وَحِينَ ٱلۡبَأۡسِۗ أُوْلَٰٓئِكَ ٱلَّذِينَ صَدَقُواْۖ وَأُوْلَٰٓئِكَ هُمُ ٱلۡمُتَّقُونَ ) معنى البأساء",
    "options": [
      '	الفقر',
      '	الثراء والغنى',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "شَهۡرُ رَمَضَانَ ٱلَّذِيٓ أُنزِلَ فِيهِ .....",
    "options": [
      '	الفُرقَانُ',
      '	ٱلۡقُرۡءَانُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "وإذا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌۖ أُجِيبُ دَعۡوَةَ ...... إِذَا دَعَانِۖ فَلۡيَسۡتَجِيبُواْ لِي وَلۡيُؤۡمِنُواْ بِي لَعَلَّهُمۡ يَرۡشُدُونَ",
    "options": [
      'ٱلدَّاعِ',
      'السَّائِل',
    ],
    "answer_index": 0,
  },
    {
    "id": 11,
    "question": "يَسۡـَٔلُونَكَ عَنِ ٱلۡأَهِلَّةِۖ قُلۡ هِيَ مَوَٰقِيتُ لِلنَّاسِ وَٱلۡحَجِّۗ وَلَيۡسَ ٱلۡبِرُّ بِأَن تَأۡتُواْ ٱلۡبُيُوتَ مِن ..... وَلَٰكِنَّ ٱلۡبِرَّ مَنِ ٱتَّقَىٰۗ وَأۡتُواْ ٱلۡبُيُوتَ مِنۡ .... وَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تُفۡلِحُونَ ",
    "options": [
      '	أَبۡوَٰبِهَاۚ، ظُهُورِهَا',
      'ظُهُورِهَا، أَبۡوَٰبِهَاۚ',
    ],
    "answer_index": 1,
  },
    {
    "id": 12,
    "question": "وَمِنَ ٱلنَّاسِ مَن يُعۡجِبُكَ ..... فِي ٱلۡحَيَوٰةِ ٱلدُّنۡيَا وَيُشۡهِدُ ٱللَّهَ عَلَىٰ مَا فِي قَلۡبِهِۦ وَهُوَ أَلَدُّ ٱلۡخِصَامِ",
    "options": [
      'قَوۡلُهُۥ',
      'فِعَلَهُ',
    ],
    "answer_index": 0,
  },
    {
    "id": 13,
    "question": "(وَإِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَبَلَغۡنَ أَجَلَهُنَّ فَلَا تَعۡضُلُوهُنَّ أَن يَنكِحۡنَ أَزۡوَٰجَهُنَّ إِذَا تَرَٰضَوۡاْ بَيۡنَهُم بِٱلۡمَعۡرُوفِۗ) . معنى تعضلوهن",
    "options": [
      'تضربوهن',
      'تمنعوهن',
    ],
    "answer_index": 1,
  },
    {
    "id": 14,
    "question": "حَٰفِظُواْ عَلَى ٱلصَّلَوَٰتِ وَٱلصَّلَوٰةِ ...... وَقُومُواْ لِلَّهِ قَٰنِتِين",
    "options": [
      '	ٱلۡوُسۡطَىٰ',
      'الأُولَىٰ',
    ],
    "answer_index": 0,
  },
    {
    "id": 15,
    "question": "وَقَالَ لَهُمۡ نَبِيُّهُمۡ إِنَّ ٱللَّهَ قَدۡ بَعَثَ لَكُمۡ ...... مَلِكٗاۚ قَالُوٓاْ أَنَّىٰ يَكُونُ لَهُ ٱلۡمُلۡكُ عَلَيۡنَا وَنَحۡنُ أَحَقُّ بِٱلۡمُلۡكِ مِنۡهُ",
    "options": [
      '	طَالُوتَ',
      '	جَالُوتَ',
    ],
    "answer_index": 0,
  },

];



const List partThree =
[
  {
    "id": 1,
    "question": "ٱللَّهُ لَآ إِلَٰهَ إِلَّا هُوَ ٱلۡحَيُّ ٱلۡقَيُّومُۚ لَا تَأۡخُذُهُۥ سِنَةٞ وَلَا نَوۡمٞۚ لَّهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۗ مَن ذَا ٱلَّذِي يَشۡفَعُ عِندَهُۥٓ إِلَّا بِإِذۡنِهِۦۚ يَعۡلَمُ مَا بَيۡنَ أَيۡدِيهِمۡ ......",
    "options": [
      'وَمَا خَلۡفَهُمۡۖ',
      '	وَمَا وَراءَ ظُهورِهم',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "(أَوۡ كَٱلَّذِي مَرَّ عَلَىٰ قَرۡيَةٖ وَهِيَ خَاوِيَةٌ عَلَىٰ عُرُوشِهَا قَالَ أَنَّىٰ يُحۡيِۦ هَٰذِهِ ٱللَّهُ بَعۡدَ مَوۡتِهَاۖ فَأَمَاتَهُ ٱللَّهُ مِاْئَةَ عَامٖ ثُمَّ بَعَثَهُۥۖ قَالَ كَمۡ لَبِثۡتَۖ قَالَ لَبِثۡتُ يَوۡمًا أَوۡ بَعۡضَ يَوۡمٖۖ قَالَ بَل لَّبِثۡتَ مِاْئَةَ عَامٖ فَٱنظُرۡ إِلَىٰ طَعَامِكَ وَشَرَابِكَ لَمۡ يَتَسَنَّهۡۖ) معنى يتسنه",
    "options": [
      '	يتغير',
      '	يظل ثابت',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "وَإِذۡ قَالَ إِبۡرَٰهِـۧمُ رَبِّ أَرِنِي كَيۡفَ تُحۡيِ ٱلۡمَوۡتَىٰۖ قَالَ أَوَ لَمۡ تُؤۡمِنۖ قَالَ بَلَىٰ وَلَٰكِن لِّيَطۡمَئِنَّ قَلۡبِيۖ قَالَ فَخُذۡ ..... مِّنَ ٱلطَّيۡرِ فَصُرۡهُنَّ إِلَيۡكَ",
    "options": [
      '	ثَلاثةً',
      'أَرۡبَعَةٗ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "..... مَّعۡرُوفٞ وَمَغۡفِرَةٌ خَيۡرٞ مِّن صَدَقَةٖ يَتۡبَعُهَآ أَذٗىۗ وَٱللَّهُ غَنِيٌّ حَلِيمٞ",
    "options": [
      '	قَوۡلٞ',
      '	فِعلٌ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "(وَمَثَلُ ٱلَّذِينَ يُنفِقُونَ أَمۡوَٰلَهُمُ ٱبۡتِغَآءَ مَرۡضَاتِ ٱللَّهِ وَتَثۡبِيتٗا مِّنۡ أَنفُسِهِمۡ كَمَثَلِ جَنَّةِۭ بِرَبۡوَةٍ أَصَابَهَا وَابِلٞ فَـَٔاتَتۡ أُكُلَهَا ضِعۡفَيۡنِ فَإِن لَّمۡ يُصِبۡهَا وَابِلٞ فَطَلّٞۗ وَٱللَّهُ بِمَا تَعۡمَلُونَ بَصِيرٌ ) معنى فَطَلّٞۗ....",
    "options": [
      'نار شديدة',
      '	مطر خفيف',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " (يَمۡحَقُ ٱللَّهُ ٱلرِّبَوٰاْ وَيُرۡبِي ٱلصَّدَقَٰتِۗ وَٱللَّهُ لَا يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ) معنى يمحق...",
    "options": [
      'ينقص ويذهب البركة',
      'يزيد ويبارك فيها',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "ءَامَنَ ..... بِمَآ أُنزِلَ إِلَيۡهِ مِن رَّبِّهِۦ وَٱلۡمُؤۡمِنُونَۚ كُلٌّ ءَامَنَ بِٱللَّهِ وَمَلَٰٓئِكَتِهِۦ وَكُتُبِهِۦ وَرُسُلِهِۦ لَا نُفَرِّقُ بَيۡنَ أَحَدٖ مِّن رُّسُلِهِۦۚ وَقَالُواْ سَمِعۡنَا وَأَطَعۡنَاۖ غُفۡرَانَكَ رَبَّنَا وَإِلَيۡكَ ٱلۡمَصِيرُ",
    "options": [
      'ٱلرَّسُولُ',
      '	النَّبيُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "رَبَّنَا وَلَا تُحَمِّلۡنَا مَا لَا طَاقَةَ لَنَا بِهِۦۖ وَٱعۡفُ عَنَّا وَٱغۡفِرۡ لَنَا وَٱرۡحَمۡنَآۚ أَنتَ ..... فَٱنصُرۡنَا عَلَى ٱلۡقَوۡمِ ٱلۡكَٰفِرِينَ ",
    "options": [
      'رَبُنا',
      '	مَوۡلَىٰنَا',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "رَبَّنَا لَا تُزِغۡ ..... بَعۡدَ إِذۡ هَدَيۡتَنَا وَهَبۡ لَنَا مِن لَّدُنكَ رَحۡمَةًۚ إِنَّكَ أَنتَ ٱلۡوَهَّابُ",
    "options": [
      '	قُلُوبَنَا',
      '	أَجسَادَنا',
    ],
    "answer_index":0 ,
  },
  {
    "id": 10,
    "question": "زُيِّنَ ..... حُبُّ ٱلشَّهَوَٰتِ مِنَ ٱلنِّسَآءِ وَٱلۡبَنِينَ وَٱلۡقَنَٰطِيرِ ٱلۡمُقَنطَرَةِ مِنَ ٱلذَّهَبِ وَٱلۡفِضَّةِ وَٱلۡخَيۡلِ ٱلۡمُسَوَّمَةِ وَٱلۡأَنۡعَٰمِ وَٱلۡحَرۡثِۗ ذَٰلِكَ مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱللَّهُ عِندَهُۥ حُسۡنُ ٱلۡمَـَٔابِ",
    "options": [
      '	للرِجَالِ',
      '	لِلنَّاسِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "(زُيِّنَ ..... حُبُّ ٱلشَّهَوَٰتِ مِنَ ٱلنِّسَآءِ وَٱلۡبَنِينَ وَٱلۡقَنَٰطِيرِ ٱلۡمُقَنطَرَةِ مِنَ ٱلذَّهَبِ وَٱلۡفِضَّةِ وَٱلۡخَيۡلِ ٱلۡمُسَوَّمَةِ وَٱلۡأَنۡعَٰمِ وَٱلۡحَرۡثِۗ ذَٰلِكَ مَتَٰعُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَاۖ وَٱللَّهُ عِندَهُۥ حُسۡنُ ٱلۡمَـَٔابِ)\nما معنى ٱلۡقَنَٰطِيرِ ٱلۡمُقَنطَرَةِ",
    "options": [
      '	السدود من الحديد',
      '	الأموال الكثيرة من الذهب والفضة',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "إِذۡ قَالَتِ ..... رَبِّ إِنِّي نَذَرۡتُ لَكَ مَا فِي بَطۡنِي مُحَرَّرٗا فَتَقَبَّلۡ مِنِّيٓۖ إِنَّكَ أَنتَ ٱلسَّمِيعُ ٱلۡعَلِيمُ ",
    "options": [
      '	ٱمۡرَأَتُ عِمۡرَٰنَ',
      '	ٱمۡرَأَتُ فِرعونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "فَلَمَّآ أَحَسَّ عِيسَىٰ مِنۡهُمُ ٱلۡكُفۡرَ قَالَ مَنۡ أَنصَارِيٓ إِلَى ٱللَّهِۖ قَالَ ..... نَحۡنُ أَنصَارُ ٱللَّهِ ءَامَنَّا بِٱللَّهِ وَٱشۡهَدۡ بِأَنَّا مُسۡلِمُونَ",
    "options": [
      '	ٱلۡحَوَارِيُّونَ',
      '	اليَهُودَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "وَمِنۡ أَهۡلِ ٱلۡكِتَٰبِ مَنۡ إِن تَأۡمَنۡهُ ..... يُؤَدِّهِۦٓ إِلَيۡكَ وَمِنۡهُم مَّنۡ إِن تَأۡمَنۡهُ .... لَّا يُؤَدِّهِۦٓ إِلَيۡكَ إِلَّا مَا دُمۡتَ عَلَيۡهِ قَآئِمٗاۗ ذَٰلِكَ بِأَنَّهُمۡ قَالُواْ لَيۡسَ عَلَيۡنَا فِي ٱلۡأُمِّيِّـۧنَ سَبِيلٞ وَيَقُولُونَ عَلَى ٱللَّهِ ٱلۡكَذِبَ وَهُمۡ يَعۡلَمُونَ",
    "options": [
      '	بِدِينَارٖ، بِقِنطَارٖ',
      '	بِقِنطَارٖ، بِدِينَارٖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "إِنَّ ٱلَّذِينَ كَفَرُواْ وَمَاتُواْ وَهُمۡ كُفَّارٞ فَلَن يُقۡبَلَ مِنۡ أَحَدِهِم مِّلۡءُ ٱلۡأَرۡضِ ..... وَلَوِ ٱفۡتَدَىٰ بِهِۦٓۗ أُوْلَٰٓئِكَ لَهُمۡ عَذَابٌ أَلِيمٞ وَمَا لَهُم مِّن نَّٰصِرِينَ",
    "options": [
      '	ذَهَبٗا',
      '	أَلمَاسًا',
    ],
    "answer_index": 0,
  },
];





const List partFour =
[
  {
    "id": 1,
    "question": "لَن تَنَالُواْ ...... حَتَّىٰ تُنفِقُواْ مِمَّا تُحِبُّونَۚ وَمَا تُنفِقُواْ مِن شَيۡءٖ فَإِنَّ ٱللَّهَ بِهِۦ عَلِيمٞ",
    "options": [
      'ٱلۡبِرَّ',
      '	الإِيمَانَّ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "وَأَمَّا ٱلَّذِينَ ..... وُجُوهُهُمۡ فَفِي رَحۡمَةِ ٱللَّهِۖ هُمۡ فِيهَا خَٰلِدُونَ",
    "options": [
      '	اسْوَدَّت',
      '	ٱبۡيَضَّتۡ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "كُنتُمۡ خَيۡرَ ..... أُخۡرِجَتۡ لِلنَّاسِ تَأۡمُرُونَ بِٱلۡمَعۡرُوفِ وَتَنۡهَوۡنَ عَنِ ٱلۡمُنكَرِ وَتُؤۡمِنُونَ بِٱللَّهِۗ",
    "options": [
      '	قَومٍ',
      '	أُمَّةٍ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "(مَثَلُ مَا يُنفِقُونَ فِي هَٰذِهِ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا كَمَثَلِ رِيحٖ فِيهَا صِرٌّ أَصَابَتۡ حَرۡثَ قَوۡمٖ ظَلَمُوٓاْ أَنفُسَهُمۡ فَأَهۡلَكَتۡهُۚ وَمَا ظَلَمَهُمُ ٱللَّهُ وَلَٰكِنۡ أَنفُسَهُمۡ يَظۡلِمُونَ) معنى صر",
    "options": [
      '	برد شديد',
      '	ريح ومطر',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "وَلَقَدۡ نَصَرَكُمُ ٱللَّهُ ..... وَأَنتُمۡ أَذِلَّةٞۖ فَٱتَّقُواْ ٱللَّهَ لَعَلَّكُمۡ تَشۡكُرُونَ",
    "options": [
      '	بِبَدۡرٖ',
      '	بِحُنَين',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "(وَلَقَدۡ صَدَقَكُمُ ٱللَّهُ وَعۡدَهُۥٓ إِذۡ تَحُسُّونَهُم بِإِذۡنِهِۦۖ حَتَّىٰٓ إِذَا فَشِلۡتُمۡ وَتَنَٰزَعۡتُمۡ فِي ٱلۡأَمۡرِ وَعَصَيۡتُم مِّنۢ بَعۡدِ مَآ أَرَىٰكُم مَّا تُحِبُّونَۚ مِنكُم مَّن يُرِيدُ ٱلدُّنۡيَا وَمِنكُم مَّن يُرِيدُ ٱلۡأٓخِرَةَۚ ثُمَّ صَرَفَكُمۡ عَنۡهُمۡ لِيَبۡتَلِيَكُمۡۖ وَلَقَدۡ عَفَا عَنكُمۡۗ وَٱللَّهُ ذُو فَضۡلٍ عَلَى ٱلۡمُؤۡمِنِينَ) معنى تَحُسُّونَهُم...",
    "options": [
      'تُكرموهم',
      '	تقتلونهم',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "فَبِمَا رَحۡمَةٖ مِّنَ ٱللَّهِ لِنتَ لَهُمۡۖ وَلَوۡ كُنتَ فَظًّا ..... ٱلۡقَلۡبِ لَٱنفَضُّواْ مِنۡ حَوۡلِكَۖ",
    "options": [
      '	لَينَ',
      'غَلِيظَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " (ٱلَّذِينَ ٱسۡتَجَابُواْ لِلَّهِ وَٱلرَّسُولِ مِنۢ بَعۡدِ مَآ أَصَابَهُمُ ٱلۡقَرۡحُۚ لِلَّذِينَ أَحۡسَنُواْ مِنۡهُمۡ وَٱتَّقَوۡاْ أَجۡرٌ عَظِيمٌ) معنى القرح...",
    "options": [
      '	الألم والجراح',
      'الثراء والغنى',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "لَّقَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ ..... وَنَحۡنُ أَغۡنِيَآءُۘ سَنَكۡتُبُ مَا قَالُواْ وَقَتۡلَهُمُ ٱلۡأَنۢبِيَآءَ بِغَيۡرِ حَقّٖ وَنَقُولُ ذُوقُواْ عَذَابَ ٱلۡحَرِيقِ",
    "options": [
      'كَريمٌ',
      '	فَقِيرٌ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "كُلُّ نَفۡسٖ ذَآئِقَةُ ٱلۡمَوۡتِۗ وَإِنَّمَا تُوَفَّوۡنَ أُجُورَكُمۡ يَوۡمَ ٱلۡقِيَٰمَةِۖ فَمَن زُحۡزِحَ عَنِ ٱلنَّارِ وَأُدۡخِلَ ٱلۡجَنَّةَ فَقَدۡ فَازَۗ .... ",
    "options": [
      '	وَمَا ٱلۡحَيَوٰةُ ٱلدُّنۡيَآ إِلَّا مَتَٰعُ ٱلۡغُرُورِ',
      '	فَوزاً عَظِيماً',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "فَٱسۡتَجَابَ لَهُمۡ رَبُّهُمۡ أَنِّي لَآ أُضِيعُ ..... عَٰمِلٖ مِّنكُم مِّن ذَكَرٍ أَوۡ أُنثَىٰۖ",
    "options": [
      '	أَجرَ',
      '	عَمَلَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "(وَءَاتُواْ ٱلۡيَتَٰمَىٰٓ أَمۡوَٰلَهُمۡۖ وَلَا تَتَبَدَّلُواْ ٱلۡخَبِيثَ بِٱلطَّيِّبِۖ وَلَا تَأۡكُلُوٓاْ أَمۡوَٰلَهُمۡ إِلَىٰٓ أَمۡوَٰلِكُمۡۚ إِنَّهُۥ كَانَ حُوبٗا كَبِيرٗا ) معنى حوباً",
    "options": [
      '	إثماً وذنباً',
      'ثواب وهدية',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "وَلۡيَخۡشَ ٱلَّذِينَ لَوۡ تَرَكُواْ مِنۡ خَلۡفِهِمۡ ذُرِّيَّةٗ ضِعَٰفًا خَافُواْ عَلَيۡهِمۡ فَلۡيَتَّقُواْ ٱللَّهَ وَلۡيَقُولُواْ .....",
    "options": [
      '	قَوۡلٗا مَعرُوفاً',
      '	قَوۡلٗا سَدِيدًا',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "(وَإِن كَانَ رَجُلٞ يُورَثُ كَلَٰلَةً أَوِ ٱمۡرَأَةٞ وَلَهُۥٓ أَخٌ أَوۡ أُخۡتٞ فَلِكُلِّ وَٰحِدٖ مِّنۡهُمَا ٱلسُّدُسُۚ فَإِن كَانُوٓاْ أَكۡثَرَ مِن ذَٰلِكَ فَهُمۡ شُرَكَآءُ فِي ٱلثُّلُثِۚ مِنۢ بَعۡدِ وَصِيَّةٖ يُوصَىٰ بِهَآ أَوۡ دَيۡنٍ غَيۡرَ مُضَآرّٖۚ وَصِيَّةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَلِيمٞ ) معنى كَلَٰلَةً",
    "options": [
      '	من ليس له ولد ولا والد',
      '	من له أولاد كثر',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا يَحِلُّ لَكُمۡ أَن تَرِثُواْ ٱلنِّسَآءَ كَرۡهٗاۖ وَلَا تَعۡضُلُوهُنَّ لِتَذۡهَبُواْ بِبَعۡضِ مَآ ءَاتَيۡتُمُوهُنَّ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ وَعَاشِرُوهُنَّ بِٱلۡمَعۡرُوفِۚ فَإِن كَرِهۡتُمُوهُنَّ فَعَسَىٰٓ أَن تَكۡرَهُواْ شَيۡـٔٗا .....",
    "options": [
      '	وَهوَ خيرٌ لَكُم',
      '	وَيَجۡعَلَ ٱللَّهُ فِيهِ خَيۡرٗا كَثِيرٗا',
    ],
    "answer_index": 1,
  },
];






const List partFive =
[
  {
    "id": 1,
    "question": "يُرِيدُ ٱللَّهُ أَن يُخَفِّفَ عَنكُمۡۚ وَخُلِقَ ٱلۡإِنسَٰنُ.... ",
    "options": [
      '	ضَعِيفٗا',
      '	قَوياً',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقۡرَبُواْ ٱلصَّلَوٰةَ وَأَنتُمۡ .... حَتَّىٰ تَعۡلَمُواْ مَا تَقُولُونَ وَلَا ....",
    "options": [
      'جُنُبًا',
      'سُكَٰرَىٰ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "إِنَّ ٱللَّهَ لَا يَغۡفِرُ أَن ..... بِهِۦ وَيَغۡفِرُ مَا دُونَ ذَٰلِكَ لِمَن يَشَآءُۚ وَمَن يُشۡرِكۡ بِٱللَّهِ فَقَدِ ٱفۡتَرَىٰٓ إِثۡمًا عَظِيمًا",
    "options": [
      '	يُكفَرَ',
      '	يُشۡرَكَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "أَيۡنَمَا تَكُونُواْ يُدۡرِككُّمُ ..... وَلَوۡ كُنتُمۡ فِي بُرُوجٖ مُّشَيَّدَةٖۗ",
    "options": [
      '	ٱلۡمَوۡتُ',
      '	القَتلُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "(فَقَٰتِلۡ فِي سَبِيلِ ٱللَّهِ لَا تُكَلَّفُ إِلَّا نَفۡسَكَۚ وَحَرِّضِ ٱلۡمُؤۡمِنِينَۖ عَسَى ٱللَّهُ أَن يَكُفَّ بَأۡسَ ٱلَّذِينَ كَفَرُواْۚ وَٱللَّهُ أَشَدُّ بَأۡسٗا وَأَشَدُّ تَنكِيلٗا ) معنى تنكيلاً....",
    "options": [
      '	عقوبة',
      '	مغفرة وعفو',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "وَإِذَا حُيِّيتُم بِتَحِيَّةٖ فَحَيُّواْ .... مِنۡهَآ أَوۡ رُدُّوهَآۗ إِنَّ ٱللَّهَ كَانَ عَلَىٰ كُلِّ شَيۡءٍ حَسِيبًا",
    "options": [
      '	بِأَفضلَ',
      '	بِأَحۡسَنَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "(فَمَا لَكُمۡ فِي ٱلۡمُنَٰفِقِينَ فِئَتَيۡنِ وَٱللَّهُ أَرۡكَسَهُم بِمَا كَسَبُوٓاْۚ أَتُرِيدُونَ أَن تَهۡدُواْ مَنۡ أَضَلَّ ٱللَّهُۖ وَمَن يُضۡلِلِ ٱللَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلٗا ) معنى أركسهم",
    "options": [
      '	أوقعهم وردَّهم',
      '	أكرمهم',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "وَمَن يَقۡتُلۡ مُؤۡمِنٗا ..... فَجَزَآؤُهُۥ جَهَنَّمُ خَٰلِدٗا فِيهَا وَغَضِبَ ٱللَّهُ عَلَيۡهِ وَلَعَنَهُۥ وَأَعَدَّ لَهُۥ عَذَابًا عَظِيماً",
    "options": [
      '	خَطئًا',
      '	مُّتَعَمِّدٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "فَإِذَا قَضَيۡتُمُ ٱلصَّلَوٰةَ فَٱذۡكُرُواْ ٱللَّهَ قِيَٰمٗا وَقُعُودٗا وَعَلَىٰ جُنُوبِكُمۡۚ فَإِذَا ٱطۡمَأۡنَنتُمۡ فَأَقِيمُواْ ٱلصَّلَوٰةَۚ إِنَّ ٱلصَّلَوٰةَ ......",
    "options": [
      '	تَنهَىٰ عن الفَحْشَاءِ والمُنكر',
      '	كَانَتۡ عَلَى ٱلۡمُؤۡمِنِينَ كِتَٰبٗا مَّوۡقُوتٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "وَٱلَّذِينَ ءَامَنُواْ وَعَمِلُواْ ٱلصَّٰلِحَٰتِ سَنُدۡخِلُهُمۡ جَنَّٰتٖ تَجۡرِي مِن تَحۡتِهَا ٱلۡأَنۡهَٰرُ خَٰلِدِينَ فِيهَآ أَبَدٗاۖ وَعۡدَ ٱللَّهِ حَقّٗاۚ وَمَنۡ أَصۡدَقُ مِنَ ٱللَّهِ .....",
    "options": [
      '	قِيلٗا',
      '	عَمَلاً',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "وَإنِ ٱمۡرَأَةٌ خَافَتۡ مِنۢ ..... نُشُوزًا أَوۡ إِعۡرَاضٗا فَلَا جُنَاحَ عَلَيۡهِمَآ أَن يُصۡلِحَا بَيۡنَهُمَا صُلۡحٗاۚ",
    "options": [
      '	بَعۡلِهَا',
      '	زَوجِهَا',
    ],
    "answer_index": 0 ,
  },
];





const List partSix =
[
//
  {
    "id": 1,
    "question": "وَقَوۡلِهِمۡ إِنَّا قَتَلۡنَا ٱلۡمَسِيحَ عِيسَى ٱبۡنَ مَرۡيَمَ رَسُولَ ٱللَّهِ وَمَا قَتَلُوهُ وَمَا ..... وَلَٰكِن شُبِّهَ لَهُمۡۚ",
    "options": [
      '	عَلَّقُوه',
      '	صَلَبُوهُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ..... وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ ",
    "options": [
      '	ٱلسَّبُعِ',
      '	ٱلۡخِنزِيرِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "(حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ..... وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ )\n  ما معنى وَٱلۡمَوۡقُوذَةُ",
    "options": [
      '	التي ضربتها بأخرى بقرنها فماتت',
      '	التي ضُربت بعصا أو بحجر فماتت',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "(حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ..... وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَة)\n ما معنى ٱلۡمُتَرَدِّيَةُ",
    "options": [
      '	التي سقطت من مكان عالٍ فماتت',
      '	التي حبس نفسها حتى ماتت',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "لَّا يُحِبُّ ٱللَّهُ ٱلۡجَهۡرَ .... مِنَ ٱلۡقَوۡلِ إِلَّا مَن ظُلِمَۚ وَكَانَ ٱللَّهُ سَمِيعًا عَلِيمًا",
    "options": [
      '	بِٱلسُّوٓءِ',
      '	بِالمَعصِيةِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "لَّقَدۡ ..... ٱلَّذِينَ قَالُوٓاْ إِنَّ ٱللَّهَ هُوَ ٱلۡمَسِيحُ ٱبۡنُ مَرۡيَمَۚ",
    "options": [
      '	أَشركَ',
      '	كَفَرَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "يَٰقَوۡمِ ٱدۡخُلُواْ ٱلۡأَرۡضَ ...... ٱلَّتِي كَتَبَ ٱللَّهُ لَكُمۡ وَلَا تَرۡتَدُّواْ عَلَىٰٓ أَدۡبَارِكُمۡ فَتَنقَلِبُواْ خَٰسِرِينَ",
    "options": [
      '	ٱلۡمُقَدَّسَةَ',
      '	الجَميلةَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "قَالُواْ يَٰمُوسَىٰٓ إِنَّ فِيهَا قَوۡمٗا ......وَإِنَّا لَن نَّدۡخُلَهَا حَتَّىٰ يَخۡرُجُواْ مِنۡهَا فَإِن يَخۡرُجُواْ مِنۡهَا فَإِنَّا دَٰخِلُونَ",
    "options": [
      '	جَبَّارِينَ',
      '	ظَالمِينَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "وَٱتۡلُ عَلَيۡهِمۡ نَبَأَ ٱبۡنَيۡ ..... بِٱلۡحَقِّ إِذۡ قَرَّبَا قُرۡبَانٗا فَتُقُبِّلَ مِنۡ أَحَدِهِمَا وَلَمۡ يُتَقَبَّلۡ مِنَ ٱلۡأٓخَرِ قَالَ لَأَقۡتُلَنَّكَۖ قَالَ إِنَّمَا يَتَقَبَّلُ ٱللَّهُ مِنَ ٱلۡمُتَّقِينَ",
    "options": [
      '	نُوحَ',
      '	ءَادَمَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "فَبَعَثَ ٱللَّهُ ..... يَبۡحَثُ فِي ٱلۡأَرۡضِ لِيُرِيَهُۥ كَيۡفَ يُوَٰرِي سَوۡءَةَ أَخِيهِۚ",
    "options": [
      '	غُرَابٗا',
      '	هُدهُدَاً',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "مِنۡ أَجۡلِ ذَٰلِكَ كَتَبۡنَا عَلَىٰ بَنِيٓ إِسۡرَٰٓءِيلَ أَنَّهُۥ مَن قَتَلَ نَفۡسَۢا بِغَيۡرِ نَفۡسٍ أَوۡ فَسَادٖ فِي ٱلۡأَرۡضِ فَكَأَنَّمَا قَتَلَ ..... جَمِيعٗا وَمَنۡ أَحۡيَاهَا فَكَأَنَّمَآ أَحۡيَا ٱلنَّاسَ جَمِيعٗاۚ",
    "options": [
      '	الأمَةَ',
      '	ٱلنَّاسَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "وَٱلسَّارِقُ وَٱلسَّارِقَةُ .... أَيۡدِيَهُمَا جَزَآءَۢ بِمَا كَسَبَا نَكَٰلٗا مِّنَ ٱللَّهِۗ وَٱللَّهُ عَزِيزٌ حَكِيمٞ",
    "options": [
      '	فَٱقۡطَعُوٓاْ',
      '	فَاربطُوا',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": " (إِنَّآ أَنزَلۡنَا ٱلتَّوۡرَىٰةَ فِيهَا هُدٗى وَنُورٞۚ يَحۡكُمُ بِهَا ٱلنَّبِيُّونَ ٱلَّذِينَ أَسۡلَمُواْ لِلَّذِينَ هَادُواْ وَٱلرَّبَّٰنِيُّونَ وَٱلۡأَحۡبَارُ بِمَا ٱسۡتُحۡفِظُواْ مِن كِتَٰبِ ٱللَّهِ وَكَانُواْ عَلَيۡهِ شُهَدَآءَۚ) من هم الأحبار...",
    "options": [
      '	علماء النصارى',
      '	علماء اليهود',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "وَقَالَتِ ...... يَدُ ٱللَّهِ مَغۡلُولَةٌۚ غُلَّتۡ أَيۡدِيهِمۡ وَلُعِنُواْ بِمَا قَالُواْۘ بَلۡ يَدَاهُ مَبۡسُوطَتَانِ يُنفِقُ كَيۡفَ يَشَآءُۚ",
    "options": [
      '	ٱلۡيَهُودُ',
      '	النَصَارىٰ',
    ],
    "answer_index": 0,
  },
 {
  "id": 15,
  "question": "(لَّن يَسۡتَنكِفَ ٱلۡمَسِيحُ أَن يَكُونَ عَبۡدٗا لِّلَّهِ وَلَا ٱلۡمَلَٰٓئِكَةُ ٱلۡمُقَرَّبُونَۚ وَمَن يَسۡتَنكِفۡ عَنۡ عِبَادَتِهِۦ وَيَسۡتَكۡبِرۡ فَسَيَحۡشُرُهُمۡ إِلَيۡهِ جَمِيعٗا ) ، معنى يَسۡتَنكِفَ......",
  "options": [
    'يتكبر',
    'يتواضع',
  ],
  "answer_index": 0,
},
{
  "id": 16,
  "question": "(حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيۡتُمۡ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسۡتَقۡسِمُواْ بِٱلۡأَزۡلَٰمِۚ ذَٰلِكُمۡ فِسۡقٌۗ ٱلۡيَوۡمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِۚ ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ فَمَنِ ٱضۡطُرَّ فِي مَخۡمَصَةٍ غَيۡرَ مُتَجَانِفٖ لِّإِثۡمٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ) ، معنى ٱلۡمَوۡقُوذَةُ",
  "options": [
    'الميتةُ بالخنق',
    'الميتةُ بالضرب',
  ],
  "answer_index": 1,
},
{
  "id": 17,
  "question": "(حُرِّمَتۡ عَلَيۡكُمُ ٱلۡمَيۡتَةُ وَٱلدَّمُ وَلَحۡمُ ٱلۡخِنزِيرِ وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦ وَٱلۡمُنۡخَنِقَةُ وَٱلۡمَوۡقُوذَةُ وَٱلۡمُتَرَدِّيَةُ وَٱلنَّطِيحَةُ وَمَآ أَكَلَ ٱلسَّبُعُ إِلَّا مَا ذَكَّيۡتُمۡ وَمَا ذُبِحَ عَلَى ٱلنُّصُبِ وَأَن تَسۡتَقۡسِمُواْ بِٱلۡأَزۡلَٰمِۚ ذَٰلِكُمۡ فِسۡقٌۗ ٱلۡيَوۡمَ يَئِسَ ٱلَّذِينَ كَفَرُواْ مِن دِينِكُمۡ فَلَا تَخۡشَوۡهُمۡ وَٱخۡشَوۡنِۚ ٱلۡيَوۡمَ أَكۡمَلۡتُ لَكُمۡ دِينَكُمۡ وَأَتۡمَمۡتُ عَلَيۡكُمۡ نِعۡمَتِي وَرَضِيتُ لَكُمُ ٱلۡإِسۡلَٰمَ دِينٗاۚ فَمَنِ ٱضۡطُرَّ فِي مَخۡمَصَةٍ غَيۡرَ مُتَجَانِفٖ لِّإِثۡمٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ) ، ما معنى (ٱلۡمُتَرَدِّيَةُ)ُ",
  "options": [
    'الميتةُ بالنطح',
    'الميتةُ بالسقوط من علو',
  ],
  "answer_index": 1,
},
{
  "id": 18,
  "question": "اكمل من قوله تعالى (قَالَ فَإِنَّهَا مُحَرَّمَةٌ عَلَيۡهِمۡۛ........ سَنَةٗۛ يَتِيهُونَ فِي ٱلۡأَرۡضِۚ فَلَا تَأۡسَ عَلَى ٱلۡقَوۡمِ ٱلۡفَٰسِقِينَ)",
  "options": [
    'أَرۡبَعِينَ',
    'خَمْسِينَ',
  ],
  "answer_index": 0,
},
{
  "id": 19,
  "question": "اكمل من قوله تعالى (فَبَعَثَ ٱللَّهُ........يَبۡحَثُ فِي ٱلۡأَرۡضِ لِيُرِيَهُۥ كَيۡفَ يُوَٰرِي سَوۡءَةَ أَخِيهِۚ قَالَ يَٰوَيۡلَتَىٰٓ أَعَجَزۡتُ أَنۡ أَكُونَ مِثۡلَ هَٰذَا ٱلۡغُرَابِ فَأُوَٰرِيَ سَوۡءَةَ أَخِيۖ فَأَصۡبَحَ مِنَ ٱلنَّٰدِمِينَ)",
  "options": [
    'طَائِرًا',
    'غُرَابٗا',
  ],
  "answer_index": 1,
},

];





const List partSeven =
[
  {
    "id": 1,
    "question": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡخَمۡرُ وَٱلۡمَيۡسِرُ وَٱلۡأَنصَابُ وَٱلۡأَزۡلَٰمُ رِجۡسٞ مِّنۡ عَمَلِ ٱلشَّيۡطَٰنِ ...... لَعَلَّكُمۡ تُفۡلِحُونَ",
    "options": [
      '	فَٱجۡتَنِبُوهُ',
      '	فأَتوهُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَقۡتُلُواْ ٱلصَّيۡدَ وَأَنتُمۡ حُرُمٞۚ وَمَن قَتَلَهُۥ مِنكُم ..... فَجَزَآءٞ مِّثۡلُ مَا قَتَلَ مِنَ ٱلنَّعَمِ",
    "options": [
      'خَطئًا',
      '	مُّتَعَمِّدٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "....... صَيۡدُ ٱلۡبَحۡرِ وَطَعَامُهُۥ مَتَٰعٗا لَّكُمۡ وَلِلسَّيَّارَةِۖ ..... صَيۡدُ ٱلۡبَرِّ مَا دُمۡتُمۡ حُرُمٗاۗ وَٱتَّقُواْ ٱللَّهَ ٱلَّذِيٓ إِلَيۡهِ تُحۡشَرُونَ",
    "options": [
      'أُحِلَّ لَكُمۡ، وَحُرِّمَ عَلَيۡكُمۡ',
      '	حُرِّمَ عَلَيۡكُمۡ، وَ أُحِلَّ لَكُمۡ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "جَعَلَ ٱللَّهُ .... ٱلۡبَيۡتَ ٱلۡحَرَامَ قِيَٰمٗا لِّلنَّاسِ",
    "options": [
      '	القُدسَ',
      'ٱلۡكَعۡبَةَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "(إِذۡ قَالَ ٱللَّهُ يَٰعِيسَى ٱبۡنَ مَرۡيَمَ ٱذۡكُرۡ نِعۡمَتِي عَلَيۡكَ وَعَلَىٰ وَٰلِدَتِكَ إِذۡ أَيَّدتُّكَ بِرُوحِ ٱلۡقُدُسِ تُكَلِّمُ ٱلنَّاسَ فِي ٱلۡمَهۡدِ وَكَهۡلٗاۖ) من هو روح القدس....",
    "options": [
      '	جبريل عليه السلام',
      'ملك الموت',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من قائل هذه الآية (ٱللَّهُمَّ رَبَّنَآ أَنزِلۡ عَلَيۡنَا مَآئِدَةٗ مِّنَ ٱلسَّمَآءِ تَكُونُ لَنَا عِيدٗا لِّأَوَّلِنَا وَءَاخِرِنَا وَءَايَةٗ مِّنكَۖ وَٱرۡزُقۡنَا وَأَنتَ خَيۡرُ ٱلرَّٰزِقِينَ)",
    "options": [
      '	موسى عليه السلام',
      '	عيسى عليه السلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "قُلۡ إِنِّيٓ أَخَافُ إِنۡ ..... رَبِّي عَذَابَ يَوۡمٍ عَظِيمٖ",
    "options": [
      '	عَصَيۡتُ',
      '	أَطَعتُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "(وَهُمۡ يَنۡهَوۡنَ عَنۡهُ وَيَنۡـَٔوۡنَ عَنۡهُۖ وَإِن يُهۡلِكُونَ إِلَّآ أَنفُسَهُمۡ وَمَا يَشۡعُرُونَ) معنى ينأون",
    "options": [
      'يبتعدون',
      '	يقتربون',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "وَإِذَا رَأَيۡتَ ٱلَّذِينَ يَخُوضُونَ فِيٓ ءَايَٰتِنَا ..... عَنۡهُمۡ حَتَّىٰ يَخُوضُواْ فِي حَدِيثٍ غَيۡرِهِۦۚ وَإِمَّا يُنسِيَنَّكَ ٱلشَّيۡطَٰنُ فَلَا تَقۡعُدۡ بَعۡدَ ٱلذِّكۡرَىٰ مَعَ ٱلۡقَوۡمِ ٱلظَّٰلِمِينَ",
    "options": [
      '	فَانصرِفْ',
      '	فَأَعۡرِضۡ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "وَإِذۡ قَالَ ..... لِأَبِيهِ ءَازَرَ أَتَتَّخِذُ أَصۡنَامًا ءَالِهَةً إِنِّيٓ أَرَىٰكَ وَقَوۡمَكَ فِي ضَلَٰلٖ مُّبِينٖ",
    "options": [
      'إِبۡرَٰهِيمُ',
      'نُوح',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "فَلَمَّا جَنَّ عَلَيۡهِ ٱلَّيۡلُ رَءَا ..... قَالَ هَٰذَا رَبِّيۖ فَلَمَّآ أَفَلَ قَالَ لَآ أُحِبُّ ٱلۡأٓفِلِينَ",
    "options": [
      'كَوۡكَبٗاۖ',
      'نِجمَاً',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "إِنِّي .... وَجۡهِيَ لِلَّذِي فَطَرَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ حَنِيفٗاۖ وَمَآ أَنَا۠ مِنَ ٱلۡمُشۡرِكِينَ",
    "options": [
      'أدَرتُ',
      'وَجَّهۡتُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "وَلَقَدۡ جِئۡتُمُونَا .... كَمَا خَلَقۡنَٰكُمۡ أَوَّلَ مَرَّةٖ وَتَرَكۡتُم مَّا خَوَّلۡنَٰكُمۡ وَرَآءَ ظُهُورِكُمۡۖ",
    "options": [
      'جَمْعَاً',
      'فُرَٰدَىٰ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ ..... لِتَهۡتَدُواْ بِهَا فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ",
    "options": [
      'ٱلنُّجُومَ',
      'الأَقمَارَ',
    ],
    "answer_index": 0,
  },
 {
  "id": 15,
  "question": "اكمل من قوله تعالى(لَتَجِدَنَّ أَشَدَّ ٱلنَّاسِ عَدَٰوَةٗ لِّلَّذِينَ ءَامَنُواْ........وَٱلَّذِينَ أَشۡرَكُواْۖ وَلَتَجِدَنَّ أَقۡرَبَهُم مَّوَدَّةٗ لِّلَّذِينَ ءَامَنُواْ ٱلَّذِينَ قَالُوٓاْ إِنَّا.......ذَٰلِكَ بِأَنَّ مِنۡهُمۡ قِسِّيسِينَ وَرُهۡبَانٗا وَأَنَّهُمۡ لَا يَسۡتَكۡبِرُونَ)",
  "options": [
    'ٱلۡيَهُودَ ، نَصَٰرَىٰۚ',
    'النَصَٰرَىٰۚ ، يَهُودًا',
  ],
  "answer_index": 0,
},
{
  "id": 16,
  "question": "(وَتُبۡرِئُ ٱلۡأَكۡمَهَ وَٱلۡأَبۡرَصَ بِإِذۡنِيۖ وَإِذۡ تُخۡرِجُ ٱلۡمَوۡتَىٰ بِإِذۡنِيۖ وَإِذۡ كَفَفۡتُ بَنِيٓ إِسۡرَٰٓءِيلَ عَنكَ إِذۡ جِئۡتَهُم بِٱلۡبَيِّنَٰتِ فَقَالَ ٱلَّذِينَ كَفَرُواْ مِنۡهُمۡ إِنۡ هَٰذَآ إِلَّا سِحۡرٞ مُّبِينٞ ) ، معنى ٱلۡأَكۡمَهَ......",
  "options": [
    'الأعمى',
    'الفاقد للنطق والسمع',
  ],
  "answer_index": 0,
},
{
  "id": 17,
  "question": "اكمل من قوله تعالى (إِنَّ ٱللَّهَ فَالِقُ ٱلۡحَبِّ وَٱلنَّوَىٰۖ يُخۡرِجُ........وَمُخۡرِجُ.......ذَٰلِكُمُ ٱللَّهُۖ فَأَنَّىٰ تُؤۡفَكُونَ )",
  "options": [
    'ٱلۡمَيِّتِ مِنَ ٱلۡحَيِّۚ ، ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ',
    'ٱلۡحَيَّ مِنَ ٱلۡمَيِّتِ ، ٱلۡمَيِّتِ مِنَ ٱلۡحَيِّۚ',
  ],
  "answer_index": 1,
},
{
  "id": 18,
  "question": "اكمل من قوله تعالى (وَهُوَ ٱلَّذِي جَعَلَ لَكُمُ........لِتَهۡتَدُواْ بِهَا فِي ظُلُمَٰتِ ٱلۡبَرِّ وَٱلۡبَحۡرِۗ قَدۡ فَصَّلۡنَا ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ)",
  "options": [
    'ٱلنُّجُومَ',
    'القَمْرَ',
  ],
  "answer_index": 0,
},
{
  "id": 19,
  "question": "(وَهُوَ ٱلَّذِيٓ أَنزَلَ مِنَ ٱلسَّمَآءِ مَآءٗ فَأَخۡرَجۡنَا بِهِۦ نَبَاتَ كُلِّ شَيۡءٖ فَأَخۡرَجۡنَا مِنۡهُ خَضِرٗا نُّخۡرِجُ مِنۡهُ حَبّٗا مُّتَرَاكِبٗا وَمِنَ ٱلنَّخۡلِ مِن طَلۡعِهَا قِنۡوَانٞ دَانِيَةٞ وَجَنَّٰتٖ مِّنۡ أَعۡنَابٖ وَٱلزَّيۡتُونَ وَٱلرُّمَّانَ مُشۡتَبِهٗا وَغَيۡرَ مُتَشَٰبِهٍۗ ٱنظُرُوٓاْ إِلَىٰ ثَمَرِهِۦٓ إِذَآ أَثۡمَرَ وَيَنۡعِهِۦٓۚ إِنَّ فِي ذَٰلِكُمۡ لَأٓيَٰتٖ لِّقَوۡمٖ يُؤۡمِنُونَ) ، معنى قِنۡوَانٞ دَانِيَةٞ",
  "options": [
    'عراجين قريبة من الأرض',
    'عراجين بعيدة عن الأرض',
  ],
  "answer_index": 0,
},
];





const List partEight =
[
  {
    "id": 1,
    "question": "وَكَذَٰلِكَ جَعَلۡنَا لِكُلِّ نَبِيٍّ ..... شَيَٰطِينَ ٱلۡإِنسِ وَٱلۡجِنِّ يُوحِي بَعۡضُهُمۡ إِلَىٰ بَعۡضٖ زُخۡرُفَ ٱلۡقَوۡلِ غُرُورٗاۚ وَلَوۡ شَآءَ رَبُّكَ مَا فَعَلُوهُۖ فَذَرۡهُمۡ وَمَا يَفۡتَرُونَ",
    "options": [
      'عَدُوّٗا',
      '	صَديقًا',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "وَكَذَٰلِكَ جَعَلۡنَا فِي كُلِّ .... أَكَٰبِرَ مُجۡرِمِيهَا لِيَمۡكُرُواْ فِيهَاۖ وَمَا يَمۡكُرُونَ إِلَّا بِأَنفُسِهِمۡ وَمَا يَشۡعُرُون",
    "options": [
      '	بَلَدٍ',
      '	قَرۡيَةٍ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "فَمَن يُرِدِ ٱللَّهُ أَن يَهۡدِيَهُۥ .... لِلۡإِسۡلَٰمِۖ ",
    "options": [
      'يَشۡرَحۡ صَدۡرَهُۥ',
      '	يَجۡعَلۡ صَدۡرَهُۥ ضَيِّقًا',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "وَقَالُواْ هَٰذِهِۦٓ أَنۡعَٰمٞ وَحَرۡثٌ حِجۡرٞ لَّا يَطۡعَمُهَآ إِلَّا مَن نَّشَآءُ بِزَعۡمِهِمۡ وَأَنۡعَٰمٌ حُرِّمَتۡ ...... وَأَنۡعَٰمٞ لَّا يَذۡكُرُونَ ٱسۡمَ ٱللَّهِ عَلَيۡهَا ٱفۡتِرَآءً عَلَيۡهِۚ سَيَجۡزِيهِم بِمَا كَانُواْ يَفۡتَرُونَ",
    "options": [
      'بُطونِهَا',
      '	ظُهُورُهَا',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "وَلَا تَقۡرَبُواْ مَالَ .... إِلَّا بِٱلَّتِي هِيَ أَحۡسَنُ حَتَّىٰ يَبۡلُغَ أَشُدَّهُۥۚ",
    "options": [
      '	ٱلۡيَتِيمِ',
      '	المَكلُومِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "قُلۡ إِنَّ .... وَنُسُكِي وَمَحۡيَايَ وَمَمَاتِي لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
    "options": [
      'صِيامِي',
      'صَلَاتِي',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "بما تبدأ سورة الأعراف",
    "options": [
      'الٓمٓصٓ',
      'الٓمٓ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "وَيَٰٓـَٔادَمُ ٱسۡكُنۡ أَنتَ وَزَوۡجُكَ ٱلۡجَنَّةَ فَكُلَا مِنۡ حَيۡثُ شِئۡتُمَا وَلَا تَقۡرَبَا هَٰذِهِ .... فَتَكُونَا مِنَ ٱلظَّٰلِمِينَ",
    "options": [
      '	النَّخلةَ',
      '	ٱلشَّجَرَةَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "وَنَادَىٰٓ أَصۡحَٰبُ .... أَصۡحَٰبَ ٱلۡجَنَّةِ أَنۡ أَفِيضُواْ عَلَيۡنَا مِنَ ٱلۡمَآءِ أَوۡ مِمَّا رَزَقَكُمُ ٱللَّهُۚ قَالُوٓاْ إِنَّ ٱللَّهَ حَرَّمَهُمَا عَلَى ٱلۡكَٰفِرِينَ",
    "options": [
      '	ٱلنَّارِ',
      '	الأَعرافِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "وَإِلَىٰ عَادٍ أَخَاهُمۡ ..... قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥٓۚ أَفَلَا تَتَّقُونَ",
    "options": [
      '	هُودٗاۚ',
      '	صَٰلِحٗاۚ',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "وَإِلَىٰ ثَمُودَ أَخَاهُمۡ .... قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ قَدۡ جَآءَتۡكُم بَيِّنَةٞ مِّن رَّبِّكُمۡۖ هَٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَايَةٗۖ",
    "options": [
      '	هُودٗاۚ',
      '	صَٰلِحٗاۚ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "فَعَقَرُواْ ..... وَعَتَوۡاْ عَنۡ أَمۡرِ رَبِّهِمۡ وَقَالُواْ يَٰصَٰلِحُ ٱئۡتِنَا بِمَا تَعِدُنَآ إِن كُنتَ مِنَ ٱلۡمُرۡسَلِينَ",
    "options": [
      '	البَقَّرةَ',
      '	ٱلنَّاقَةَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "..... إِذۡ قَالَ لِقَوۡمِهِۦٓ أَتَأۡتُونَ ٱلۡفَٰحِشَةَ مَا سَبَقَكُم بِهَا مِنۡ أَحَدٖ مِّنَ ٱلۡعَٰلَمِينَ",
    "options": [
      'وَإبرَهيمًا',
      'وَلُوطًا',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "وَإِلَىٰ مَدۡيَنَ أَخَاهُمۡ .... قَالَ يَٰقَوۡمِ ٱعۡبُدُواْ ٱللَّهَ مَا لَكُم مِّنۡ إِلَٰهٍ غَيۡرُهُۥۖ",
    "options": [
      'شُعَيۡبٗاۚ',
      'نُوحَاً',
    ],
    "answer_index": 0,
  },
 {
  "id": 15,
  "question": "(وَكَذَٰلِكَ جَعَلۡنَا لِكُلِّ نَبِيٍّ عَدُوّٗا شَيَٰطِينَ ٱلۡإِنسِ وَٱلۡجِنِّ يُوحِي بَعۡضُهُمۡ إِلَىٰ بَعۡضٖ زُخۡرُفَ ٱلۡقَوۡلِ غُرُورٗاۚ وَلَوۡ شَآءَ رَبُّكَ مَا فَعَلُوهُۖ فَذَرۡهُمۡ وَمَا يَفۡتَرُونَ ) معنى زُخۡرُفَ......",
  "options": [
    'حقيقه',
    'باطله المُموّه المزوّق',
  ],
  "answer_index": 1,
},
{
  "id": 16,
  "question": "بما ختمت هذه الآية قُلۡ يَٰقَوۡمِ ٱعۡمَلُواْ عَلَىٰ مَكَانَتِكُمۡ إِنِّي عَامِلٞۖ..........",
  "options": [
    'فَسَوْفَ تَعْلَمُونَ مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ',
    'فَسَوۡفَ تَعۡلَمُونَ مَن تَكُونُ لَهُۥ عَٰقِبَةُ ٱلدَّارِۚ إِنَّهُۥ لَا يُفۡلِحُ ٱلظَّٰلِمُونَ',
  ],
  "answer_index": 1,
},
{
  "id": 17,
  "question": "(أَوۡ تَقُولُواْ لَوۡ أَنَّآ أُنزِلَ عَلَيۡنَا ٱلۡكِتَٰبُ لَكُنَّآ أَهۡدَىٰ مِنۡهُمۡۚ فَقَدۡ جَآءَكُم بَيِّنَةٞ مِّن رَّبِّكُمۡ وَهُدٗى وَرَحۡمَةٞۚ فَمَنۡ أَظۡلَمُ مِمَّن كَذَّبَ بِ‍َٔايَٰتِ ٱللَّهِ وَصَدَفَ عَنۡهَاۗ سَنَجۡزِي ٱلَّذِينَ يَصۡدِفُونَ عَنۡ ءَايَٰتِنَا سُوٓءَ ٱلۡعَذَابِ بِمَا كَانُواْ يَصۡدِفُونَ) معنى صَدَفَ",
  "options": [
    'أعرض وصرف',
    'قتل',
  ],
  "answer_index": 0,
},
{
  "id": 18,
  "question": "ما الآية التالية لهذه الآية (قَالَ فَٱهۡبِطۡ مِنۡهَا فَمَا يَكُونُ لَكَ أَن تَتَكَبَّرَ فِيهَا فَٱخۡرُجۡ إِنَّكَ مِنَ ٱلصَّٰغِرِينَ)",
  "options": [
    'قَالَ أَنظِرۡنِيٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ',
    'قَالَ رَبِّ فَأَنظِرْنِي إِلَى يَوْمِ يُبْعَثُونَ',
  ],
  "answer_index": 0,
},
{
  "id": 19,
  "question": "(قَالَ ٱخۡرُجۡ مِنۡهَا مَذۡءُومٗا مَّدۡحُورٗاۖ لَّمَن تَبِعَكَ مِنۡهُمۡ لَأَمۡلَأَنَّ جَهَنَّمَ مِنكُمۡ أَجۡمَعِينَ) معنى مَّدۡحُورٗاۖ.....",
  "options": [
    'محقراً لعيناً',
    'مطروداً',
  ],
  "answer_index": 1,
},
];





const List partNine =
[
  {
    "id": 1,
    "question": "أَفَأَمِنُواْ مَكۡرَ ٱللَّهِۚ فَلَا يَأۡمَنُ مَكۡرَ ٱللَّهِ إِلَّا ٱلۡقَوۡمُ ..... ",
    "options": [
      'ٱلۡخَٰسِرُونَ',
      'الفَائِزونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "ثُمَّ بَعَثۡنَا مِنۢ بَعۡدِهِم مُّوسَىٰ بِـَٔايَٰتِنَآ إِلَىٰ .... وَمَلَإِيْهِۦ فَظَلَمُواْ بِهَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُفۡسِدِينَ",
    "options": [
      '	عَزيزَ مِصرَ',
      'فِرۡعَوۡنَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "فَأَلۡقَىٰ عَصَاهُ فَإِذَا هِيَ ثُعۡبَانٞ مُّبِينٞ * وَنَزَعَ يَدَهُۥ فَإِذَا هِيَ .... لِلنَّٰظِرِينَ",
    "options": [
      'بَيۡضَآءُ',
      'جَمِيلَةُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰٓ أَنۡ أَلۡقِ .... فَإِذَا هِيَ تَلۡقَفُ مَا يَأۡفِكُونَ",
    "options": [
      'عَصَاكَۖ',
      'حَبلِكَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "وَلَمَّا جَآءَ مُوسَىٰ لِمِيقَٰتِنَا وَكَلَّمَهُۥ رَبُّهُۥ قَالَ رَبِّ أَرِنِيٓ أَنظُرۡ إِلَيۡكَۚ قَالَ لَن تَرَىٰنِي وَلَٰكِنِ ٱنظُرۡ إِلَى ..... فَإِنِ ٱسۡتَقَرَّ مَكَانَهُۥ فَسَوۡفَ تَرَىٰنِيۚ فَلَمَّا",
    "options": [
      'البَحرِ',
      'ٱلۡجَبَلِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "وَٱتَّخَذَ قَوۡمُ مُوسَىٰ مِنۢ بَعۡدِهِۦ مِنۡ حُلِيِّهِمۡ ..... جَسَدٗا لَّهُۥ خُوَارٌۚ أَلَمۡ يَرَوۡاْ أَنَّهُۥ لَا يُكَلِّمُهُمۡ وَلَا يَهۡدِيهِمۡ سَبِيلًاۘ ٱتَّخَذُوهُ وَكَانُواْ ظَٰلِمِينَ",
    "options": [
      'عِجۡلٗا',
      'حِمَاراً',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "وَٱخۡتَارَ مُوسَىٰ قَوۡمَهُۥ ...... رَجُلٗا لِّمِيقَٰتِنَاۖ فَلَمَّآ أَخَذَتۡهُمُ ٱلرَّجۡفَةُ قَالَ رَبِّ لَوۡ شِئۡتَ أَهۡلَكۡتَهُم مِّن قَبۡلُ وَإِيَّٰيَۖ أَتُهۡلِكُنَا بِمَا فَعَلَ ٱلسُّفَهَآءُ مِنَّآۖ",
    "options": [
      'عِشرِينَ',
      'سَبۡعِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "وَقَطَّعۡنَٰهُمُ ٱثۡنَتَيۡ عَشۡرَةَ أَسۡبَاطًا أُمَمٗاۚ وَأَوۡحَيۡنَآ إِلَىٰ مُوسَىٰٓ إِذِ ٱسۡتَسۡقَىٰهُ قَوۡمُهُۥٓ أَنِ ٱضۡرِب بِّعَصَاكَ ..... فَٱنۢبَجَسَتۡ مِنۡهُ ٱثۡنَتَا عَشۡرَةَ عَيۡناً",
    "options": [
      'ٱلۡحَجَرَۖ',
      'الجَبَلَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "مَن يَهۡدِ ٱللَّهُ فَهُوَ .... وَمَن يُضۡلِلۡ فَأُوْلَٰٓئِكَ هُمُ ٱلۡخَٰسِرُونَ",
    "options": [
      'ٱلۡمُهۡتَدِيۖ',
      'الفَائِز',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ ..... إِنَّهُۥ سَمِيعٌ عَلِيمٌ",
    "options": [
      '	فَاستَغفِر اللَّه',
      '	فَٱسۡتَعِذۡ بِٱللَّهِۚ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "وَمَا كَانَ ٱللَّهُ لِيُعَذِّبَهُمۡ وَأَنتَ فِيهِمۡۚ وَمَا كَانَ ٱللَّهُ مُعَذِّبَهُمۡ وَهُمۡ ......",
    "options": [
      'يَسۡتَغۡفِرُونَ',
      'يَحمِدُونَ',
    ],
    "answer_index": 0,
  },
 {
  "id": 12,
  "question": "بما خُتمت هذه الآية (أَفَأَمِنُواْ مَكۡرَ ٱللَّهِۚ فَلَا يَأۡمَنُ مَكۡرَ ٱللَّهِ إِلَّا.......)",
  "options": [
    'ٱلۡقَوۡمُ ٱلۡخَٰسِرُونَ',
    'ٱلۡقَوۡمُ ٱلۡكَٰفَرُونَ',
  ],
  "answer_index": 0,
},
{
  "id": 13,
  "question": "(قَالُوٓاْ أَرۡجِهۡ وَأَخَاهُ وَأَرۡسِلۡ فِي ٱلۡمَدَآئِنِ حَٰشِرِينَ ) معنى أَرۡجِهۡ....",
  "options": [
    'أخّر أمر عقوبتهما',
    'عجِّل أمر عقوبتهما',
  ],
  "answer_index": 0,
},
{
  "id": 14,
  "question": "ما الآية التالية لهذه الآية (وَأُلۡقِيَ ٱلسَّحَرَةُ سَٰجِدِينَ)",
  "options": [
    'قَالُوٓاْ ءَامَنَّا بِرَبِّ ٱلۡعَٰلَمِينَ رَبِّ مُوسَىٰ وَهَٰرُونَ',
    'قَالُوٓاْ ءَامَنَّا بِرَبِّ هَٰرُونَ وَمُوسَىٰ',
  ],
  "answer_index": 0,
},
{
  "id": 15,
  "question": "ما الآية التالية لهذه الآية (قَالَ فِرۡعَوۡنُ ءَامَنتُم بِهِۦ قَبۡلَ أَنۡ ءَاذَنَ لَكُمۡۖ إِنَّ هَٰذَا لَمَكۡرٞ مَّكَرۡتُمُوهُ فِي ٱلۡمَدِينَةِ لِتُخۡرِجُواْ مِنۡهَآ أَهۡلَهَاۖ فَسَوۡفَ تَعۡلَمُونَ)",
  "options": [
    'لَأُقَطِّعَنَّ أَيۡدِيَكُمۡ وَأَرۡجُلَكُم مِّنۡ خِلَٰفٖ ثُمَّ لَأُصَلِّبَنَّكُمۡ أَجۡمَعِينَ',
    'فَلَأُقَطِّعَنَّ أَيۡدِيَكُمۡ وَأَرۡجُلَكُم مِّنۡ خِلَٰفٖ وَلَأُصَلِّبَنَّكُمۡ فِي جُذُوعِ ٱلنَّخۡلِ وَلَتَعۡلَمُنَّ أَيُّنَآ أَشَدُّ عَذَابٗا وَأَبۡقَىٰ',
  ],
  "answer_index": 0,
},
{
  "id": 16,
  "question": "(يَسۡ‍َٔلُونَكَ عَنِ ٱلۡأَنفَالِۖ قُلِ ٱلۡأَنفَالُ لِلَّهِ وَٱلرَّسُولِۖ فَٱتَّقُواْ ٱللَّهَ وَأَصۡلِحُواْ ذَاتَ بَيۡنِكُمۡۖ وَأَطِيعُواْ ٱللَّهَ وَرَسُولَهُۥٓ إِن كُنتُم مُّؤۡمِنِينَ) معنى ٱلۡأَنفَالِۖ",
  "options": [
    'غنائم بدر',
    'غنائم أحد',
  ],
  "answer_index": 0,
},

];





const List partTen =
[
  {
    "id": 1,
    "question": "وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن .... بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ",
    "options": [
      'بِيوتِهم',
      'دِيَٰرِهِم',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " (وَلَا تَكُونُواْ كَٱلَّذِينَ خَرَجُواْ مِن .... بَطَرٗا وَرِئَآءَ ٱلنَّاسِ وَيَصُدُّونَ عَن سَبِيلِ ٱللَّهِۚ وَٱللَّهُ بِمَا يَعۡمَلُونَ مُحِيطٞ)\n ما معنى بطراً",
    "options": [
      'فساداً',
      'صلاحاً',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "ذَٰلِكَ بِأَنَّ ٱللَّهَ لَمۡ يَكُ مُغَيِّرٗا نِّعۡمَةً أَنۡعَمَهَا عَلَىٰ قَوۡمٍ حَتَّىٰ .... مَا بِأَنفُسِهِمۡ وَأَنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ",
    "options": [
      'يُجَمِّلُوا',
      'يُغَيِّرُواْ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "4. تبدأ سورة التوبة ب ....",
    "options": [
      'بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ',
      '	ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَاۜ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "فَإِن تَابُواْ وَأَقَامُواْ ٱلصَّلَوٰةَ وَءَاتَوُاْ ..... فَإِخۡوَٰنُكُمۡ فِي ٱلدِّينِۗ وَنُفَصِّلُ ٱلۡأٓيَٰتِ لِقَوۡمٖ يَعۡلَمُونَ",
    "options": [
      'ٱلزَّكَوٰةَ',
      'ٱلصَّدَقَٰتَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "لَقَدۡ نَصَرَكُمُ ٱللَّهُ فِي مَوَاطِنَ كَثِيرَةٖ وَيَوۡمَ .... إِذۡ أَعۡجَبَتۡكُمۡ كَثۡرَتُكُمۡ فَلَمۡ تُغۡنِ عَنكُمۡ شَيۡـٔٗا وَضَاقَتۡ عَلَيۡكُمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ ثُمَّ وَلَّيۡتُم مُّدۡبِرِينَ",
    "options": [
      'بَدرٍ',
      'حُنَيۡنٍ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُوٓاْ إِنَّمَا ٱلۡمُشۡرِكُونَ .... فَلَا يَقۡرَبُواْ ٱلۡمَسۡجِدَ ٱلۡحَرَامَ بَعۡدَ عَامِهِمۡ هَٰذَاۚ",
    "options": [
      'نَجَسٞ',
      'طُهرٌ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "إِنَّ عِدَّةَ ٱلشُّهُورِ عِندَ ٱللَّهِ ٱثۡنَا عَشَرَ شَهۡرٗا فِي كِتَٰبِ ٱللَّهِ يَوۡمَ خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ مِنۡهَآ ...... حُرُمٞۚ",
    "options": [
      'ثَلاثَةٌ',
      'أَرۡبَعَةٌ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "قُل لَّن ..... إِلَّا مَا كَتَبَ ٱللَّهُ لَنَا هُوَ مَوۡلَىٰنَاۚ وَعَلَى ٱللَّهِ فَلۡيَتَوَكَّلِ ٱلۡمُؤۡمِنُونَ",
    "options": [
      'يُصِيبَنَآ',
      'يَأتِينَا',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " إِنَّمَا ٱلصَّدَقَٰتُ ...... وَٱلۡمَسَٰكِينِ وَٱلۡعَٰمِلِينَ عَلَيۡهَا وَٱلۡمُؤَلَّفَةِ قُلُوبُهُمۡ وَفِي ٱلرِّقَابِ وَٱلۡغَٰرِمِينَ وَفِي سَبِيلِ ٱللَّهِ وَٱبۡنِ ٱلسَّبِيلِۖ فَرِيضَةٗ مِّنَ ٱللَّهِۗ وَٱللَّهُ عَلِيمٌ حَكِيمٞ",
    "options": [
      'لِلۡفُقَرَآءِ',
      'للأَغنيَاء',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "وَلَئِن سَأَلۡتَهُمۡ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ .... قُلۡ أَبِٱللَّهِ وَءَايَٰتِهِۦ وَرَسُولِهِۦ كُنتُمۡ تَسۡتَهۡزِءُونَ",
    "options": [
      'وَنستَهزأُ',
      'وَنَلۡعَبُۚ',
    ],
    "answer_index": 1,
  },
 {
  "id": 12,
  "question": "بما خُتمت هذه الآية (إِذۡ أَنتُم بِٱلۡعُدۡوَةِ ٱلدُّنۡيَا وَهُم بِٱلۡعُدۡوَةِ ٱلۡقُصۡوَىٰ وَٱلرَّكۡبُ أَسۡفَلَ مِنكُمۡۚ وَلَوۡ تَوَاعَدتُّمۡ لَٱخۡتَلَفۡتُمۡ فِي ٱلۡمِيعَٰدِ وَلَٰكِن لِّيَقۡضِيَ ٱللَّهُ أَمۡرٗا كَانَ مَفۡعُولٗا لِّيَهۡلِكَ مَنۡ هَلَكَ عَنۢ بَيِّنَةٖ وَيَحۡيَىٰ مَنۡ حَيَّ عَنۢ بَيِّنَةٖۗ وَإِنَّ ٱللَّهَ............)",
  "options": [
    'لَسَمِيعٌ عَلِيمٌ',
    'لَسَمِيعٌ بَصِيرُ',
  ],
  "answer_index": 0,
},
{
  "id": 13,
  "question": "(وَإِذۡ زَيَّنَ لَهُمُ ٱلشَّيۡطَٰنُ أَعۡمَٰلَهُمۡ وَقَالَ لَا غَالِبَ لَكُمُ ٱلۡيَوۡمَ مِنَ ٱلنَّاسِ وَإِنِّي جَارٞ لَّكُمۡۖ فَلَمَّا تَرَآءَتِ ٱلۡفِئَتَانِ نَكَصَ عَلَىٰ عَقِبَيۡهِ وَقَالَ إِنِّي بَرِيٓءٞ مِّنكُمۡ إِنِّيٓ أَرَىٰ مَا لَا تَرَوۡنَ إِنِّيٓ أَخَافُ ٱللَّهَۚ وَٱللَّهُ شَدِيدُ ٱلۡعِقَابِ) ، معنى نَكَصَ......",
  "options": [
    'ولى مدبرًا ورجع',
    'تقدم',
  ],
  "answer_index": 0,
},
{
  "id": 14,
  "question": "بما خُتمت هذه الآية (كَدَأۡبِ ءَالِ فِرۡعَوۡنَ وَٱلَّذِينَ مِن قَبۡلِهِمۡۚ كَذَّبُواْ بِ‍َٔايَٰتِ رَبِّهِمۡ........)",
  "options": [
    'فَأَخَذَهُمُ ٱللَّهُ بِذُنُوبِهِمۡۚ إِنَّ ٱللَّهَ قَوِيّٞ شَدِيدُ ٱلۡعِقَابِ',
    'فَأَهۡلَكۡنَٰهُم بِذُنُوبِهِمۡ وَأَغۡرَقۡنَآ ءَالَ فِرۡعَوۡنَۚ وَكُلّٞ كَانُواْ ظَٰلِمِينَ',
  ],
  "answer_index": 1,
},
{
  "id": 15,
  "question": "بما خُتمت هذه الآية (يُرِيدُونَ أَن يُطۡفِ‍ُٔواْ نُورَ ٱللَّهِ بِأَفۡوَٰهِهِمۡ وَيَأۡبَى ٱللَّهُ إِلَّآ أَن يُتِمَّ نُورَهُۥ .........)",
  "options": [
    'وَلَوۡ كَرِهَ ٱلۡمُشۡرِكُونَ',
    'وَلَوۡ كَرِهَ ٱلۡكَٰفِرُونَ',
  ],
  "answer_index": 1,
},
{
  "id": 16,
  "question": "(إِنَّمَا ٱلنَّسِيٓءُ زِيَادَةٞ فِي ٱلۡكُفۡرِۖ يُضَلُّ بِهِ ٱلَّذِينَ كَفَرُواْ يُحِلُّونَهُۥ عَامٗا وَيُحَرِّمُونَهُۥ عَامٗا لِّيُوَاطِ‍ُٔواْ عِدَّةَ مَا حَرَّمَ ٱللَّهُ فَيُحِلُّواْ مَا حَرَّمَ ٱللَّهُۚ زُيِّنَ لَهُمۡ سُوٓءُ أَعۡمَٰلِهِمۡۗ وَٱللَّهُ لَا يَهۡدِي ٱلۡقَوۡمَ ٱلۡكَٰفِرِينَ) معنى ٱلنَّسِيٓءُ",
  "options": [
    'تأخير حرمة شهر إلى شهر آخر',
    'تحليل الشهور المحرمة',
  ],
  "answer_index": 0,
},
];





const List partEleven =
[
  {
    "id": 1,
    "question": "أَفَمَنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ تَقۡوَىٰ مِنَ ٱللَّهِ وَرِضۡوَٰنٍ ..... أَم مَّنۡ أَسَّسَ بُنۡيَٰنَهُۥ عَلَىٰ شَفَا جُرُفٍ هَارٖ فَٱنۡهَارَ بِهِۦ فِي نَارِ جَهَنَّمَۗ",
    "options": [
      'خَيۡرٌ',
      'شَرٌ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "وَعَلَى ...... ٱلَّذِينَ خُلِّفُواْ حَتَّىٰٓ إِذَا ضَاقَتۡ عَلَيۡهِمُ ٱلۡأَرۡضُ بِمَا رَحُبَتۡ وَضَاقَتۡ عَلَيۡهِمۡ أَنفُسُهُمۡ وَظَنُّوٓاْ أَن لَّا مَلۡجَأَ مِنَ ٱللَّهِ إِلَّآ إِلَيۡهِ ثُمَّ تَابَ عَلَيۡهِمۡ لِيَتُوبُوٓاْۚ إِنَّ ٱللَّهَ هُوَ ٱلتَّوَّابُ ٱلرَّحِيمُ",
    "options": [
      'ٱلثَّلَٰثَةِ',
      'السَبعةِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "تبدأ سورة يونس ب",
    "options": [
      '	طه * مَآ أَنزَلۡنَا عَلَيۡكَ ٱلۡقُرۡءَانَ لِتَشۡقَىٰٓ',
      'الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "إِنَّ رَبَّكُمُ ٱللَّهُ ٱلَّذِي خَلَقَ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ فِي سِتَّةِ .... ثُمَّ ٱسۡتَوَىٰ عَلَى ٱلۡعَرۡشِۖ",
    "options": [
      'أَيَّامٖ',
      'أَشهر',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "دَعۡوَىٰهُمۡ فِيهَا سُبۡحَٰنَكَ ٱللَّهُمَّ .... فِيهَا سَلَٰمٞۚ وَءَاخِرُ دَعۡوَىٰهُمۡ أَنِ ٱلۡحَمۡدُ لِلَّهِ رَبِّ ٱلۡعَٰلَمِينَ",
    "options": [
      'وَتحمِيدُهُم',
      'وَتَحِيَّتُهُمۡ',
    ],
    "answer_index":1,
  },
  {
    "id": 6,
    "question": "إِنَّمَا مَثَلُ ٱلۡحَيَوٰةِ ٱلدُّنۡيَا كَمَآءٍ أَنزَلۡنَٰهُ مِنَ ..... فَٱخۡتَلَطَ بِهِۦ نَبَاتُ ٱلۡأَرۡضِ مِمَّا يَأۡكُلُ ٱلنَّاسُ وَٱلۡأَنۡعَٰمُ حَتَّىٰٓ إِذَآ أَخَذَتِ ٱلۡأَرۡضُ زُخۡرُفَهَا وَٱزَّيَّنَتۡ وَظَنَّ أَهۡلُهَآ أَنَّهُمۡ قَٰدِرُونَ عَلَيۡهَآ",
    "options": [
      'ٱلسَّمَآءِ',
      'ٱلۡأَرۡضِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "إِنَّ ٱللَّهَ لَا .... ٱلنَّاسَ شَيۡـٔٗا وَلَٰكِنَّ ٱلنَّاسَ أَنفُسَهُمۡ يَظۡلِمُونَ",
    "options": [
      'يُعَذِّبُ',
      'يَظۡلِمُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "فَكَذَّبُوهُ فَنَجَّيۡنَٰهُ وَمَن مَّعَهُۥ فِي ٱلۡفُلۡكِ وَجَعَلۡنَٰهُمۡ خَلَٰٓئِفَ وَأَغۡرَقۡنَا ٱلَّذِينَ كَذَّبُواْ بِـَٔايَٰتِنَاۖ فَٱنظُرۡ كَيۡفَ كَانَ عَٰقِبَةُ ٱلۡمُنذَرِينَ",
    "options": [
      'نوح عليه السلام',
      '	موسى عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "فَلَمَّآ أَلۡقَوۡاْ قَالَ مُوسَىٰ مَا جِئۡتُم بِهِ .... إِنَّ ٱللَّهَ سَيُبۡطِلُهُۥٓ إِنَّ ٱللَّهَ لَا يُصۡلِحُ عَمَلَ ٱلۡمُفۡسِدِينَ",
    "options": [
      'الفِتنَةُ',
      'ٱلسِّحۡرُۖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من المقصود في هذه الآية (حَتَّىٰٓ إِذَآ أَدۡرَكَهُ ٱلۡغَرَقُ قَالَ ءَامَنتُ أَنَّهُۥ لَآ إِلَٰهَ إِلَّا ٱلَّذِيٓ ءَامَنَتۡ بِهِۦ بَنُوٓاْ إِسۡرَٰٓءِيلَ وَأَنَا۠ مِنَ ٱلۡمُسۡلِمِينَ)",
    "options": [
      'قارون',
      'فرعون',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "فَٱلۡيَوۡمَ نُنَجِّيكَ ..... لِتَكُونَ لِمَنۡ خَلۡفَكَ ءَايَةٗۚ وَإِنَّ كَثِيرٗا مِّنَ ٱلنَّاسِ عَنۡ ءَايَٰتِنَا لَغَٰفِلُونَ",
    "options": [
      'بِبَدَنِكَ',
      'بِجسمِكَ',
    ],
    "answer_index": 0,
  },
];





const List partTwelve =
[
  {
    "id": 1,
    "question": "وَأُوحِيَ إِلَىٰ نُوحٍ أَنَّهُۥ لَن يُؤۡمِنَ مِن قَوۡمِكَ إِلَّا مَن قَدۡ ءَامَنَ فَلَا تَبۡتَئِسۡ بِمَا كَانُواْ يَفۡعَلُونَ * وَٱصۡنَعِ ..... بِأَعۡيُنِنَا وَوَحۡيِنَا وَلَا تُخَٰطِبۡنِي فِي ٱلَّذِينَ ظَلَمُوٓاْ إِنَّهُم مُّغۡرَقُونَ",
    "options": [
      'السَفينةَ',
      'ٱلۡفُلۡكَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "وَقَالَ ٱرۡكَبُواْ فِيهَا ...... مَجۡر۪ىٰهَا وَمُرۡسَىٰهَآۚ إِنَّ رَبِّي لَغَفُورٞ رَّحِيمٞ",
    "options": [
      '	بِسۡمِ ٱللَّهِ',
      '	الحمدُللهِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "قَالَ سَـَٔاوِيٓ إِلَىٰ جَبَلٖ ...... مِنَ ٱلۡمَآءِۚ قَالَ لَا عَاصِمَ ٱلۡيَوۡمَ مِنۡ أَمۡرِ ٱللَّهِ إِلَّا مَن رَّحِمَۚ وَحَالَ بَيۡنَهُمَا ٱلۡمَوۡجُ فَكَانَ مِنَ ٱلۡمُغۡرَقِينَ",
    "options": [
      'يَحمِيني',
      'يَعۡصِمُنِي',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " من قائل هذه الآية (وَيَٰقَوۡمِ هَٰذِهِۦ نَاقَةُ ٱللَّهِ لَكُمۡ ءَايَةٗۖ فَذَرُوهَا تَأۡكُلۡ فِيٓ أَرۡضِ ٱللَّهِۖ وَلَا تَمَسُّوهَا بِسُوٓءٖ فَيَأۡخُذَكُمۡ عَذَابٞ قَرِيبٞ)",
    "options": [
      'موسى',
      'صالح',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "وَٱمۡرَأَتُهُۥ قَآئِمَةٞ ..... فَبَشَّرۡنَٰهَا بِإِسۡحَٰقَ وَمِن وَرَآءِ إِسۡحَٰقَ يَعۡقُوبَ",
    "options": [
      'فَفرِحت',
      'فَضَحِكَتۡ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "قَالَتۡ يَٰوَيۡلَتَىٰٓ ءَأَلِدُ وَأَنَا۠ ..... وَهَٰذَا بَعۡلِي شَيۡخًاۖ إِنَّ هَٰذَا لَشَيۡءٌ عَجِيبٞ",
    "options": [
      'عَجُوزٞ',
      'عَقيمُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ * إِنَّآ أَنزَلۡنَٰهُ ..... عَرَبِيّٗا لَّعَلَّكُمۡ تَعۡقِلُونَ",
    "options": [
      'قُرۡءَٰنًا',
      'كِتَابًا',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "إِذۡ قَالَ ...... لِأَبِيهِ يَٰٓأَبَتِ إِنِّي رَأَيۡتُ أَحَدَ عَشَرَ كَوۡكَبٗا وَٱلشَّمۡسَ وَٱلۡقَمَرَ رَأَيۡتُهُمۡ لِي سَٰجِدِينَ",
    "options": [
      'إسمَاعِيلُ',
      'يُوسُفُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "قَالَ يَٰبُنَيَّ لَا تَقۡصُصۡ ..... عَلَىٰٓ إِخۡوَتِكَ فَيَكِيدُواْ لَكَ كَيۡدًاۖ إِنَّ ٱلشَّيۡطَٰنَ لِلۡإِنسَٰنِ عَدُوّٞ مُّبِينٞ",
    "options": [
      'رُءۡيَاكَ',
      'قِصَتُكَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "قَالَ قَآئِلٞ مِّنۡهُمۡ لَا تَقۡتُلُواْ يُوسُفَ وَأَلۡقُوهُ فِي غَيَٰبَتِ ..... يَلۡتَقِطۡهُ بَعۡضُ ٱلسَّيَّارَةِ إِن كُنتُمۡ فَٰعِلِينَ",
    "options": [
      'البِئرُ',
      'ٱلۡجُبِّ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "قَالُواْ يَٰٓأَبَانَآ إِنَّا ذَهَبۡنَا نَسۡتَبِقُ وَتَرَكۡنَا يُوسُفَ عِندَ مَتَٰعِنَا فَأَكَلَهُ ...... وَمَآ أَنتَ بِمُؤۡمِنٖ لَّنَا وَلَوۡ كُنَّا صَٰدِقِينَ",
    "options": [
      'ٱلذِّئۡبُۖ',
      'السَبعُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "وَجَآءُو عَلَىٰ ..... بِدَمٖ كَذِبٖۚ قَالَ بَلۡ سَوَّلَتۡ لَكُمۡ أَنفُسُكُمۡ أَمۡرٗاۖ فَصَبۡرٞ جَمِيلٞۖ وَٱللَّهُ ٱلۡمُسۡتَعَانُ عَلَىٰ مَا تَصِفُونَ",
    "options": [
      'قَمِيصِهِۦ',
      'لِبَاسِهِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "وَدَخَلَ مَعَهُ ٱلسِّجۡنَ فَتَيَانِۖ قَالَ أَحَدُهُمَآ إِنِّيٓ أَرَىٰنِيٓ .... خَمۡرٗاۖ وَقَالَ ٱلۡأٓخَرُ إِنِّيٓ أَرَىٰنِيٓ أَحۡمِلُ فَوۡقَ رَأۡسِي خُبۡزٗا تَأۡكُلُ ٱلطَّيۡرُ مِنۡهُۖ",
    "options": [
      'أَعۡصِرُ',
      'أَشرَبُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "وَقَالَ ..... إِنِّيٓ أَرَىٰ سَبۡعَ بَقَرَٰتٖ سِمَانٖ يَأۡكُلُهُنَّ سَبۡعٌ عِجَافٞ وَسَبۡعَ سُنۢبُلَٰتٍ خُضۡرٖ وَأُخَرَ يَابِسَٰتٖۖ يَٰٓأَيُّهَا ٱلۡمَلَأُ أَفۡتُونِي فِي رُءۡيَٰيَ إِن كُنتُمۡ لِلرُّءۡيَا تَعۡبُرُونَ",
    "options": [
      'هَارونَ',
      'ٱلۡمَلِكُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "يُوسُفُ أَيُّهَا ٱلصِّدِّيقُ ..... فِي سَبۡعِ بَقَرَٰتٖ سِمَانٖ يَأۡكُلُهُنَّ سَبۡعٌ عِجَافٞ وَسَبۡعِ سُنۢبُلَٰتٍ خُضۡرٖ وَأُخَرَ يَابِسَٰتٖ لَّعَلِّيٓ أَرۡجِعُ إِلَى ٱلنَّاسِ لَعَلَّهُمۡ يَعۡلَمُونَ",
    "options": [
      'أَفۡتِنَا',
      'أَعلِمنَا',
    ],
    "answer_index": 0,
  },
];





const List partThirteen  =
[
  {
    "id": 1,
    "question": "وَجَآءَ ...... يُوسُفَ فَدَخَلُواْ عَلَيۡهِ فَعَرَفَهُمۡ وَهُمۡ لَهُۥ مُنكِرُونَ",
    "options": [
      'أَعمَامُ',
      'إِخۡوَةُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "وَقَالَ يَٰبَنِيَّ لَا تَدۡخُلُواْ مِنۢ ..... وَٰحِدٖ وَٱدۡخُلُواْ مِنۡ أَبۡوَٰبٖ مُّتَفَرِّقَةٖۖ وَمَآ أُغۡنِي عَنكُم مِّنَ ٱللَّهِ مِن شَيۡءٍۖ إِنِ ٱلۡحُكۡمُ إِلَّا لِلَّهِۖ عَلَيۡهِ تَوَكَّلۡتُۖ وَعَلَيۡهِ فَلۡيَتَوَكَّلِ ٱلۡمُتَوَكِّلُونَ",
    "options": [
      'بَابٖ',
      'بَيت',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "وَتَوَلَّىٰ عَنۡهُمۡ وَقَالَ يَٰٓأَسَفَىٰ عَلَىٰ يُوسُفَ ..... عَيۡنَاهُ مِنَ ٱلۡحُزۡنِ فَهُوَ كَظِيمٞ",
    "options": [
      'واسوَدَّت',
      'وَٱبۡيَضَّتۡ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "ٱذۡهَبُواْ .... هَٰذَا فَأَلۡقُوهُ عَلَىٰ وَجۡهِ أَبِي يَأۡتِ بَصِيرٗا وَأۡتُونِي بِأَهۡلِكُمۡ أَجۡمَعِينَ",
    "options": [
      'بِقَمِيصِي',
      'بِلبَاسي',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "لَقَدۡ كَانَ فِي قَصَصِهِمۡ ..... لِّأُوْلِي ٱلۡأَلۡبَٰبِۗ مَا كَانَ حَدِيثٗا يُفۡتَرَىٰ وَلَٰكِن تَصۡدِيقَ ٱلَّذِي بَيۡنَ يَدَيۡهِ وَتَفۡصِيلَ كُلِّ شَيۡءٖ وَهُدٗى وَرَحۡمَةٗ لِّقَوۡمٖ يُؤۡمِنُونَ",
    "options": [
      'عِبۡرَةٞ',
      'حِكمَةٌ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "تبدأ سورة الرعد ب ....",
    "options": [
      'تَبَٰرَكَ ٱلَّذِي بِيَدِهِ ٱلۡمُلۡكُ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ',
      '	الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "ٱلَّذِينَ ءَامَنُواْ .... قُلُوبُهُم بِذِكۡرِ ٱللَّهِۗ أَلَا بِذِكۡرِ ٱللَّهِ تَطۡمَئِنُّ ٱلۡقُلُوبُ",
    "options": [
      'وتَأمَنُ',
      'وَتَطۡمَئِنُّ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " تبدأ سورة إبراهيم ب ....",
    "options": [
      '	الٓرۚ كِتَٰبٌ أَنزَلۡنَٰهُ إِلَيۡكَ لِتُخۡرِجَ ٱلنَّاسَ مِنَ ٱلظُّلُمَٰتِ إِلَى ٱلنُّورِ بِإِذۡنِ رَبِّهِمۡ إِلَىٰ صِرَٰطِ ٱلۡعَزِيزِ ٱلۡحَمِيدِ',
      '	قُلۡ أُوحِيَ إِلَيَّ أَنَّهُ ٱسۡتَمَعَ نَفَرٞ مِّنَ ٱلۡجِنِّ فَقَالُوٓاْ إِنَّا سَمِعۡنَا قُرۡءَانًا عَجَبٗا',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "وَإِذۡ قَالَ إِبۡرَٰهِيمُ رَبِّ ٱجۡعَلۡ هَٰذَا ٱلۡبَلَدَ ءَامِنٗا وَٱجۡنُبۡنِي وَبَنِيَّ أَن نَّعۡبُدَ .....",
    "options": [
      'ٱلۡأَصۡنَامَ',
      'الأَحجَارَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "رَّبَّنَآ إِنِّيٓ أَسۡكَنتُ مِن ذُرِّيَّتِي بِوَادٍ غَيۡرِ ذِي زَرۡعٍ عِندَ بَيۡتِكَ ..... رَبَّنَا لِيُقِيمُواْ ٱلصَّلَوٰةَ فَٱجۡعَلۡ أَفۡـِٔدَةٗ مِّنَ ٱلنَّاسِ تَهۡوِيٓ إِلَيۡهِمۡ وَٱرۡزُقۡهُم مِّنَ ٱلثَّمَرَٰتِ لَعَلَّهُمۡ يَشۡكُرُونَ",
    "options": [
      'المُقدَّسِ',
      'ٱلۡمُحَرَّمِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "رَبِّ ٱجۡعَلۡنِي مُقِيمَ ..... وَمِن ذُرِّيَّتِيۚ رَبَّنَا وَتَقَبَّلۡ دُعَآءِ",
    "options": [
      'الدُعاءِ',
      'ٱلصَّلَوٰةِ',
    ],
    "answer_index": 1,
  },
];


const List partFourteen  =
[
  {
    "id": 1,
    "question": "سورة الحجر ...",
    "options": [
      'مكيةٖ',
      'مدنية',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "تبدأ سورة الحجر ب ...",
    "options": [
      '	الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ',
      '	وَٱلضُّحَىٰ *وَٱلَّيۡلِ إِذَا سَجَىٰ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "إِلَّآ إِبۡلِيسَ .... أَن يَكُونَ مَعَ ٱلسَّٰجِدِينَ",
    "options": [
      'وَافَقَ',
      'أَبَىٰٓ',
    ],
    "answer_index": 1,
  },
  {
    "id":4,
    "question": "تبدأ سورة النحل ب ....",
    "options": [
      '	عَمَّ يَتَسَآءَلُونَ * عَنِ ٱلنَّبَإِ ٱلۡعَظِيمِ',
      '	أَتَىٰٓ أَمۡرُ ٱللَّهِ فَلَا تَسۡتَعۡجِلُوهُۚ سُبۡحَٰنَهُۥ وَتَعَٰلَىٰ عَمَّا يُشۡرِكُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "وَٱلۡخَيۡلَ وَٱلۡبِغَالَ وَٱلۡحَمِيرَ ...... وَزِينَةٗۚ وَيَخۡلُقُ مَا لَا تَعۡلَمُونَ",
    "options": [
      'لِتَرۡكَبُوهَا',
      'لِتزينُوهَا',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "وَإِذَا بُشِّرَ أَحَدُهُم بِٱلۡأُنثَىٰ ظَلَّ وَجۡهُهُۥ مُسۡوَدّٗا وَهُوَ .....",
    "options": [
      'كَظِيمٞ',
      'سَعِيد',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "وَأَوۡحَىٰ رَبُّكَ إِلَى ٱلنَّحۡلِ أَنِ ٱتَّخِذِي مِنَ ٱلۡجِبَالِ ..... وَمِنَ ٱلشَّجَرِ وَمِمَّا يَعۡرِشُون",
    "options": [
      'قُصُوراً',
      'بُيُوتٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "فَإِذَا قَرَأۡتَ ٱلۡقُرۡءَانَ .... بِٱللَّهِ مِنَ ٱلشَّيۡطَٰنِ ٱلرَّجِيمِ",
    "options": [
      'فَٱسۡتَعِذۡ',
      'فَاستَغفِر',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "إِنَّمَا حَرَّمَ عَلَيۡكُمُ ٱلۡمَيۡتَةَ وَٱلدَّمَ وَلَحۡمَ ..... وَمَآ أُهِلَّ لِغَيۡرِ ٱللَّهِ بِهِۦۖ فَمَنِ ٱضۡطُرَّ غَيۡرَ بَاغٖ وَلَا عَادٖ فَإِنَّ ٱللَّهَ غَفُورٞ رَّحِيمٞ",
    "options": [
      'الحَمِيرِ',
      'ٱلۡخِنزِيرِ',
    ],
    "answer_index": 1,
  },
];






const List partFifteen =
[
  {
    "id": 1,
    "question": "سُبۡحَٰنَ ٱلَّذِيٓ أَسۡرَىٰ بِعَبۡدِهِۦ ...... مِّنَ ٱلۡمَسۡجِدِ ٱلۡحَرَامِ إِلَى ٱلۡمَسۡجِدِ ٱلۡأَقۡصَا ٱلَّذِي بَٰرَكۡنَا حَوۡلَهُۥ لِنُرِيَهُۥ مِنۡ ءَايَٰتِنَآۚ إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ",
    "options": [
      'لَيۡلٗا',
      'نَهَاراً',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "وَقَضَىٰ رَبُّكَ أَلَّا تَعۡبُدُوٓاْ إِلَّآ إِيَّاهُ ...... إِحۡسَٰنًاۚ إِمَّا يَبۡلُغَنَّ عِندَكَ ٱلۡكِبَرَ أَحَدُهُمَآ أَوۡ كِلَاهُمَا فَلَا تَقُل لَّهُمَآ أُفّٖ وَلَا تَنۡهَرۡهُمَا وَقُل لَّهُمَا قَوۡلٗا كَرِيمٗا",
    "options": [
      'وَبِٱلۡوَٰلِدَيۡنِ',
      'وَبِالأَبنَاءِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "إِنَّ ..... كَانُوٓاْ إِخۡوَٰنَ ٱلشَّيَٰطِينِۖ وَكَانَ ٱلشَّيۡطَٰنُ لِرَبِّهِۦ كَفُورٗا",
    "options": [
      'ٱلۡمُسرِفينَ',
      'ٱلۡمُبَذِّرِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ .... إِنَّكَ لَن تَخۡرِقَ ٱلۡأَرۡضَ وَلَن تَبۡلُغَ ٱلۡجِبَالَ طُولٗا",
    "options": [
      'مَرَحًاۖ',
      'مُتَكبِراً',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "وَإِذۡ قُلۡنَا لِلۡمَلَٰٓئِكَةِ ٱسۡجُدُواْ ..... فَسَجَدُوٓاْ إِلَّآ إِبۡلِيسَ قَالَ ءَأَسۡجُدُ لِمَنۡ خَلَقۡتَ طِينٗا",
    "options": [
      'لِنُوحَ',
      'لِأٓدَمَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "أَقِمِ ٱلصَّلَوٰةَ لِدُلُوكِ ٱلشَّمۡسِ إِلَىٰ غَسَقِ ٱلَّيۡلِ وَقُرۡءَانَ ٱلۡفَجۡرِۖ إِنَّ قُرۡءَانَ ..... كَانَ مَشۡهُودٗا",
    "options": [
      'ٱلۡعَصرِ',
      'ٱلۡفَجۡرِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "وَمِنَ ..... فَتَهَجَّدۡ بِهِۦ نَافِلَةٗ لَّكَ عَسَىٰٓ أَن يَبۡعَثَكَ رَبُّكَ مَقَامٗا مَّحۡمُودٗا",
    "options": [
      'ٱلَّيۡلِ',
      'النَّهارِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "تبدأ سورة الكهف ب...",
    "options": [
      '	ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَاۜ',
      'بَرَآءَةٞ مِّنَ ٱللَّهِ وَرَسُولِهِۦٓ إِلَى ٱلَّذِينَ عَٰهَدتُّم مِّنَ ٱلۡمُشۡرِكِينَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "فَلَعَلَّكَ ..... نَّفۡسَكَ عَلَىٰٓ ءَاثَٰرِهِمۡ إِن لَّمۡ يُؤۡمِنُواْ بِهَٰذَا ٱلۡحَدِيثِ أَسَفًا",
    "options": [
      'بَٰخِعٞ',
      'مَهلِك',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "أَمۡ حَسِبۡتَ أَنَّ أَصۡحَٰبَ ..... وَٱلرَّقِيمِ كَانُواْ مِنۡ ءَايَٰتِنَا عَجَبًا",
    "options": [
      'السَبتِ',
      'ٱلۡكَهۡفِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "وَإِذِ ٱعۡتَزَلۡتُمُوهُمۡ وَمَا يَعۡبُدُونَ إِلَّا ٱللَّهَ فَأۡوُۥٓاْ إِلَى .... يَنشُرۡ لَكُمۡ رَبُّكُم مِّن رَّحۡمَتِهِۦ وَيُهَيِّئۡ لَكُم مِّنۡ أَمۡرِكُم مِّرۡفَقٗا",
    "options": [
      'الجَبلِ',
      'ٱلۡكَهۡفِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": ".... فِي كَهۡفِهِمۡ ثَلَٰثَ مِاْئَةٖ سِنِينَ وَٱزۡدَادُواْ تِسۡعٗا ",
    "options": [
      'وَلَبِثُواْ',
      'وَنامُوا',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "وَٱضۡرِبۡ لَهُم مَّثَلٗا رَّجُلَيۡنِ جَعَلۡنَا لِأَحَدِهِمَا .... مِنۡ أَعۡنَٰبٖ وَحَفَفۡنَٰهُمَا بِنَخۡلٖ وَجَعَلۡنَا بَيۡنَهُمَا زَرۡعٗا",
    "options": [
      'مَزرَعَتينِ',
      'جَنَّتَيۡنِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "وَدَخَلَ ..... وَهُوَ ظَالِمٞ لِّنَفۡسِهِۦ قَالَ مَآ أَظُنُّ أَن تَبِيدَ هَٰذِهِۦٓ أَبَدٗا",
    "options": [
      'جَنَّتَهُۥ',
      'بَيتَهُۥ',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "وَإِذۡ قَالَ مُوسَىٰ .... لَآ أَبۡرَحُ حَتَّىٰٓ أَبۡلُغَ مَجۡمَعَ ٱلۡبَحۡرَيۡنِ أَوۡ أَمۡضِيَ حُقُبٗا",
    "options": [
      'لِفَتَىٰهُ',
      'لِصَاحبهُ',
    ],
    "answer_index": 0,
  },
   {
      "id": 16,
      "question": "فَلَمَّا بَلَغَا مَجۡمَعَ بَيۡنِهِمَا نَسِيَا ..... فَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ سَرَبٗا ",
      "options": [
        'طَعَامَهُما',
        'حُوتَهُمَا',
      ],
      "answer_index": 1,
    },
   {
      "id": 17,
      "question": "قَالَ أَرَءَيۡتَ إِذۡ أَوَيۡنَآ إِلَى ..... فَإِنِّي نَسِيتُ ٱلۡحُوتَ وَمَآ أَنسَىٰنِيهُ إِلَّا ٱلشَّيۡطَٰنُ أَنۡ أَذۡكُرَهُۥۚ وَٱتَّخَذَ سَبِيلَهُۥ فِي ٱلۡبَحۡرِ عَجَبٗا",
      "options": [
        'ٱلصَّخۡرَةِ',
        'الجِدَارِ',
      ],
      "answer_index": 0,
    },
   {
      "id": 18,
      "question": "فَٱنطَلَقَا حَتَّىٰٓ إِذَا رَكِبَا فِي ٱلسَّفِينَةِ ..... قَالَ أَخَرَقۡتَهَا لِتُغۡرِقَ أَهۡلَهَا لَقَدۡ جِئۡتَ شَيۡـًٔا إِمۡرٗا ",
      "options": [
        'مَزَقهَا',
        'خَرَقَهَاۖ',
      ],
      "answer_index": 1,
    },
   {
      "id": 19,
      "question": "قَالَ لَا تُؤَاخِذۡنِي بِمَا ...... وَلَا تُرۡهِقۡنِي مِنۡ أَمۡرِي عُسۡرٗا ",
      "options": [
        'جَهِلتُ',
        'نَسِيتُ',
      ],
      "answer_index": 1,
    },
   {
      "id": 20,
      "question": "فَٱنطَلَقَا حَتَّىٰٓ إِذَا لَقِيَا ..... فَقَتَلَهُۥ قَالَ أَقَتَلۡتَ نَفۡسٗا زَكِيَّةَۢ بِغَيۡرِ نَفۡسٖ لَّقَدۡ جِئۡتَ شَيۡـٔٗا نُّكۡرٗا",
      "options": [
        'غُلَٰمٗا',
        'صَبيَّاً',
      ],
      "answer_index": 0,
    },

];





const List partSixteen =
[
  {
    "id": 1,
    "question": "قَالَ إِن سَأَلۡتُكَ عَن شَيۡءِۭ بَعۡدَهَا فَلَا تُصَٰحِبۡنِيۖ قَدۡ بَلَغۡتَ مِن لَّدُنِّي .....",
    "options": [
      'نُصحَاً',
      'عُذۡرٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "فَٱنطَلَقَا حَتَّىٰٓ إِذَآ أَتَيَآ أَهۡلَ قَرۡيَةٍ ٱسۡتَطۡعَمَآ أَهۡلَهَا فَأَبَوۡاْ أَن يُضَيِّفُوهُمَا فَوَجَدَا فِيهَا ..... يُرِيدُ أَن يَنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوۡ شِئۡتَ لَتَّخَذۡتَ عَلَيۡهِ أَجۡرٗا",
    "options": [
      'جِدَارٗا',
      'بَيتَاً',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "وَأَمَّا ..... فَكَانَ أَبَوَاهُ مُؤۡمِنَيۡنِ فَخَشِينَآ أَن يُرۡهِقَهُمَا طُغۡيَٰنٗا وَكُفۡرٗا",
    "options": [
      'الصَبيُّ',
      'ٱلۡغُلَٰمُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "قَالُواْ يَٰذَا ٱلۡقَرۡنَيۡنِ إِنَّ يَأۡجُوجَ وَمَأۡجُوجَ .... فِي ٱلۡأَرۡضِ فَهَلۡ نَجۡعَلُ لَكَ خَرۡجًا عَلَىٰٓ أَن تَجۡعَلَ بَيۡنَنَا وَبَيۡنَهُمۡ سَدّٗا",
    "options": [
      'مُفۡسِدُونَ',
      'مُصلِحونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": " تبدأ سورة مريم ب ....",
    "options": [
      'تَبَٰرَكَ ٱلَّذِي بِيَدِهِ ٱلۡمُلۡكُ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ',
      '	كٓهيعٓصٓ * ذِكۡرُ رَحۡمَتِ رَبِّكَ عَبۡدَهُۥ زَكَرِيَّآ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "قَالَ رَبِّ أَنَّىٰ يَكُونُ لِي غُلَٰمٞ وَكَانَتِ ٱمۡرَأَتِي ..... وَقَدۡ بَلَغۡتُ مِنَ ٱلۡكِبَرِ عِتِيّٗا",
    "options": [
      'عَاقِرٗا',
      'عَجُوزاً',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "فَأَجَآءَهَا ..... إِلَىٰ جِذۡعِ ٱلنَّخۡلَةِ قَالَتۡ يَٰلَيۡتَنِي مِتُّ قَبۡلَ هَٰذَا وَكُنتُ نَسۡيٗا مَّنسِيّٗا",
    "options": [
      'الأَلمُ',
      'ٱلۡمَخَاضُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "وَهُزِّيٓ إِلَيۡكِ بِجِذۡعِ .... تُسَٰقِطۡ عَلَيۡكِ رُطَبٗا جَنِيّٗا",
    "options": [
      'ٱلنَّخۡلَةِ',
      'الشَجرةِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "فَكُلِي وَٱشۡرَبِي وَقَرِّي عَيۡنٗاۖ فَإِمَّا تَرَيِنَّ مِنَ ٱلۡبَشَرِ أَحَدٗا فَقُولِيٓ إِنِّي نَذَرۡتُ لِلرَّحۡمَٰنِ صَوۡمٗا فَلَنۡ ..... ٱلۡيَوۡمَ إِنسِيّٗا",
    "options": [
      'أُحَدِّثَ',
      'أُكَلِّمَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "تبدأ سورة طه ب ....",
    "options": [
      '	طه * مَآ أَنزَلۡنَا عَلَيۡكَ ٱلۡقُرۡءَانَ لِتَشۡقَىٰٓ',
      'تَبَٰرَكَ ٱلَّذِي بِيَدِهِ ٱلۡمُلۡكُ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِير',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "وَمَا تِلۡكَ بِيَمِينِكَ يَٰمُوسَىٰ * قَالَ هِيَ عَصَايَ ..... عَلَيۡهَا وَأَهُشُّ بِهَا عَلَىٰ غَنَمِي وَلِيَ فِيهَا مَـَٔارِبُ أُخۡرَىٰ",
    "options": [
      'أَمشِي',
      'أَتَوَكَّؤُاْ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "وَٱضۡمُمۡ يَدَكَ إِلَىٰ جَنَاحِكَ تَخۡرُجۡ .... مِنۡ غَيۡرِ سُوٓءٍ ءَايَةً أُخۡرَىٰ",
    "options": [
      'سَودَآءَ',
      'بَيۡضَآءَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "قَالَ رَبِّ ٱشۡرَحۡ لِي صَدۡرِي * وَيَسِّرۡ لِيٓ أَمۡرِي * وَٱحۡلُلۡ عُقۡدَةٗ مِّن لِّسَانِي * يَفۡقَهُواْ قَوۡلِي * وَٱجۡعَل لِّي ..... مِّنۡ أَهۡلِي",
    "options": [
      'وَزِيرٗا',
      'صَاحِبَاً',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "إِذۡ أَوۡحَيۡنَآ إِلَىٰٓ أُمِّكَ مَا يُوحَىٰٓ * أَنِ ٱقۡذِفِيهِ فِي ..... فَٱقۡذِفِيهِ فِي ٱلۡيَمِّ فَلۡيُلۡقِهِ ٱلۡيَمُّ بِٱلسَّاحِلِ يَأۡخُذۡهُ عَدُوّٞ لِّي وَعَدُوّٞ لَّهُۥۚ وَأَلۡقَيۡتُ عَلَيۡكَ مَحَبَّةٗ مِّنِّي وَلِتُصۡنَعَ عَلَىٰ عَيۡنِيٓ",
    "options": [
      'ٱلتَّابُوتِ',
      'الصَندُوقِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "وَمَنۡ أَعۡرَضَ عَن ذِكۡرِي فَإِنَّ لَهُۥ مَعِيشَةٗ ..... وَنَحۡشُرُهُۥ يَوۡمَ ٱلۡقِيَٰمَةِ أَعۡمَىٰ",
    "options": [
      'صَعبة',
      'ضَنكٗا',
    ],
    "answer_index": 1,
  },
];







const List partSeventeen =
[
  {
    "id": 1,
    "question": "تبدأ سورة الأنبياء ب .....",
    "options": [
      '	ٱقۡتَرَبَ لِلنَّاسِ حِسَابُهُمۡ وَهُمۡ فِي غَفۡلَةٖ مُّعۡرِضُونَ',
      'الٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ وَقُرۡءَانٖ مُّبِينٖ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "(أَوَ لَمۡ يَرَ ٱلَّذِينَ كَفَرُوٓاْ أَنَّ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ كَانَتَا رَتۡقٗا فَفَتَقۡنَٰهُمَاۖ وَجَعَلۡنَا مِنَ ٱلۡمَآءِ كُلَّ شَيۡءٍ حَيٍّۚ أَفَلَا يُؤۡمِنُونَ) معنى رَتۡقٗا",
    "options": [
      'منفصلتين',
      'ملتصقتين',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "(قُلۡ مَن يَكۡلَؤُكُم بِٱلَّيۡلِ وَٱلنَّهَارِ مِنَ ٱلرَّحۡمَٰنِۚ بَلۡ هُمۡ عَن ذِكۡرِ رَبِّهِم مُّعۡرِضُونَ) معنى يَكۡلَؤُكُم....",
    "options": [
      '	يحفظكم ويحرسكم',
      '	يخوفكم',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "وَلَقَدۡ ءَاتَيۡنَآ إِبۡرَٰهِيمَ رُشۡدَهُۥ مِن قَبۡلُ وَكُنَّا بِهِۦ عَٰلِمِينَ * إِذۡ قَالَ لِأَبِيهِ وَقَوۡمِهِۦ مَا هَٰذِهِ ..... ٱلَّتِيٓ أَنتُمۡ لَهَا عَٰكِفُونَ",
    "options": [
      'ٱلتَّمَاثِيلُ',
      'الحِجَارةُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "قُلۡنَا يَٰنَارُ كُونِي .... وَسَلَٰمًا عَلَىٰٓ إِبۡرَٰهِيمَ",
    "options": [
      'جَحِيماً',
      'بَرۡدٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "فَفَهَّمۡنَٰهَا سُلَيۡمَٰنَۚ وَكُلًّا ءَاتَيۡنَا حُكۡمٗا وَعِلۡمٗاۚ وَسَخَّرۡنَا مَعَ دَاوُۥدَ .... يُسَبِّحۡنَ وَٱلطَّيۡرَۚ وَكُنَّا فَٰعِلِينَ",
    "options": [
      'ٱلۡجِبَالَ',
      'الأَرضَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "وَأَيُّوبَ إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ... وَأَنتَ أَرۡحَمُ ٱلرَّٰحِمِينَ",
    "options": [
      'الحُزنُ',
      'ٱلضُّرُّ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "..... إِذ ذَّهَبَ مُغَٰضِبٗا فَظَنَّ أَن لَّن نَّقۡدِرَ عَلَيۡهِ فَنَادَىٰ فِي ٱلظُّلُمَٰتِ أَن لَّآ إِلَٰهَ إِلَّآ أَنتَ سُبۡحَٰنَكَ إِنِّي كُنتُ مِنَ ٱلظَّٰلِمِينَ",
    "options": [
      '	وَذَا ٱلنُّونِ',
      '	وَمُوسىٰ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "وَزَكَرِيَّآ إِذۡ نَادَىٰ رَبَّهُۥ رَبِّ لَا تَذَرۡنِي .... وَأَنتَ خَيۡرُ ٱلۡوَٰرِثِينَ",
    "options": [
      'وَحيِداً',
      'فَرۡدٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": " تبدأ سورة الحج ب....",
    "options": [
      '	يَٰٓأَيُّهَا ٱلنَّاسُ ٱتَّقُواْ رَبَّكُمۡۚ إِنَّ زَلۡزَلَةَ ٱلسَّاعَةِ شَيۡءٌ عَظِيمٞ',
      '	طه * مَآ أَنزَلۡنَا عَلَيۡكَ ٱلۡقُرۡءَانَ لِتَشۡقَىٰٓ',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "وَمِنَ ٱلنَّاسِ مَن يَعۡبُدُ ٱللَّهَ عَلَىٰ ..... فَإِنۡ أَصَابَهُۥ خَيۡرٌ ٱطۡمَأَنَّ بِهِۦۖ وَإِنۡ أَصَابَتۡهُ فِتۡنَةٌ ٱنقَلَبَ عَلَىٰ وَجۡهِهِۦ خَسِرَ ٱلدُّنۡيَا وَٱلۡأٓخِرَةَۚ ذَٰلِكَ هُوَ ٱلۡخُسۡرَانُ ٱلۡمُبِينُ",
    "options": [
      'حَرۡفٖۖ',
      'ضِعف',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "وَإِذۡ بَوَّأۡنَا لِإِبۡرَٰهِيمَ مَكَانَ ٱلۡبَيۡتِ أَن لَّا تُشۡرِكۡ بِي شَيۡـٔٗا ..... بَيۡتِيَ لِلطَّآئِفِينَ وَٱلۡقَآئِمِينَ وَٱلرُّكَّعِ ٱلسُّجُودِ",
    "options": [
      'وَنظِف',
      'وَطَهِّرۡ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "لَن يَنَالَ ٱللَّهَ لُحُومُهَا وَلَا ..... وَلَٰكِن يَنَالُهُ ٱلتَّقۡوَىٰ مِنكُمۡۚ كَذَٰلِكَ سَخَّرَهَا لَكُمۡ لِتُكَبِّرُواْ ٱللَّهَ عَلَىٰ مَا هَدَىٰكُمۡۗ وَبَشِّرِ ٱلۡمُحۡسِنِينَ",
    "options": [
      'جُلودَها',
      'دِمَآؤُهَا',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "أَلَمۡ تَرَ أَنَّ ٱللَّهَ أَنزَلَ مِنَ ٱلسَّمَآءِ ..... فَتُصۡبِحُ ٱلۡأَرۡضُ مُخۡضَرَّةًۚ إِنَّ ٱللَّهَ لَطِيفٌ خَبِيرٞ",
    "options": [
      'نَآرَ',
      'مَآءٗ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "يَٰٓأَيُّهَا ٱلنَّاسُ ضُرِبَ مَثَلٞ فَٱسۡتَمِعُواْ لَهُۥٓۚ إِنَّ ٱلَّذِينَ تَدۡعُونَ مِن دُونِ ٱللَّهِ لَن يَخۡلُقُواْ ... وَلَوِ ٱجۡتَمَعُواْ لَهُۥۖ وَإِن يَسۡلُبۡهُمُ ٱلذُّبَابُ شَيۡـٔٗا لَّا يَسۡتَنقِذُوهُ مِنۡهُۚ ضَعُفَ ٱلطَّالِبُ وَٱلۡمَطۡلُوبُ",
    "options": [
      '	ذُبَابٗا',
      'بَعُوضاً',
    ],
    "answer_index": 0,
  },
];






const List partEighteen =
[
  {
    "id": 1,
    "question": "تبدأ سورة المؤمنون ب .....",
    "options": [
      '	قَدۡ أَفۡلَحَ ٱلۡمُؤۡمِنُونَ *ٱلَّذِينَ هُمۡ فِي صَلَاتِهِمۡ خَٰشِعُونَ',
      '	الٓمٓرۚ تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِۗ وَٱلَّذِيٓ أُنزِلَ إِلَيۡكَ مِن رَّبِّكَ ٱلۡحَقُّ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يُؤۡمِنُون',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ مِن سُلَٰلَةٖ مِّن .....",
    "options": [
      'نَار',
      'طِينٖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من النبي المقصود في هذه الآية(فَأَوۡحَيۡنَآ إِلَيۡهِ أَنِ ٱصۡنَعِ ٱلۡفُلۡكَ بِأَعۡيُنِنَا وَوَحۡيِنَا فَإِذَا جَآءَ أَمۡرُنَا وَفَارَ ٱلتَّنُّورُ فَٱسۡلُكۡ فِيهَا مِن كُلّٖ زَوۡجَيۡنِ ٱثۡنَيۡنِ وَأَهۡلَكَ إِلَّا مَن سَبَقَ عَلَيۡهِ ٱلۡقَوۡلُ مِنۡهُمۡۖ وَلَا تُخَٰطِبۡنِي فِي ٱلَّذِينَ ظَلَمُوٓاْ إِنَّهُم مُّغۡرَقُونَ)",
    "options": [
      '	نبي الله نوح',
      '	نبي الله موسى',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "فَمَن ثَقُلَتۡ مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ هُمُ .....",
    "options": [
      'الخَاسِرونَ',
      'ٱلۡمُفۡلِحُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "وَمَنۡ ..... مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ ٱلَّذِينَ خَسِرُوٓاْ أَنفُسَهُمۡ فِي جَهَنَّمَ خَٰلِدُونَ",
    "options": [
      'خَفَّتۡ',
      'ثَقُلَتۡ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " تبدأ سورة النور ب ...",
    "options": [
      'ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَاۜ',
      '	سُورَةٌ أَنزَلۡنَٰهَا وَفَرَضۡنَٰهَا وَأَنزَلۡنَا فِيهَآ ءَايَٰتِۭ بَيِّنَٰتٖ لَّعَلَّكُمۡ تَذَكَّرُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " (وَٱلَّذِينَ يَرۡمُونَ ٱلۡمُحۡصَنَٰتِ ثُمَّ لَمۡ يَأۡتُواْ بِأَرۡبَعَةِ شُهَدَآءَ فَٱجۡلِدُوهُمۡ ثَمَٰنِينَ جَلۡدَةٗ وَلَا تَقۡبَلُواْ لَهُمۡ شَهَٰدَةً أَبَدٗاۚ وَأُوْلَٰٓئِكَ هُمُ ٱلۡفَٰسِقُونَ) معنى ٱلۡمُحۡصَنَٰتِ...",
    "options": [
      'الزانيات',
      'العفيفات',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "إِنَّ ٱلَّذِينَ يَرۡمُونَ ٱلۡمُحۡصَنَٰتِ ٱلۡغَٰفِلَٰتِ ٱلۡمُؤۡمِنَٰتِ .... فِي ٱلدُّنۡيَا وَٱلۡأٓخِرَةِ وَلَهُمۡ عَذَابٌ عَظِيمٞ ",
    "options": [
      'لُعِنُواْ',
      'أكرِموا',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَدۡخُلُواْ بُيُوتًا غَيۡرَ بُيُوتِكُمۡ حَتَّىٰ ..... وَتُسَلِّمُواْ عَلَىٰٓ أَهۡلِهَاۚ ذَٰلِكُمۡ خَيۡرٞ لَّكُمۡ لَعَلَّكُمۡ تَذَكَّرُونَ",
    "options": [
      'تَسۡتَأۡذنِواْ',
      'تَسۡتَأۡنِسُواْ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "وَقُل لِّلۡمُؤۡمِنَٰتِ يَغۡضُضۡنَ مِنۡ أَبۡصَٰرِهِنَّ وَيَحۡفَظۡنَ فُرُوجَهُنَّ وَلَا يُبۡدِينَ زِينَتَهُنَّ إِلَّا مَا ظَهَرَ مِنۡهَاۖ وَلۡيَضۡرِبۡنَ بِخُمُرِهِنَّ عَلَىٰ .....",
    "options": [
      'جُيُوبِهِنَّۖ',
      'لِباسهنَّ',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "ٱللَّهُ نُورُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ مَثَلُ نُورِهِۦ كَمِشۡكَوٰةٖ فِيهَا مِصۡبَاحٌۖ ٱلۡمِصۡبَاحُ فِي زُجَاجَةٍۖ ٱلزُّجَاجَةُ كَأَنَّهَا كَوۡكَبٞ دُرِّيّٞ يُوقَدُ مِن شَجَرَةٖ مُّبَٰرَكَةٖ زَيۡتُونَةٖ لَّا شَرۡقِيَّةٖ وَلَا غَرۡبِيَّةٖ يَكَادُ زَيۡتُهَا ..... وَلَوۡ لَمۡ تَمۡسَسۡهُ نَارٞۚ نُّورٌ عَلَىٰ نُورٖۚ يَهۡدِي ٱللَّهُ لِنُورِهِۦ مَن يَشَآءُۚ",
    "options": [
      'يُظلمُ',
      'يُضِيٓءُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": " تبدأ سورة الفرقان ب .....",
    "options": [
      '	تَبَارَكَ ٱلَّذِي نَزَّلَ ٱلۡفُرۡقَانَ عَلَىٰ عَبۡدِهِۦ لِيَكُونَ لِلۡعَٰلَمِينَ نَذِيرًا',
      '	وَٱلشَّمۡسِ وَضُحَىٰهَا وَٱلۡقَمَرِ إِذَا تَلَىٰهَا',
    ],
    "answer_index": 0,
  },
];





const List partNineteen =
[
  {
    "id": 1,
    "question": "(وَهُوَ ٱلَّذِي مَرَجَ ٱلۡبَحۡرَيۡنِ هَٰذَا عَذۡبٞ فُرَاتٞ وَهَٰذَا مِلۡحٌ أُجَاجٞ وَجَعَلَ بَيۡنَهُمَا بَرۡزَخٗا وَحِجۡرٗا مَّحۡجُورٗا) معنى مرج...",
    "options": [
      'خلط',
      'فصل',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "وَعِبَادُ ٱلرَّحۡمَٰنِ ٱلَّذِينَ يَمۡشُونَ عَلَى ٱلۡأَرۡضِ ..... وَإِذَا خَاطَبَهُمُ ٱلۡجَٰهِلُونَ قَالُواْ سَلَٰمٗا",
    "options": [
      'تَكبُراً',
      'هَوۡنٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "وَٱلَّذِينَ يَقُولُونَ رَبَّنَا ..... عَنَّا عَذَابَ جَهَنَّمَۖ إِنَّ عَذَابَهَا كَانَ غَرَامًا",
    "options": [
      'ٱصۡرِفۡ',
      'قَرِب',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": " تبدأ سورة الشعراء ب ....",
    "options": [
      'طسٓۚ تِلۡكَ ءَايَٰتُ ٱلۡقُرۡءَانِ وَكِتَابٖ مُّبِينٍ (1) هُدٗى وَبُشۡرَىٰ لِلۡمُؤۡمِنِينََ',
      '	طسٓمٓ (1) تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "وَإِذۡ نَادَىٰ رَبُّكَ مُوسَىٰٓ أَنِ ٱئۡتِ ٱلۡقَوۡمَ ٱلظَّٰلِمِينَ * قَوۡمَ ..... أَلَا يَتَّقُونَ",
    "options": [
      'فِرۡعَوۡنَۚ',
      'مَديَنَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "فَأَلۡقَىٰ عَصَاهُ فَإِذَا هِيَ .... مُّبِينٞ",
    "options": [
      'ثُعۡبَانٞ',
      'عَقرَبٌ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "فَأَلۡقَوۡاْ حِبَالَهُمۡ وَعِصِيَّهُمۡ وَقَالُواْ بِعِزَّةِ فِرۡعَوۡنَ إِنَّا لَنَحۡنُ ٱلۡغَٰلِبُونَ* فَأَلۡقَىٰ مُوسَىٰ عَصَاهُ فَإِذَا هِيَ .... مَا يَأۡفِكُونَ",
    "options": [
      'تَأكلُ',
      'تَلۡقَفُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "قَالَ هَٰذِهِۦ نَاقَةٞ لَّهَا شِرۡبٞ وَلَكُمۡ شِرۡبُ يَوۡمٖ مَّعۡلُومٖ * وَلَا تَمَسُّوهَا بِسُوٓءٖ فَيَأۡخُذَكُمۡ عَذَابُ يَوۡمٍ عَظِيمٖ (* .... فَأَصۡبَحُواْ نَٰدِمِينَ",
    "options": [
      'فَذَبَحُوهَا',
      'فَعَقَرُوهَا',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "تبدأ سورة النمل ب ....",
    "options": [
      'طسٓۚ تِلۡكَ ءَايَٰتُ ٱلۡقُرۡءَانِ وَكِتَابٖ مُّبِينٍ (1) هُدٗى وَبُشۡرَىٰ لِلۡمُؤۡمِنِينَ',
      'طسٓمٓ (1) تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِين',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "وَأَدۡخِلۡ يَدَكَ فِي جَيۡبِكَ تَخۡرُجۡ ..... مِنۡ غَيۡرِ سُوٓءٖۖ فِي تِسۡعِ ءَايَٰتٍ إِلَىٰ فِرۡعَوۡنَ وَقَوۡمِهِۦٓۚ إِنَّهُمۡ كَانُواْ قَوۡمٗا فَٰسِقِينَ",
    "options": [
      'بَيۡضَآءَ',
      'جَمِيلةَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "حَتَّىٰٓ إِذَآ أَتَوۡاْ عَلَىٰ وَادِ ..... قَالَتۡ نَمۡلَةٞ يَٰٓأَيُّهَا ٱلنَّمۡلُ ٱدۡخُلُواْ مَسَٰكِنَكُمۡ لَا يَحۡطِمَنَّكُمۡ سُلَيۡمَٰنُ وَجُنُودُهُۥ وَهُمۡ لَا يَشۡعُرُونَ",
    "options": [
      'ٱلنَّحلِ',
      'ٱلنَّمۡلِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "من النبي المقصود في هذه الآية (فَتَبَسَّمَ ضَاحِكٗا مِّن قَوۡلِهَا وَقَالَ رَبِّ أَوۡزِعۡنِيٓ أَنۡ أَشۡكُرَ نِعۡمَتَكَ ٱلَّتِيٓ أَنۡعَمۡتَ عَلَيَّ وَعَلَىٰ وَٰلِدَيَّ وَأَنۡ أَعۡمَلَ صَٰلِحٗا تَرۡضَىٰهُ وَأَدۡخِلۡنِي بِرَحۡمَتِكَ فِي عِبَادِكَ ٱلصَّٰلِحِينَ)",
    "options": [
      '	نبي الله سليمان',
      '	نبي الله موسى',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "وَتَفَقَّدَ ٱلطَّيۡرَ فَقَالَ مَا لِيَ لَآ أَرَى ..... أَمۡ كَانَ مِنَ ٱلۡغَآئِبِينَ",
    "options": [
      'ٱلۡهُدۡهُدَ',
      'الغُرابَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "( فَقَالَ أَحَطتُ بِمَا لَمۡ تُحِطۡ بِهِۦ وَجِئۡتُكَ مِن سَبَإِۭ بِنَبَإٖ يَقِينٍ * إِنِّي وَجَدتُّ ٱمۡرَأَةٗ تَمۡلِكُهُمۡ وَأُوتِيَتۡ مِن كُلِّ شَيۡءٖ وَلَهَا عَرۡشٌ عَظِيمٞ ) قائل هذه الآية",
    "options": [
      'النملة',
      'الهدهد',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "من قائلة هذه الآية (قَالَتۡ يَٰٓأَيُّهَا ٱلۡمَلَؤُاْ إِنِّيٓ أُلۡقِيَ إِلَيَّ كِتَٰبٞ كَرِيمٌ *إِنَّهُۥ مِن سُلَيۡمَٰنَ وَإِنَّهُۥ بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ)",
    "options": [
      '	ملكة سبأ',
      '	امرأة فرعون',
    ],
    "answer_index": 0,
  },
];






const List partTwenty =
[
  {
    "id": 1,
    "question": "فَمَا كَانَ جَوَابَ قَوۡمِهِۦٓ إِلَّآ أَن قَالُوٓاْ أَخۡرِجُوٓاْ ءَالَ لُوطٖ مِّن قَرۡيَتِكُمۡۖ إِنَّهُمۡ أُنَاسٞ ....",
    "options": [
      'فَاسِقونَ',
      'يَتَطَهَّرُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "أَمَّن يُجِيبُ ٱلۡمُضۡطَرَّ إِذَا ..... وَيَكۡشِفُ ٱلسُّوٓءَ وَيَجۡعَلُكُمۡ خُلَفَآءَ ٱلۡأَرۡضِۗ أَءِلَٰهٞ مَّعَ ٱللَّهِۚ قَلِيلٗا مَّا تَذَكَّرُونَ",
    "options": [
      'دَعَاهُ',
      'سَأَلَهُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " تبدأ سورة القصص ب ....",
    "options": [
      '	قُلۡ أُوحِيَ إِلَيَّ أَنَّهُ ٱسۡتَمَعَ نَفَرٞ مِّنَ ٱلۡجِنِّ فَقَالُوٓاْ إِنَّا سَمِعۡنَا قُرۡءَانًا عَجَبٗا',
      '	طسٓمٓ * تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ * نَتۡلُواْ عَلَيۡكَ مِن نَّبَإِ مُوسَىٰ وَفِرۡعَوۡنَ بِٱلۡحَقِّ لِقَوۡمٖ يُؤۡمِنُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "وَأَوۡحَيۡنَآ إِلَىٰٓ أُمِّ مُوسَىٰٓ أَنۡ ..... فَإِذَا خِفۡتِ عَلَيۡهِ فَأَلۡقِيهِ فِي ٱلۡيَمِّ وَلَا تَخَافِي وَلَا تَحۡزَنِيٓۖ إِنَّا رَآدُّوهُ إِلَيۡكِ وَجَاعِلُوهُ مِنَ ٱلۡمُرۡسَلِينَ",
    "options": [
      'أَطعِمِيهِ',
      'أَرۡضِعِيهِۖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "وَقَالَتِ .....قُرَّتُ عَيۡنٖ لِّي وَلَكَۖ لَا تَقۡتُلُوهُ عَسَىٰٓ أَن يَنفَعَنَآ أَوۡ نَتَّخِذَهُۥ وَلَدٗا وَهُمۡ لَا يَشۡعُرُونَ",
    "options": [
      '	ٱمۡرَأَتُ فِرۡعَوۡنَ',
      'ٱمۡرَأَتُ العَزِيزِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "وَأَصۡبَحَ فُؤَادُ أُمِّ مُوسَىٰ .... إِن كَادَتۡ لَتُبۡدِي بِهِۦ لَوۡلَآ أَن رَّبَطۡنَا عَلَىٰ قَلۡبِهَا لِتَكُونَ مِنَ ٱلۡمُؤۡمِنِينَ",
    "options": [
      'حَزيناً',
      'فَٰرِغًاۖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "وَحَرَّمۡنَا عَلَيۡهِ ..... مِن قَبۡلُ فَقَالَتۡ هَلۡ أَدُلُّكُمۡ عَلَىٰٓ أَهۡلِ بَيۡتٖ يَكۡفُلُونَهُۥ لَكُمۡ وَهُمۡ لَهُۥ نَٰصِحُون",
    "options": [
      'ٱلۡمَرَاضِعَ',
      'المُربِيات',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "وَجَآءَ رَجُلٞ مِّنۡ أَقۡصَا ٱلۡمَدِينَةِ يَسۡعَىٰ قَالَ يَٰمُوسَىٰٓ إِنَّ ٱلۡمَلَأَ ..... بِكَ لِيَقۡتُلُوكَ فَٱخۡرُجۡ إِنِّي لَكَ مِنَ ٱلنَّٰصِحِينَ",
    "options": [
      'يَتَربَصونَ',
      'يَأۡتَمِرُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "وَلَمَّا وَرَدَ مَآءَ مَدۡيَنَ وَجَدَ عَلَيۡهِ أُمَّةٗ مِّنَ ٱلنَّاسِ يَسۡقُونَ وَوَجَدَ مِن دُونِهِمُ ...... تَذُودَانِۖ قَالَ مَا خَطۡبُكُمَاۖ قَالَتَا لَا نَسۡقِي حَتَّىٰ يُصۡدِرَ ٱلرِّعَآءُۖ وَأَبُونَا شَيۡخٞ كَبِيرٞ",
    "options": [
      'ٱمۡرَأَتَيۡنِ',
      'فَتَاتينِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "فَسَقَىٰ لَهُمَا ثُمَّ تَوَلَّىٰٓ إِلَى ٱلظِّلِّ فَقَالَ رَبِّ إِنِّي لِمَآ أَنزَلۡتَ إِلَيَّ مِنۡ خَيۡرٖ .....",
    "options": [
      'فَقِيرٞ',
      'كَثِير',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "قَالَ إِنِّيٓ أُرِيدُ أَنۡ ... إِحۡدَى ٱبۡنَتَيَّ هَٰتَيۡنِ عَلَىٰٓ أَن تَأۡجُرَنِي ثَمَٰنِيَ حِجَجٖۖ فَإِنۡ أَتۡمَمۡتَ عَشۡرٗا فَمِنۡ عِندِكَۖ وَمَآ أُرِيدُ أَنۡ أَشُقَّ عَلَيۡكَۚ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ مِنَ ٱلصَّٰلِحِينَ",
    "options": [
      'أزوجَكَ',
      'أُنكِحَكَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "قَالَ سَنَشُدُّ عَضُدَكَ ..... وَنَجۡعَلُ لَكُمَا سُلۡطَٰنٗا فَلَا يَصِلُونَ إِلَيۡكُمَا بِـَٔايَٰتِنَآۚ أَنتُمَا وَمَنِ ٱتَّبَعَكُمَا ٱلۡغَٰلِبُونَ",
    "options": [
      'بِأَخِيكَ',
      'بِأَبيكَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "وَقَالَ فِرۡعَوۡنُ يَٰٓأَيُّهَا ٱلۡمَلَأُ مَا عَلِمۡتُ لَكُم مِّنۡ إِلَٰهٍ غَيۡرِي فَأَوۡقِدۡ لِي يَٰهَٰمَٰنُ عَلَى ٱلطِّينِ فَٱجۡعَل لِّي ..... لَّعَلِّيٓ أَطَّلِعُ إِلَىٰٓ إِلَٰهِ مُوسَىٰ وَإِنِّي لَأَظُنُّهُۥ مِنَ ٱلۡكَٰذِبِينَ",
    "options": [
      'قَصراً',
      'صَرۡحٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": " تبدأ سورة العنكبوت ب ....",
    "options": [
      'الٓمٓ (1) أَحَسِبَ ٱلنَّاسُ أَن يُتۡرَكُوٓاْ أَن يَقُولُوٓاْ ءَامَنَّا وَهُمۡ لَا يُفۡتَنُونَ',
      '	طسٓمٓ * تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡمُبِينِ * نَتۡلُواْ عَلَيۡكَ مِن نَّبَإِ مُوسَىٰ وَفِرۡعَوۡنَ بِٱلۡحَقِّ لِقَوۡمٖ يُؤۡمِنُون',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": " مَثَلُ ٱلَّذِينَ ٱتَّخَذُواْ مِن دُونِ ٱللَّهِ أَوۡلِيَآءَ كَمَثَلِ ٱلۡعَنكَبُوتِ ٱتَّخَذَتۡ بَيۡتٗاۖ وَإِنَّ ..... ٱلۡبُيُوتِ لَبَيۡتُ ٱلۡعَنكَبُوتِۚ لَوۡ كَانُواْ يَعۡلَمُونَ",
    "options": [
      'أَقوَى',
      'أَوۡهَنَ',
    ],
    "answer_index": 1,
  },
];





const List partTwentyOne =
[
  {
    "id": 1,
    "question": "تبدأ سورة الروم ب ...",
    "options": [
      '	الٓمٓ (1) غُلِبَتِ ٱلرُّومُ (2) فِيٓ أَدۡنَى ٱلۡأَرۡضِ وَهُم مِّنۢ بَعۡدِ غَلَبِهِمۡ سَيَغۡلِبُونَ',
      'الٓمٓ (1) أَحَسِبَ ٱلنَّاسُ أَن يُتۡرَكُوٓاْ أَن يَقُولُوٓاْ ءَامَنَّا وَهُمۡ لَا يُفۡتَنُون',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "وَمِنۡ ءَايَٰتِهِۦٓ أَنۡ خَلَقَكُم مِّن ..... ثُمَّ إِذَآ أَنتُم بَشَرٞ تَنتَشِرُونَ",
    "options": [
      'نَار',
      'تُرَابٖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "فَأَقِمۡ وَجۡهَكَ لِلدِّينِ .... فِطۡرَتَ ٱللَّهِ ٱلَّتِي فَطَرَ ٱلنَّاسَ عَلَيۡهَاۚ لَا تَبۡدِيلَ لِخَلۡقِ ٱللَّهِۚ ذَٰلِكَ ٱلدِّينُ ٱلۡقَيِّمُ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ",
    "options": [
      'حَنِيفٗاۚ',
      'القَيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "تبدأ سورة لقمان ب ....",
    "options": [
      '	الٓمٓ (1) غُلِبَتِ ٱلرُّومُ (2) فِيٓ أَدۡنَى ٱلۡأَرۡضِ وَهُم مِّنۢ بَعۡدِ غَلَبِهِمۡ سَيَغۡلِبُون',
      '	الٓمٓ (1) تِلۡكَ ءَايَٰتُ ٱلۡكِتَٰبِ ٱلۡحَكِيمِ (2) هُدٗى وَرَحۡمَةٗ لِّلۡمُحۡسِنِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "وَإِذۡ قَالَ لُقۡمَٰنُ ..... وَهُوَ يَعِظُهُۥ يَٰبُنَيَّ لَا تُشۡرِكۡ بِٱللَّهِۖ إِنَّ ٱلشِّرۡكَ لَظُلۡمٌ عَظِيمٞ",
    "options": [
      'لِٱبۡنِهِۦ',
      'لأَبِيهِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ .... حَمَلَتۡهُ أُمُّهُۥ وَهۡنًا عَلَىٰ وَهۡنٖ وَفِصَٰلُهُۥ فِي عَامَيۡنِ أَنِ ٱشۡكُرۡ لِي وَلِوَٰلِدَيۡكَ إِلَيَّ ٱلۡمَصِيرُ",
    "options": [
      'بِأَبنائهِ',
      'بِوَٰلِدَيۡهِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "وَلَا تُصَعِّرۡ خَدَّكَ لِلنَّاسِ وَلَا تَمۡشِ فِي ٱلۡأَرۡضِ .... إِنَّ ٱللَّهَ لَا يُحِبُّ كُلَّ مُخۡتَالٖ فَخُو",
    "options": [
      'مَرَحًاۖ',
      'مُتوَاضِعاً',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "وَٱقۡصِدۡ فِي مَشۡيِكَ وَٱغۡضُضۡ مِن صَوۡتِكَۚ إِنَّ أَنكَرَ ٱلۡأَصۡوَٰتِ لَصَوۡتُ ...",
    "options": [
      'الكِلابِ',
      'ٱلۡحَمِيرِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "تبدأ سورة السجدة ب ....",
    "options": [
      '	الٓمٓ (1) تَنزِيلُ ٱلۡكِتَٰبِ لَا رَيۡبَ فِيهِ مِن رَّبِّ ٱلۡعَٰلَمِينَ',
      '	الٓمٓ (1) غُلِبَتِ ٱلرُّومُ (2) فِيٓ أَدۡنَى ٱلۡأَرۡضِ وَهُم مِّنۢ بَعۡدِ غَلَبِهِمۡ سَيَغۡلِبُون',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "ٱلَّذِيٓ أَحۡسَنَ كُلَّ شَيۡءٍ خَلَقَهُۥۖ وَبَدَأَ خَلۡقَ ٱلۡإِنسَٰنِ مِن ....",
    "options": [
      'طِينٖ',
      'مَاء',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "تَتَجَافَىٰ .... عَنِ ٱلۡمَضَاجِعِ يَدۡعُونَ رَبَّهُمۡ خَوۡفٗا وَطَمَعٗا وَمِمَّا رَزَقۡنَٰهُمۡ يُنفِقُونَ",
    "options": [
      'أَجسادُهم',
      'جُنُوبُهُمۡ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "تبدأ سورة الأحزاب ب ....",
    "options": [
      '	الٓمٓ (1) تَنزِيلُ ٱلۡكِتَٰبِ لَا رَيۡبَ فِيهِ مِن رَّبِّ ٱلۡعَٰلَمِين',
      '	يَٰٓأَيُّهَا ٱلنَّبِيُّ ٱتَّقِ ٱللَّهَ وَلَا تُطِعِ ٱلۡكَٰفِرِينَ وَٱلۡمُنَٰفِقِينَۚ إِنَّ ٱللَّهَ كَانَ عَلِيمًا حَكِيمٗا',
    ],
    "answer_index": 1,
  },
];




const List partTwentyTwo =
[
  {
    "id": 1,
    "question": "يَٰنِسَآءَ ٱلنَّبِيِّ لَسۡتُنَّ كَأَحَدٖ مِّنَ ٱلنِّسَآءِ إِنِ ٱتَّقَيۡتُنَّۚ فَلَا تَخۡضَعۡنَ ..... فَيَطۡمَعَ ٱلَّذِي فِي قَلۡبِهِۦ مَرَضٞ وَقُلۡنَ قَوۡلٗا مَّعۡرُوفٗا",
    "options": [
      'بِٱلۡقَوۡلِ',
      'بِٱلۡفِعلِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "مَّا كَانَ ..... أَبَآ أَحَدٖ مِّن رِّجَالِكُمۡ وَلَٰكِن رَّسُولَ ٱللَّهِ وَخَاتَمَ ٱلنَّبِيِّـۧنَۗ وَكَانَ ٱللَّهُ بِكُلِّ شَيۡءٍ عَلِيمٗا",
    "options": [
      'مُوسى',
      'مُحَمَّدٌ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "إِنَّ ٱللَّهَ وَمَلَٰٓئِكَتَهُۥ ..... يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ صَلُّواْ عَلَيۡهِ وَسَلِّمُواْ تَسۡلِيمًا",
    "options": [
      'يَستَغفِرونَ للنَّبي',
      '	يُصَلُّونَ عَلَى ٱلنَّبِيِّۚ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "تبدأ سورة سبأ ب ....",
    "options": [
      'ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِي لَهُۥ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ وَلَهُ ٱلۡحَمۡدُ فِي ٱلۡأٓخِرَةِۚ وَهُوَ ٱلۡحَكِيمُ ٱلۡخَبِيرُ',
      '	ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَاۜ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "وَلَقَدۡ ءَاتَيۡنَا دَاوُۥدَ مِنَّا فَضۡلٗاۖ يَٰجِبَالُ أَوِّبِي مَعَهُۥ وَٱلطَّيۡرَۖ وَأَلَنَّا لَهُ .....",
    "options": [
      'الذَهبَ',
      'ٱلۡحَدِيدَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من النبي المقصود في هذه الآية (فَلَمَّا قَضَيۡنَا عَلَيۡهِ ٱلۡمَوۡتَ مَا دَلَّهُمۡ عَلَىٰ مَوۡتِهِۦٓ إِلَّا دَآبَّةُ ٱلۡأَرۡضِ تَأۡكُلُ مِنسَأَتَهُۥۖ فَلَمَّا خَرَّ تَبَيَّنَتِ ٱلۡجِنُّ أَن لَّوۡ كَانُواْ يَعۡلَمُونَ ٱلۡغَيۡبَ مَا لَبِثُواْ فِي ٱلۡعَذَابِ ٱلۡمُهِينِ)",
    "options": [
      '	سليمان عليه السلام',
      '	زكريا عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "قُلۡ إِنَّ رَبِّي .... ٱلرِّزۡقَ لِمَن يَشَآءُ وَيَقۡدِرُ وَلَٰكِنَّ أَكۡثَرَ ٱلنَّاسِ لَا يَعۡلَمُونَ",
    "options": [
      'يُوسِعُ',
      'يَبۡسُطُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "تبدأ سورة فاطر ب ..",
    "options": [
      '	ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَا',
      '	ٱلۡحَمۡدُ لِلَّهِ فَاطِرِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ جَاعِلِ ٱلۡمَلَٰٓئِكَةِ رُسُلًا أُوْلِيٓ أَجۡنِحَةٖ مَّثۡنَىٰ وَثُلَٰثَ وَرُبَٰعَۚ يَزِيدُ فِي ٱلۡخَلۡقِ مَا يَشَآءُۚ إِنَّ ٱللَّهَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٞ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "إِنَّ ٱلشَّيۡطَٰنَ لَكُمۡ .... فَٱتَّخِذُوهُ عَدُوًّاۚ إِنَّمَا يَدۡعُواْ حِزۡبَهُۥ لِيَكُونُواْ مِنۡ أَصۡحَٰبِ ٱلسَّعِيرِ",
    "options": [
      'عَدُوّٞ',
      'صَاحِب',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "يَٰٓأَيُّهَا ٱلنَّاسُ أَنتُمُ ..... إِلَى ٱللَّهِۖ وَٱللَّهُ هُوَ ٱلۡغَنِيُّ ٱلۡحَمِيدُ",
    "options": [
      'الأَغنياءُ',
      'ٱلۡفُقَرَآءُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": " تبدأ سورة يس ب ....",
    "options": [
      'ٱلۡحَمۡدُ لِلَّهِ ٱلَّذِيٓ أَنزَلَ عَلَىٰ عَبۡدِهِ ٱلۡكِتَٰبَ وَلَمۡ يَجۡعَل لَّهُۥ عِوَجَا',
      '	يسٓ (1) وَٱلۡقُرۡءَانِ ٱلۡحَكِيمِ (2) إِنَّكَ لَمِنَ ٱلۡمُرۡسَلِينَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "وَجَعَلۡنَا مِنۢ بَيۡنِ أَيۡدِيهِمۡ سَدّٗا وَمِنۡ خَلۡفِهِمۡ سَدّٗا .... فَهُمۡ لَا يُبۡصِرُونَ",
    "options": [
      'فَأَغۡشَيۡنَٰهُمۡ',
      'فَأعمَينَاهُم',
    ],
    "answer_index": 0,
  },
];






const List partTwentyThree =
[
  {
    "id": 1,
    "question": "وَٱلۡقَمَرَ قَدَّرۡنَٰهُ مَنَازِلَ حَتَّىٰ عَادَ .... ٱلۡقَدِيمِ",
    "options": [
      'كَالنَخلِ',
      'كَٱلۡعُرۡجُونِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "وَضَرَبَ لَنَا مَثَلٗا وَنَسِيَ خَلۡقَهُۥۖ قَالَ مَن يُحۡيِ ٱلۡعِظَٰمَ وَهِيَ .....",
    "options": [
      'رَمِيمٞ',
      'بَالية',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " تبدأ سورة الصافات ب ....",
    "options": [
      '	وَٱلصَّٰٓفَّٰتِ صَفّٗا (1) فَٱلزَّٰجِرَٰتِ زَجۡرٗا (2) فَٱلتَّٰلِيَٰتِ ذِكۡرًا',
      '	وَٱلضُّحَىٰ (1) وَٱلَّيۡلِ إِذَا سَجَىٰ (2) مَا وَدَّعَكَ رَبُّكَ وَمَا قَلَىٰ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "أَذَٰلِكَ خَيۡرٞ نُّزُلًا أَمۡ شَجَرَةُ ٱلزَّقُّومِ * إِنَّا جَعَلۡنَٰهَا فِتۡنَةٗ لِّلظَّٰلِمِينَ * إِنَّهَا شَجَرَةٞ تَخۡرُجُ فِيٓ أَصۡلِ .... * طَلۡعُهَا كَأَنَّهُۥ رُءُوسُ ٱلشَّيَٰطِينِ",
    "options": [
      'الجَنةِ',
      'ٱلۡجَحِيمِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "فَلَمَّا بَلَغَ مَعَهُ ٱلسَّعۡيَ قَالَ يَٰبُنَيَّ إِنِّيٓ أَرَىٰ فِي ٱلۡمَنَامِ أَنِّيٓ .... فَٱنظُرۡ مَاذَا تَرَىٰۚ قَالَ يَٰٓأَبَتِ ٱفۡعَلۡ مَا تُؤۡمَرُۖ سَتَجِدُنِيٓ إِن شَآءَ ٱللَّهُ مِنَ ٱلصَّٰبِرِينَ",
    "options": [
      'أَذۡبَحُكَ',
      'اُزَوجك',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "وَإِنَّ يُونُسَ لَمِنَ ٱلۡمُرۡسَلِينَ * إِذۡ أَبَقَ إِلَى ٱلۡفُلۡكِ ٱلۡمَشۡحُونِ * فَسَاهَمَ فَكَانَ مِنَ ٱلۡمُدۡحَضِينَ * فَٱلۡتَقَمَهُ .... وَهُوَ مُلِيمٞ",
    "options": [
      'الفِيلُ',
      'ٱلۡحُوتُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "فَلَوۡلَآ أَنَّهُۥ كَانَ مِنَ .... * لَلَبِثَ فِي بَطۡنِهِۦٓ إِلَىٰ يَوۡمِ يُبۡعَثُونَ",
    "options": [
      'ٱلۡمُسَبِّحِينَ',
      'المُستَغفرينَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "تبدأ سورة ص...",
    "options": [
      'لَآ أُقۡسِمُ بِيَوۡمِ ٱلۡقِيَٰمَةِ (1) وَلَآ أُقۡسِمُ بِٱلنَّفۡسِ ٱللَّوَّامَةِ',
      'صٓۚ وَٱلۡقُرۡءَانِ ذِي ٱلذِّكۡرِ (1) بَلِ ٱلَّذِينَ كَفَرُواْ فِي عِزَّةٖ وَشِقَاقٖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من النبي المقصود في هذه الآية (قَالَ رَبِّ ٱغۡفِرۡ لِي وَهَبۡ لِي مُلۡكٗا لَّا يَنۢبَغِي لِأَحَدٖ مِّنۢ بَعۡدِيٓۖ إِنَّكَ أَنتَ ٱلۡوَهَّابُ)",
    "options": [
      '	سليمان عليه السلام',
      '	موسى عليه السلام',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "وَٱذۡكُرۡ عَبۡدَنَآ .... إِذۡ نَادَىٰ رَبَّهُۥٓ أَنِّي مَسَّنِيَ ٱلشَّيۡطَٰنُ بِنُصۡبٖ وَعَذَابٍ",
    "options": [
      'إسمَاعِيلَ',
      'أَيُّوبَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": " إِذۡ قَالَ رَبُّكَ لِلۡمَلَٰٓئِكَةِ إِنِّي خَٰلِقُۢ بَشَرٗا مِّن .....",
    "options": [
      'طِينٖ',
      'نَار',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "تبدأ سورة الزمر ب ....",
    "options": [
      'عَمَّ يَتَسَآءَلُونَ (1) عَنِ ٱلنَّبَإِ ٱلۡعَظِيمِ (2) ٱلَّذِي هُمۡ فِيهِ مُخۡتَلِفُونَ',
      '	تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ (1) إِنَّآ أَنزَلۡنَآ إِلَيۡكَ ٱلۡكِتَٰبَ بِٱلۡحَقِّ فَٱعۡبُدِ ٱللَّهَ مُخۡلِصٗا لَّهُ ٱلدِّينَ',
    ],
    "answer_index": 1,
  },
];







const List partTwentyFour =
[
  {
    "id": 1,
    "question": "(وَإِذَا ذُكِرَ ٱللَّهُ وَحۡدَهُ ٱشۡمَأَزَّتۡ قُلُوبُ ٱلَّذِينَ لَا يُؤۡمِنُونَ بِٱلۡأٓخِرَةِۖ وَإِذَا ذُكِرَ ٱلَّذِينَ مِن دُونِهِۦٓ إِذَا هُمۡ يَسۡتَبۡشِرُونَ) معنى ٱشۡمَأَزَّتۡ...",
    "options": [
      '	انجذبت وأحبت',
      'نفرت',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "قُلۡ يَٰعِبَادِيَ ٱلَّذِينَ أَسۡرَفُواْ عَلَىٰٓ أَنفُسِهِمۡ لَا ..... مِن رَّحۡمَةِ ٱللَّهِۚ إِنَّ ٱللَّهَ يَغۡفِرُ ٱلذُّنُوبَ جَمِيعًاۚ إِنَّهُۥ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ",
    "options": [
      'تَقۡنَطُواْ',
      'تَيأَسوا',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "أَن تَقُولَ نَفۡسٞ .... عَلَىٰ مَا فَرَّطتُ فِي جَنۢبِ ٱللَّهِ وَإِن كُنتُ لَمِنَ ٱلسَّٰخِرِينَ",
    "options": [
      'يَٰويلتَىٰ',
      'يَٰحَسۡرَتَىٰ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "وَيَوۡمَ ٱلۡقِيَٰمَةِ تَرَى ٱلَّذِينَ كَذَبُواْ عَلَى ٱللَّهِ وُجُوهُهُم .... أَلَيۡسَ فِي جَهَنَّمَ مَثۡوٗى لِّلۡمُتَكَبِّرِينَ",
    "options": [
      'بَيضاءَ',
      'مُّسۡوَدَّةٌۚ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "وَنُفِخَ فِي ٱلصُّورِ ..... مَن فِي ٱلسَّمَٰوَٰتِ وَمَن فِي ٱلۡأَرۡضِ إِلَّا مَن شَآءَ ٱللَّهُۖ ثُمَّ نُفِخَ فِيهِ أُخۡرَىٰ فَإِذَا هُمۡ قِيَامٞ يَنظُرُونَ",
    "options": [
      'فَصَعِقَ',
      'فَمَاتَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "وَسِيقَ ٱلَّذِينَ ٱتَّقَوۡاْ رَبَّهُمۡ إِلَى ... زُمَرًاۖ حَتَّىٰٓ إِذَا جَآءُوهَا وَفُتِحَتۡ أَبۡوَٰبُهَا وَقَالَ لَهُمۡ خَزَنَتُهَا سَلَٰمٌ عَلَيۡكُمۡ طِبۡتُمۡ فَٱدۡخُلُوهَا خَٰلِدِينَ",
    "options": [
      'جَهَنَّمَ',
      'ٱلۡجَنَّةِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "تبدأ سورة غافر ب ....",
    "options": [
      'حمٓ (1) تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡعَلِيمِ (2) غَافِرِ ٱلذَّنۢبِ وَقَابِلِ ٱلتَّوۡبِ شَدِيدِ ٱلۡعِقَابِ ذِي ٱلطَّوۡلِۖ لَآ إِلَٰهَ إِلَّا هُوَۖ إِلَيۡهِ ٱلۡمَصِيرُ',
      '	قُلۡ أُوحِيَ إِلَيَّ أَنَّهُ ٱسۡتَمَعَ نَفَرٞ مِّنَ ٱلۡجِنِّ فَقَالُوٓاْ إِنَّا سَمِعۡنَا قُرۡءَانًا عَجَبٗا (1) يَهۡدِيٓ إِلَى ٱلرُّشۡدِ فَـَٔامَنَّا بِهِۦۖ وَلَن نُّشۡرِكَ بِرَبِّنَآ أَحَدٗا',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "وَلَقَدۡ أَرۡسَلۡنَا .. بِـَٔايَٰتِنَا وَسُلۡطَٰنٖ مُّبِينٍ (23) إِلَىٰ فِرۡعَوۡنَ وَهَٰمَٰنَ وَقَٰرُونَ فَقَالُواْ سَٰحِرٞ كَذَّابٞ",
    "options": [
      'نُوح',
      'مُوسَىٰ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "وَقَالَ فِرۡعَوۡنُ ذَرُونِيٓ ..... مُوسَىٰ وَلۡيَدۡعُ رَبَّهُۥٓۖ إِنِّيٓ أَخَافُ أَن يُبَدِّلَ دِينَكُمۡ أَوۡ أَن يُظۡهِرَ فِي ٱلۡأَرۡضِ ٱلۡفَسَادَ",
    "options": [
      'أَقۡتُلۡ',
      'أُصاحِب',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "وَقَالَ ٱلَّذِينَ فِي ٱلنَّارِ لِخَزَنَةِ .... ٱدۡعُواْ رَبَّكُمۡ يُخَفِّفۡ عَنَّا يَوۡمٗا مِّنَ ٱلۡعَذَابِ",
    "options": [
      'الجَنةِ',
      'جَهَنَّمَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "تبدأ سورة فصلت ب ....",
    "options": [
      '	سَأَلَ سَآئِلُۢ بِعَذَابٖ وَاقِعٖ (1) لِّلۡكَٰفِرِينَ لَيۡسَ لَهُۥ دَافِعٞ (2) مِّنَ ٱللَّهِ ذِي ٱلۡمَعَارِجِ',
      '	حمٓ (1) تَنزِيلٞ مِّنَ ٱلرَّحۡمَٰنِ ٱلرَّحِيمِ (2) كِتَٰبٞ فُصِّلَتۡ ءَايَٰتُهُۥ قُرۡءَانًا عَرَبِيّٗا لِّقَوۡمٖ يَعۡلَمُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "وَإِمَّا يَنزَغَنَّكَ مِنَ ٱلشَّيۡطَٰنِ نَزۡغٞ ..... إِنَّهُۥ هُوَ ٱلسَّمِيعُ ٱلۡعَلِيمُ",
    "options": [
      '	فَٱسۡتَعِذۡ بِٱللَّهِۖ',
      '	فَاستَغفِر اللهِ',
    ],
    "answer_index": 0,
  },
];







const List partTwentyFive =
[
  {
    "id": 1,
    "question": " تبدأ سورة الشورى ب ....",
    "options": [
      '	إِذَا وَقَعَتِ ٱلۡوَاقِعَةُ (1) لَيۡسَ لِوَقۡعَتِهَا كَاذِبَةٌ (2) خَافِضَةٞ رَّافِعَةٌ',
      '	حمٓ (1) عٓسٓقٓ (2) كَذَٰلِكَ يُوحِيٓ إِلَيۡكَ وَإِلَى ٱلَّذِينَ مِن قَبۡلِكَ ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "تَكَادُ ٱلسَّمَٰوَٰتُ ..... مِن فَوۡقِهِنَّۚ وَٱلۡمَلَٰٓئِكَةُ يُسَبِّحُونَ بِحَمۡدِ رَبِّهِمۡ وَيَسۡتَغۡفِرُونَ لِمَن فِي ٱلۡأَرۡضِۗ أَلَآ إِنَّ ٱللَّهَ هُوَ ٱلۡغَفُورُ ٱلرَّحِيمُ",
    "options": [
      '	يَتَفَطَّرۡنَ',
      '	يتشققنَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": ".... ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ جَعَلَ لَكُم مِّنۡ أَنفُسِكُمۡ أَزۡوَٰجٗا وَمِنَ ٱلۡأَنۡعَٰمِ أَزۡوَٰجٗا يَذۡرَؤُكُمۡ فِيهِۚ لَيۡسَ كَمِثۡلِهِۦ شَيۡءٞۖ وَهُوَ ٱلسَّمِيعُ ٱلۡبَصِيرُ",
    "options": [
      'خَالقُ',
      'فَاطِرُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "فَلِذَٰلِكَ فَٱدۡعُۖ ...... كَمَآ أُمِرۡتَۖ وَلَا تَتَّبِعۡ أَهۡوَآءَهُمۡۖ وَقُلۡ ءَامَنتُ بِمَآ أَنزَلَ ٱللَّهُ",
    "options": [
      'وَٱسۡتَقِمۡ',
      'وخالف',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "وَهُوَ ٱلَّذِي يَقۡبَلُ ٱلتَّوۡبَةَ عَنۡ ..... وَيَعۡفُواْ عَنِ ٱلسَّيِّـَٔاتِ وَيَعۡلَمُ مَا تَفۡعَلُونَ",
    "options": [
      'الناس',
      'عِبَادِهِۦ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "وَهُوَ ٱلَّذِي .... ٱلتَّوۡبَةَ عَنۡ عِبَادِهِۦ وَيَعۡفُواْ عَنِ ٱلسَّيِّـَٔاتِ وَيَعۡلَمُ مَا تَفۡعَلُونَ",
    "options": [
      'يَقۡبَلُ',
      'يَرفضُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "وَلَوۡ بَسَطَ ٱللَّهُ ٱلرِّزۡقَ لِعِبَادِهِۦ .... فِي ٱلۡأَرۡضِ وَلَٰكِن يُنَزِّلُ بِقَدَرٖ مَّا يَشَآءُۚ إِنَّهُۥ بِعِبَادِهِۦ خَبِيرُۢ بَصِيرٞ",
    "options": [
      'لأَصلحوا',
      'لَبَغَوۡاْ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "وَٱلَّذِينَ ...... كَبَٰٓئِرَ ٱلۡإِثۡمِ وَٱلۡفَوَٰحِشَ وَإِذَا مَا غَضِبُواْ هُمۡ يَغۡفِرُونَ",
    "options": [
      'يَجۡتَنِبُونَ',
      'يفعَلونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " تبدأ سورة الزخرف ب ....",
    "options": [
      '	ٱقۡتَرَبَتِ ٱلسَّاعَةُ وَٱنشَقَّ ٱلۡقَمَرُ (1) وَإِن يَرَوۡاْ ءَايَةٗ يُعۡرِضُواْ وَيَقُولُواْ سِحۡرٞ مُّسۡتَمِرّٞ ',
      'حمٓ (1) وَٱلۡكِتَٰبِ ٱلۡمُبِينِ (2) إِنَّا جَعَلۡنَٰهُ قُرۡءَٰنًا عَرَبِيّٗا لَّعَلَّكُمۡ تَعۡقِلُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "وَلَقَدۡ أَرۡسَلۡنَا .... بِـَٔايَٰتِنَآ إِلَىٰ فِرۡعَوۡنَ وَمَلَإِيْهِۦ فَقَالَ إِنِّي رَسُولُ رَبِّ ٱلۡعَٰلَمِينَ",
    "options": [
      'مُوسَىٰ',
      'شُعيب',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "لۡأَخِلَّآءُ يَوۡمَئِذِۭ بَعۡضُهُمۡ لِبَعۡضٍ ..... إِلَّا ٱلۡمُتَّقِينَ",
    "options": [
      'صَاحب',
      'عَدُوٌّ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "تبدأ سورة الدخان ب ....",
    "options": [
      '	حمٓ (1) وَٱلۡكِتَٰبِ ٱلۡمُبِينِ (2) إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ إِنَّا كُنَّا مُنذِرِينَ',
      '	حمٓ (1) تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ (2) إِنَّ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّلۡمُؤۡمِنِينََ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "فَٱرۡتَقِبۡ يَوۡمَ تَأۡتِي .... بِدُخَانٖ مُّبِينٖ",
    "options": [
      'الأَرضُ',
      'ٱلسَّمَآءُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "تبدأ سورة الجاثية ب ...",
    "options": [
      '	حمٓ (1) تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ (2) إِنَّ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّلۡمُؤۡمِنِينَ',
      '	حمٓ (1) وَٱلۡكِتَٰبِ ٱلۡمُبِينِ (2) إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ إِنَّا كُنَّا مُنذِرِين',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "ٱللَّهُ ٱلَّذِي سَخَّرَ لَكُمُ ٱلۡبَحۡرَ لِتَجۡرِيَ .... فِيهِ بِأَمۡرِهِۦ وَلِتَبۡتَغُواْ مِن فَضۡلِهِۦ وَلَعَلَّكُمۡ تَشۡكُرُونَ",
    "options": [
      'الطَائرةَ',
      'ٱلۡفُلۡكُ',
    ],
    "answer_index": 1,
  },
];






const List partTwentySix =
[
  {
    "id": 1,
    "question": " تبدأ سورة الأحقاف ب .....",
    "options": [
      'حمٓ (1) تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ (2) إِنَّ فِي ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ لَأٓيَٰتٖ لِّلۡمُؤۡمِنِين',
      '	حمٓ (1) تَنزِيلُ ٱلۡكِتَٰبِ مِنَ ٱللَّهِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ (2) مَا خَلَقۡنَا ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضَ وَمَا بَيۡنَهُمَآ إِلَّا بِٱلۡحَقِّ وَأَجَلٖ مُّسَمّٗىۚ وَٱلَّذِينَ كَفَرُواْ عَمَّآ أُنذِرُواْ مُعۡرِضُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "وَوَصَّيۡنَا ٱلۡإِنسَٰنَ بِوَٰلِدَيۡهِ إِحۡسَٰنًاۖ حَمَلَتۡهُ أُمُّهُۥ ..... وَوَضَعَتۡهُ كُرۡهٗاۖ وَحَمۡلُهُۥ وَفِصَٰلُهُۥ ثَلَٰثُونَ شَهۡرًاۚ",
    "options": [
      'كُرۡهٗا',
      'وَهناً',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "وَٱذۡكُرۡ أَخَا .... إِذۡ أَنذَرَ قَوۡمَهُۥ بِٱلۡأَحۡقَافِ وَقَدۡ خَلَتِ ٱلنُّذُرُ مِنۢ بَيۡنِ يَدَيۡهِ وَمِنۡ خَلۡفِهِۦٓ أَلَّا تَعۡبُدُوٓاْ إِلَّا ٱللَّهَ إِنِّيٓ أَخَافُ عَلَيۡكُمۡ عَذَابَ يَوۡمٍ عَظِيمٖ",
    "options": [
      'مَدين',
      'عَادٍ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "تبدأ سورة محمد ب ....",
    "options": [
      'ٱلَّذِينَ كَفَرُواْ وَصَدُّواْ عَن سَبِيلِ ٱللَّهِ أَضَلَّ أَعۡمَٰلَهُمۡ',
      'مُحَمَّدٌ رَسُولُ اللَّهِ وَالَّذِينَ مَعَهُ أَشِدَّاءُ عَلَى الْكُفَّارِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": " أكمل من قوله تعالى (مَّثَلُ ٱلۡجَنَّةِ ٱلَّتِي وُعِدَ ٱلۡمُتَّقُونَۖ فِيهَآ أَنۡهَٰرٞ مِّن مَّآءٍ غَيۡرِ ءَاسِنٖ وَأَنۡهَٰرٞ مِّن لَّبَنٖ لَّمۡ يَتَغَيَّرۡ طَعۡمُهُۥ وَأَنۡهَٰرٞ مِّنۡ خَمۡرٖ لَّذَّةٖ لِّلشَّٰرِبِينَ وَأَنۡهَٰرٞ مِّنۡ عَسَلٖ مُّصَفّٗىۖ) معنى ءَاسِنٖ",
    "options": [
      'متغير',
      'ثابت',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " تبدأ سورة الفتح ب ....",
    "options": [
      '	إِنَّا فَتَحۡنَا لَكَ فَتۡحٗا مُّبِينٗا (1) لِّيَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكَ وَيَهۡدِيَكَ صِرَٰطٗا مُّسۡتَقِيمٗا',
      '	عَمَّ يَتَسَآءَلُونَ (1) عَنِ ٱلنَّبَإِ ٱلۡعَظِيمِ (2) ٱلَّذِي هُمۡ فِيهِ مُخۡتَلِفُونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "وَيَنصُرَكَ ٱللَّهُ نَصۡرًا عَزِيزًا * هُوَ ٱلَّذِيٓ أَنزَلَ ..... فِي قُلُوبِ ٱلۡمُؤۡمِنِينَ لِيَزۡدَادُوٓاْ إِيمَٰنٗا مَّعَ إِيمَٰنِهِمۡۗ وَلِلَّهِ جُنُودُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۚ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا",
    "options": [
      'ٱلسَّكِينَةَ',
      'الرُعبَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "لَّقَدۡ رَضِيَ ٱللَّهُ عَنِ ..... إِذۡ يُبَايِعُونَكَ تَحۡتَ ٱلشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمۡ فَأَنزَلَ ٱلسَّكِينَةَ عَلَيۡهِمۡ وَأَثَٰبَهُمۡ فَتۡحٗا قَرِيبٗا",
    "options": [
      'الكَافرينَ',
      'ٱلۡمُؤۡمِنِينَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " تبدأ سورة الحجرات ب .....",
    "options": [
      '	يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيمٞ',
      'إِنَّا فَتَحۡنَا لَكَ فَتۡحٗا مُّبِينٗا (1) لِّيَغۡفِرَ لَكَ ٱللَّهُ مَا تَقَدَّمَ مِن ذَنۢبِكَ وَمَا تَأَخَّرَ وَيُتِمَّ نِعۡمَتَهُۥ عَلَيۡكَ وَيَهۡدِيَكَ صِرَٰطٗا مُّسۡتَقِيمٗا',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ ٱجۡتَنِبُواْ كَثِيرٗا مِّنَ ٱلظَّنِّ إِنَّ بَعۡضَ ٱلظَّنِّ إِثۡمٞۖ وَ لَا ...... وَلَا يَغۡتَب بَّعۡضُكُم بَعۡضًاۚ أَيُحِبُّ أَحَدُكُمۡ أَن يَأۡكُلَ لَحۡمَ أَخِيهِ مَيۡتٗا فَكَرِهۡتُمُوهُۚ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ تَوَّابٞ رَّحِيمٞ",
    "options": [
      'تَجَسَّسُواْ',
      'تَفتنوا',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": " تبدأ سورة ق .....",
    "options": [
      '	قٓۚ وَٱلۡقُرۡءَانِ ٱلۡمَجِيدِ (1) بَلۡ عَجِبُوٓاْ أَن جَآءَهُم مُّنذِرٞ مِّنۡهُمۡ فَقَالَ ٱلۡكَٰفِرُونَ هَٰذَا شَيۡءٌ عَجِيبٌ',
      'يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تُقَدِّمُواْ بَيۡنَ يَدَيِ ٱللَّهِ وَرَسُولِهِۦۖ وَٱتَّقُواْ ٱللَّهَۚ إِنَّ ٱللَّهَ سَمِيعٌ عَلِيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "وَلَقَدۡ خَلَقۡنَا ٱلۡإِنسَٰنَ وَنَعۡلَمُ مَا تُوَسۡوِسُ بِهِۦ نَفۡسُهُۥۖ وَنَحۡنُ أَقۡرَبُ إِلَيۡهِ مِنۡ ......",
    "options": [
      'نَفسهِ',
      'حَبۡلِ ٱلۡوَرِيدِ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "لَّقَدۡ كُنتَ فِي ..... مِّنۡ هَٰذَا فَكَشَفۡنَا عَنكَ غِطَآءَكَ فَبَصَرُكَ ٱلۡيَوۡمَ حَدِيدٞ",
    "options": [
      'غَفۡلَةٖ',
      'بَينةِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "تبدأ سورة الذاريات ب ....",
    "options": [
      'نٓۚ وَٱلۡقَلَمِ وَمَا يَسۡطُرُونَ (1) مَآ أَنتَ بِنِعۡمَةِ رَبِّكَ بِمَجۡنُونٖ',
      '	وَٱلذَّٰرِيَٰتِ ذَرۡوٗا (1) فَٱلۡحَٰمِلَٰتِ وِقۡرٗا (2) فَٱلۡجَٰرِيَٰتِ يُسۡرٗا',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "هَلۡ أَتَىٰكَ حَدِيثُ ضَيۡفِ ...... ٱلۡمُكۡرَمِينَ * إِذۡ دَخَلُواْ عَلَيۡهِ فَقَالُواْ سَلَٰمٗاۖ قَالَ سَلَٰمٞ قَوۡمٞ مُّنكَرُونَ",
    "options": [
      'إِبۡرَٰهِيمَ',
      'إلياسَ',
    ],
    "answer_index": 0,
  },
];





const List partTwentySeven =
[
  {
    "id": 1,
    "question": "(وَٱلطُّورِ (1) وَكِتَٰبٖ مَّسۡطُورٖ (2) فِي رَقّٖ مَّنشُورٖ) الآيات بداية لسورة.....",
    "options": [
      'الحديد',
      'الطور',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "وَٱصۡبِرۡ لِحُكۡمِ رَبِّكَ فَإِنَّكَ بِأَعۡيُنِنَاۖ وَسَبِّحۡ بِحَمۡدِ رَبِّكَ .....",
    "options": [
      '	حِينَ تَقُومُ',
      '	قبلَ طُلوعِ الشمس وقبل الغروب',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "(مَا ضَلَّ صَاحِبُكُمۡ وَمَا غَوَىٰ) هذه الآيات لسورة....",
    "options": [
      'الطور',
      'النجم',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "أَلَّا تَزِرُ وَازِرَةٞ وِزۡرَ أُخۡرَىٰ * وَأَن لَّيۡسَ لِلۡإِنسَٰنِ إِلَّا مَا سَعَىٰ * وَأَنَّ سَعۡيَهُۥ سَوۡفَ .....",
    "options": [
      'يُرَىٰ',
      'يُكتَب',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "(وَإِن يَرَوۡاْ ءَايَةٗ يُعۡرِضُواْ وَيَقُولُواْ سِحۡرٞ مُّسۡتَمِرّٞ) هذه الآيات لسورة.....",
    "options": [
      'النجم',
      'القمر',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "خُشَّعًا أَبۡصَٰرُهُمۡ يَخۡرُجُونَ مِنَ ٱلۡأَجۡدَاثِ كَأَنَّهُمۡ .... مُّنتَشِرٞ",
    "options": [
      'جَرَادٞ',
      'نَملُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "وَلَقَدۡ يَسَّرۡنَا ٱلۡقُرۡءَانَ لِلذِّكۡرِ فَهَلۡ مِن .....",
    "options": [
      'مُتَّعِظ',
      'مُّدَّكِرٖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "(عَلَّمَ ٱلۡقُرۡءَانَ (2) خَلَقَ ٱلۡإِنسَٰنَ) هذه الآيات لسورة.....",
    "options": [
      'القمر',
      'الرحمن',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "يَٰمَعۡشَرَ ..... وَٱلۡإِنسِ إِنِ ٱسۡتَطَعۡتُمۡ أَن تَنفُذُواْ مِنۡ أَقۡطَارِ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِ فَٱنفُذُواْۚ لَا تَنفُذُونَ إِلَّا بِسُلۡطَٰنٖ",
    "options": [
      'ٱلۡجِنِّ',
      'الشَيطانِ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "(لَيۡسَ لِوَقۡعَتِهَا كَاذِبَةٌ) هذه الآيات لسورة.....",
    "options": [
      'الذاريات',
      'الواقعة',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": " وَأَمَّآ إِن كَانَ مِنَ ٱلۡمُكَذِّبِينَ ٱلضَّآلِّينَ *........",
    "options": [
      'فَسَلَٰمٞ لَّكَ مِنۡ أَصۡحَٰبِ ٱلۡيَمِينِ',
      '	فَنُزُلٞ مِّنۡ حَمِيمٖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "(لَهُۥ مُلۡكُ ٱلسَّمَٰوَٰتِ وَٱلۡأَرۡضِۖ يُحۡيِۦ وَيُمِيتُۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ) هذه الآيات لسورة....",
    "options": [
      'الحديد',
      'المجادلة',
    ],
    "answer_index": 0,
  },
];






const List partTwentyEight =
[
  {
    "id": 1,
    "question": "تبدأ سورة المجادلة ب ....",
    "options": [
      '	وَٱلۡمُرۡسَلَٰتِ عُرۡفٗا (1) فَٱلۡعَٰصِفَٰتِ عَصۡفٗا (2) وَٱلنَّٰشِرَٰتِ نَشۡرٗا (3) فَٱلۡفَٰرِقَٰتِ فَرۡقٗا',
      '	قَدۡ سَمِعَ ٱللَّهُ قَوۡلَ ٱلَّتِي تُجَٰدِلُكَ فِي زَوۡجِهَا وَتَشۡتَكِيٓ إِلَى ٱللَّهِ وَٱللَّهُ يَسۡمَعُ تَحَاوُرَكُمَآۚ إِنَّ ٱللَّهَ سَمِيعُۢ بَصِيرٌ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "تبدأ سورة الحشر ب ....",
    "options": [
      'سَبَّحَ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالأَرْضِ وَهُوَ الْعَزِيزُ الْحَكِيمُ',
      'سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ (1) هُوَ ٱلَّذِيٓ أَخۡرَجَ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن دِيَٰرِهِمۡ لِأَوَّلِ ٱلۡحَشۡرِۚ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "تبدأ سورة الممتحنة ب .....",
    "options": [
      '	يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لَا تَتَّخِذُواْ عَدُوِّي وَعَدُوَّكُمۡ أَوۡلِيَآءَ تُلۡقُونَ إِلَيۡهِم بِٱلۡمَوَدَّةِ وَقَدۡ كَفَرُواْ بِمَا جَآءَكُم مِّنَ ٱلۡحَقِّ يُخۡرِجُونَ ٱلرَّسُولَ وَإِيَّاكُمۡ أَن تُؤۡمِنُواْ بِٱللَّهِ رَبِّكُمۡ إِن كُنتُمۡ خَرَجۡتُمۡ جِهَٰدٗا فِي سَبِيلِي وَٱبۡتِغَآءَ مَرۡضَاتِيۚ',
      '	حمٓ (1) عٓسٓقٓ (2) كَذَٰلِكَ يُوحِيٓ إِلَيۡكَ وَإِلَى ٱلَّذِينَ مِن قَبۡلِكَ ٱللَّهُ ٱلۡعَزِيزُ ٱلۡحَكِيمُ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "تبدأ سورة الصف ب ....",
    "options": [
      'سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ (1) هُوَ ٱلَّذِيٓ أَخۡرَجَ ٱلَّذِينَ كَفَرُواْ مِنۡ أَهۡلِ ٱلۡكِتَٰبِ مِن دِيَٰرِهِمۡ لِأَوَّلِ ٱلۡحَشۡر',
      'سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ (1) يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لِمَ تَقُولُونَ مَا لَا تَفۡعَلُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " تبدأ سورة الجمعة ب ....",
    "options": [
      '	يُسَبِّحُ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ ٱلۡمَلِكِ ٱلۡقُدُّوسِ ٱلۡعَزِيزِ ٱلۡحَكِيمِ',
      'سَبَّحَ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ وَهُوَ ٱلۡعَزِيزُ ٱلۡحَكِيمُ (1) يَٰٓأَيُّهَا ٱلَّذِينَ ءَامَنُواْ لِمَ تَقُولُونَ مَا لَا تَفۡعَلُون',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "تبدأ سورة المنافقون ب ....",
    "options": [
      '	حمٓ (1) وَٱلۡكِتَٰبِ ٱلۡمُبِينِ (2) إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةٖ مُّبَٰرَكَةٍۚ إِنَّا كُنَّا مُنذِرِينَ',
      '	إِذَا جَآءَكَ ٱلۡمُنَٰفِقُونَ قَالُواْ نَشۡهَدُ إِنَّكَ لَرَسُولُ ٱللَّهِۗ وَٱللَّهُ يَعۡلَمُ إِنَّكَ لَرَسُولُهُۥ وَٱللَّهُ يَشۡهَدُ إِنَّ ٱلۡمُنَٰفِقِينَ لَكَٰذِبُونَ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "تبدأ سورة التغابن ب ....",
    "options": [
      '	يُسَبِّحُ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِۖ لَهُ ٱلۡمُلۡكُ وَلَهُ ٱلۡحَمۡدُۖ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ',
      '	يُسَبِّحُ لِلَّهِ مَا فِي ٱلسَّمَٰوَٰتِ وَمَا فِي ٱلۡأَرۡضِ ٱلۡمَلِكِ ٱلۡقُدُّوسِ ٱلۡعَزِيزِ ٱلۡحَكِيم',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " تبدأ سورة الطلاق ب ....",
    "options": [
      '	لَآ أُقۡسِمُ بِيَوۡمِ ٱلۡقِيَٰمَةِ (1) وَلَآ أُقۡسِمُ بِٱلنَّفۡسِ ٱللَّوَّامَةِ (2) أَيَحۡسَبُ ٱلۡإِنسَٰنُ أَلَّن نَّجۡمَعَ عِظَامَهُۥ',
      '	يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَةٖۚ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": " تبدأ سورة التحريم ب .....",
    "options": [
      'يَٰٓأَيُّهَا ٱلنَّبِيُّ إِذَا طَلَّقۡتُمُ ٱلنِّسَآءَ فَطَلِّقُوهُنَّ لِعِدَّتِهِنَّ وَأَحۡصُواْ ٱلۡعِدَّةَۖ وَٱتَّقُواْ ٱللَّهَ رَبَّكُمۡۖ لَا تُخۡرِجُوهُنَّ مِنۢ بُيُوتِهِنَّ وَلَا يَخۡرُجۡنَ إِلَّآ أَن يَأۡتِينَ بِفَٰحِشَةٖ مُّبَيِّنَة',
      '	يَٰٓأَيُّهَا ٱلنَّبِيُّ لِمَ تُحَرِّمُ مَآ أَحَلَّ ٱللَّهُ لَكَۖ تَبۡتَغِي مَرۡضَاتَ أَزۡوَٰجِكَۚ وَٱللَّهُ غَفُورٞ رَّحِيمٞ',
    ],
    "answer_index": 1,
  },
];





const List partTwentyNine =
[
  {
    "id": 1,
    "question": " تبدأ سورة الملك ب ....",
    "options": [
      'تَبَٰرَكَ ٱلَّذِي بِيَدِهِ ٱلۡمُلۡكُ وَهُوَ عَلَىٰ كُلِّ شَيۡءٖ قَدِيرٌ',
      '	قَدۡ أَفۡلَحَ ٱلۡمُؤۡمِنُونَ (1) ٱلَّذِينَ هُمۡ فِي صَلَاتِهِمۡ خَٰشِعُونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " تبدأ سورة القلم ب .....",
    "options": [
      'يَٰٓأَيُّهَا ٱلۡمُزَّمِّلُ (1) قُمِ ٱلَّيۡلَ إِلَّا قَلِيلٗا (2) نِّصۡفَهُۥٓ أَوِ ٱنقُصۡ مِنۡهُ قَلِيلًا (3) أَوۡ زِدۡ عَلَيۡهِ وَرَتِّلِ ٱلۡقُرۡءَانَ تَرۡتِيلًا',
      '	نٓۚ وَٱلۡقَلَمِ وَمَا يَسۡطُرُونَ (1) مَآ أَنتَ بِنِعۡمَةِ رَبِّكَ بِمَجۡنُونٖ (2) وَإِنَّ لَكَ لَأَجۡرًا غَيۡرَ مَمۡنُونٖ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "تبدأ سورة الحآقة ب.....",
    "options": [
      '	ٱلۡحَآقَّةُ (1) مَا ٱلۡحَآقَّةُ (2) وَمَآ أَدۡرَىٰكَ مَا ٱلۡحَآقَّةُ (3) كَذَّبَتۡ ثَمُودُ وَعَادُۢ بِٱلۡقَارِعَةِ',
      'الٓمٓ (1) غُلِبَتِ ٱلرُّومُ (2) فِيٓ أَدۡنَى ٱلۡأَرۡضِ وَهُم مِّنۢ بَعۡدِ غَلَبِهِمۡ سَيَغۡلِبُونَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "تبدأ سورة المعارج ب ....",
    "options": [
      '	الٓمٓ (1) تَنزِيلُ ٱلۡكِتَٰبِ لَا رَيۡبَ فِيهِ مِن رَّبِّ ٱلۡعَٰلَمِينَ',
      '	سَأَلَ سَآئِلُۢ بِعَذَابٖ وَاقِعٖ (1) لِّلۡكَٰفِرِينَ لَيۡسَ لَهُۥ دَافِعٞ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " تبدأ سورة نوح ب ....",
    "options": [
      '	إِنَّآ أَرۡسَلۡنَا نُوحًا إِلَىٰ قَوۡمِهِۦٓ أَنۡ أَنذِرۡ قَوۡمَكَ مِن قَبۡلِ أَن يَأۡتِيَهُمۡ عَذَابٌ أَلِيمٞ',
      'ٱلرَّحۡمَٰنُ (1) عَلَّمَ ٱلۡقُرۡءَانَ (2) خَلَقَ ٱلۡإِنسَٰنَ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": " تبدأ سورة المزمل ب ....",
    "options": [
      'يَٰٓأَيُّهَا ٱلۡمُزَّمِّلُ (1) قُمِ ٱلَّيۡلَ إِلَّا قَلِيلٗا (2) نِّصۡفَهُۥٓ أَوِ ٱنقُصۡ مِنۡهُ قَلِيلًا (3) أَوۡ زِدۡ عَلَيۡهِ وَرَتِّلِ ٱلۡقُرۡءَانَ تَرۡتِيلًا',
      '	يَٰٓأَيُّهَا ٱلۡمُدَّثِّرُ (1) قُمۡ فَأَنذِرۡ (2) وَرَبَّكَ فَكَبِّرۡ (3) وَثِيَابَكَ فَطَهِّرۡ (4) وَٱلرُّجۡزَ فَٱهۡجُرۡ',
    ],
    "answer_index": 0,
  },
];






 List partThirty =
[
   {
    "id": 1,
    "question": "يَوۡمَ يَنظُرُ ٱلۡمَرۡءُ مَا قَدَّمَتۡ يَدَاهُ وَيَقُولُ ٱلۡكَافِرُ يَٰلَيۡتَنِي كُنتُ ",
     "options": [
       'تُرَٰبَۢا',
       'مُؤمناً',
     ],
    "answer_index": 0,
  },
   {
      "id": 2,
      "question": '.....'" وَأَمَّا مَنۡ خَافَ مَقَامَ رَبِّهِۦ وَنَهَى ٱلنَّفۡسَ عَنِ ٱلۡهَوَىٰ ",
      "options": [
        '	فَإِنَّ ٱلۡجَحِيمَ هِيَ ٱلۡمَأۡوَىٰ',
        'فَإِنَّ ٱلۡجَنَّةَ هِيَ ٱلۡمَأۡوَىٰ',
      ],
      "answer_index": 1,
    },
   {
      "id": 3,
      "question": "فَإِذَا جَآءَتِ ..... يَوۡمَ يَفِرُّ ٱلۡمَرۡءُ مِنۡ أَخِيهِ * وَأُمِّهِۦ وَأَبِيهِ * وَصَٰحِبَتِهِۦ وَبَنِيهِ",
      "options": [
        'ٱلصَّآخَّةُ',
        'الطآمةُ',
      ],
      "answer_index": 0,
    },
   {
      "id": 4,
      "question": " أكمل من سورة التكوير (وَٱلَّيۡلِ إِذَا .... )",
      "options": [
        'تَنَفَّسَ',
        'عَسۡعَسَ',
      ],
      "answer_index": 1,
    },
   {
      "id": 5,
      "question": "إِذَا ٱلسَّمَآءُ ٱنفَطَرَتۡ * وَإِذَا ٱلۡكَوَاكِبُ ٱنتَثَرَتۡ * وَإِذَا ٱلۡبِحَارُ .....",
      "options": [
        'فُجِّرَتۡ',
        'سُجِّرَتۡ',
      ],
      "answer_index": 0,
    },
   {
      "id": 6,
      "question": "وَيۡلٞ لِّلۡمُطَفِّفِينَ * ٱلَّذِينَ إِذَا ٱكۡتَالُواْ عَلَى ٱلنَّاسِ .....",
      "options": [
        'يَغِشونَ',
        'يَسۡتَوۡفُونَ',
      ],
      "answer_index": 1,
    },
   {
      "id": 7,
      "question": "وَإِذَا قُرِئَ عَلَيۡهِمُ ٱلۡقُرۡءَانُ لَا يَسۡجُدُونَۤ۩ * بَلِ ٱلَّذِينَ كَفَرُواْ ..... *وَٱللَّهُ أَعۡلَمُ بِمَا يُوعُونَ * فَبَشِّرۡهُم بِعَذَابٍ أَلِيمٍ",
      "options": [
        'يُكَذِّبُونَ',
        'في تَكذيب',
      ],
      "answer_index": 0,
    },
   {
      "id": 8,
      "question": "وَٱلسَّمَآءِ ذَاتِ ٱلۡبُرُوجِ *وَٱلۡيَوۡمِ ٱلۡمَوۡعُودِ *وَشَاهِدٖ وَمَشۡهُودٖ * قُتِلَ أَصۡحَٰبُ .....",
      "options": [
        'الكَهف',
        'ٱلۡأُخۡدُودِ',
      ],
      "answer_index": 1,
    },
   {
      "id": 9,
      "question": "فَذَكِّرۡ إِن نَّفَعَتِ ٱلذِّكۡرَىٰ * سَيَذَّكَّرُ مَن يَخۡشَىٰ * وَيَتَجَنَّبُهَا ...... *ٱلَّذِي يَصۡلَى ٱلنَّارَ ٱلۡكُبۡرَىٰ",
      "options": [
        'ٱلۡأَشۡقَى',
        'ٱلۡأَتۡقَى',
      ],
      "answer_index": 0,
    },
   {
      "id": 10,
      "question": "أَفَلَا يَنظُرُونَ إِلَى .... كَيۡفَ خُلِقَتۡ",
      "options": [
        'البَقرِ',
        'ٱلۡإِبِلِ',
      ],
      "answer_index": 1,
    },
  {
    "id": 11,
    "question": "يَٰٓأَيَّتُهَا ٱلنَّفۡسُ ..... * ٱرۡجِعِيٓ إِلَىٰ رَبِّكِ رَاضِيَةٗ مَّرۡضِيَّةٗ * فَٱدۡخُلِي فِي عِبَٰدِي * وَٱدۡخُلِي جَنَّتِي ",
    "options": [
      'ٱلۡمُطۡمَئِنَّةُ',
      'الخَائفةُ',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "فَقَالَ لَهُمۡ رَسُولُ ٱللَّهِ نَاقَةَ ٱللَّهِ وَسُقۡيَٰهَا * فَكَذَّبُوهُ ..... فَدَمۡدَمَ عَلَيۡهِمۡ رَبُّهُم بِذَنۢبِهِمۡ فَسَوَّىٰهَا",
    "options": [
      'فَعَقَرُوهَا',
      'فَذبحوها',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "لَا يَصۡلَىٰهَآ إِلَّا ٱلۡأَشۡقَى * ٱلَّذِي كَذَّبَ وَتَوَلَّىٰ *وَسَيُجَنَّبُهَا .....",
    "options": [
      'ٱلۡأَشۡقَى',
      'ٱلۡأَتۡقَى',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "إِنَّآ أَنزَلۡنَٰهُ فِي لَيۡلَةِ ٱلۡقَدۡرِ * وَمَآ أَدۡرَىٰكَ مَا لَيۡلَةُ ٱلۡقَدۡرِ * لَيۡلَةُ ٱلۡقَدۡرِ ..... مِّنۡ أَلۡفِ شَهۡ",
    "options": [
      'أَفضل',
      'خَيۡرٞ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "وَأَمَّا مَنۡ خَفَّتۡ مَوَٰزِينُهُۥ * ...... * وَمَآ أَدۡرَىٰكَ مَا هِيَهۡ * نَارٌ حَامِيَةُۢ",
    "options": [
      '	فَأُمُّهُۥ هَاوِيَةٞ',
      '	فَهُوَ فِي عِيشَةٖ رَّاضِيَةٖ',
    ],
    "answer_index": 0,
  },
   {
      "id": 16,
      "question": "في أي سورة وردت هذه الآية( إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ)......",
      "options": [
        'الانشقاق',
        'التين',
        'العصر',
      ],
      "answer_index": 0,
    },
   {
      "id": 17,
      "question": "في أي سورة وردت هذه الآية (فَإِذَا جَاءَتِالطَّامَّةُ الْكُبْرَىٰ)......",
      "options": [
        'البروج',
        'عبس',
        'النازعات',
      ],
      "answer_index": 2,
    },
   {
      "id": 18,
      "question": "في أي سورة وردت هذه الآية (فَذَكِّرْإِنَّمَا أَنتَ مُذَكِّرٌ)......",
      "options": [
        'الأعلى',
        'الغاشية',
        'الليل',
      ],
      "answer_index": 1,
    },
   {
      "id": 19,
      "question": "في أي سورة وردت هذه الآية (إِلَّا الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ فَلَهُمْ أَجْرٌ غَيْرُ مَمْنُونٍ)......",
      "options": [
        'الانشقاق',
        'التين',
        'العصر',
      ],
      "answer_index": 1,
    },
   {
      "id": 20,
      "question": "في أي سورة وردت هذه الآية (فَذَكِّرْإِن نَّفَعَتِ الذِّكْرَىٰ).....",
      "options": [
        'الأعلى',
        'الغاشية',
        'الليل',
      ],
      "answer_index": 0,
   },
   {
    "id": 21,
    "question": "في أي سورة وردت هذه الآية ( وَالنَّهَارِ إِذَا جَلَّاهَا ).....",
     "options": [
       'التكوير',
       'الليل',
       'الشمس',
     ],
    "answer_index": 2,
  },
   {
      "id": 22,
      "question": "في أي سورة وردت هذه الآية (وَالنَّهَارِ إِذَا تَجَلَّىٰ).....",
      "options": [
        'الليل',
        'الشمس',
        'البروج',
      ],
      "answer_index": 0,
    },
   {
      "id": 23,
      "question": "في أي سورة وردت هذه الآية هو (بَلِ الَّذِينَ كَفَرُوا فِي تَكْذِيبٍ)......",
      "options": [
        'الانشقاق',
        'البروج',
        'الطارق',
      ],
      "answer_index": 1,
    },
   {
      "id": 24,
      "question": "في أي سورة وردت هذه الآية (وَيَتَجَنَّبُهَا الْأَشْقَى)......",
      "options": [
        'الأعلى',
        'البلد',
        'الليل',
      ],
      "answer_index": 0,
    },
   {
      "id": 25,
      "question": "في أي سورة وردت هذه الآية (وَسَيُجَنَّبُهَا الْأَتْقَى).....",
      "options": [
        'الأعلى',
        'البلد',
        'الليل',
      ],
      "answer_index": 2,
    },
   {
      "id": 26,
      "question": "في أي سورة وردت هذه الآية (وَتَوَاصَوْا بِالْحَقِّ وَتَوَاصَوْا بِالصَّبْرِ).....",
      "options": [
        'البلد',
        'التين',
        'العصر',
      ],
      "answer_index": 2,
   },
];