const List purityOne =
[
  {
    "id": 1,
    "question": "هل النية من شروط الاغتسال....",
    "options": [
      'نعم',
      'لا',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "وصى الرسول بعدم ترك الاظافر لأكثر من.....",
    "options": [
      'سبع ليالٍ',
      'ثلاثين ليلة',
      'أربعين ليلة',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "يشرع التيمم عند.....",
    "options": [
      'انعدام الماء',
      'المرض',
      'عدم توافر ما يكفي من الماء إلا للشرب',
      'جميع الاجابات صحيحة',
    ],
    "answer_index": 3,
  },
  {
    "id": 4,
    "question": "من آداب قضاء الحاجة عند دخول الخلاء.....",
    "options": [
      'تقديم الرجل اليمنى عند الدخول',
      'تقديم الرجل اليسرى عند الدخول',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "من موجبات الغسل......",
    "options": [
      'عند خروج المذي',
      'نزول المني بشهوة',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "حكم الغسل بعد الجماع بدون انزال.......",
    "options": [
      'واجب',
      'جائز',
      'مستحب',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "هل يجب الغسل عند نزول المني أثناء النوم ......",
    "options": [
      'نعم',
      'لا',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "يبدا وقت المسح على الخفين(الشراب أو الجورب).....",
    "options": [
      'من لبس الخفين',
      'من أول مسح بعد الحدث',
      'من بعد أول صلاة',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "مدة المسح على الجوارب للمسافر...",
    "options": [
      'يوم وليلة(٢٤ ساعة)',
      'ثلاثة أيام بلياليها(٧٢ ساعة)',
      'حتى يعود من سفرة',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "أي مما يلي ليس من سنن الفطرة....",
    "options": [
      'نتف الإبط',
      'قص الأظافر',
      'التطيب',
    ],
    "answer_index": 2,
  },
  {
    "id": 11,
    "question": "ما هي الصلاة التي لا يلزمها وضوء.....",
    "options": [
      'صلاة العيد',
      '	الصلاة على النبي',
      'صلاة الضحى',
    ],
    "answer_index":1 ,
  },
  {
    "id": 12,
    "question": "هل صلاة الجنازة يلزمها وضوء",
    "options": [
      'نعم',
      'لا',
     ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": " أي مما يلي من سنن الفطرة.....",
    "options": [
      '	قص الأظافر',
      '	نتف الإبط',
      'جميع الإجابات صحيحة',
    ],
    "answer_index": 2,
  },
  {
    "id": 14,
    "question": " وصى الرسول صلى الله عليه وسلم بعدم ترك الأظافر لأكثر من ....",
    "options": [
      'شهر',
      '	أربعين ليلة',
      'شهرين',
    ],
    "answer_index":1 ,
  },
  {
    "id": 15,
    "question": " ما هو الماء الطهور.....",
    "options": [
      'ليس له لون ولكن له رائحة',
      '	له لون وطعم ورائحة',
      'ليس له لون ولا طعم ولا رائحة',
    ],
    "answer_index": 2,
  },
  {
    "id": 16,
    "question": " يشرع التيمم عند.....",
    "options": [
      'المرض',
      '	انعدام الماء',
      '	عدم توافر ما يكفي من الماء إلا للشرب',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index": 0,
  },
  {
    "id": 17,
    "question": "رجل يصلي وأحدث في الركعة الأخيرة .....",
    "options": [
      '	تصبح صلاته ويكمل',
      'تبطل صلاته لإنتقاض الوضوء',
    ],
    "answer_index": 1,
  },

];











// const List mohamed =
// [
//   {
//     "id": 1,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index":0 ,
//   },
//   {
//     "id": 2,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 3,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 4,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index":0 ,
//   },
//   {
//     "id": 5,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 6,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 7,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 8,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 9,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 10,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//
//   {
//     "id": 11,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 12,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 13,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 14,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 15,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 16,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index":0 ,
//   },
//   {
//     "id": 17,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 18,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 19,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 20,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
// ];