
const List understandingQuranOne =
[
  {
    "id": 1,
    "question": " فهم التفسير غير مؤثر على عملية التدبر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " أنواع الحروف في القرآن ",
    "options": [
  ' حروف جر و حروف معاني',
  ' حروف وصل و حروف مباني',
  ' حروف معاني و حروف مباني',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": " فهمك لحروف المعاني له علاقة بفهمك لأقوال السلف في التفسير",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "الرحمن على العرش استوي : ( على ) تفيد",
    "options": [
  ' الظرفية',
  ' الاستعلاء',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "ما هو السياق",
    "options": [
   'السباق',
   'اللحاق',
   'السباق و اللحاق',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "المعنى اللغوي للكلمة يقدم على المعنى الشرعي ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " النبي عليه الصلاة و السلام كان يفسر القرآن بـــ ",
    "options": [
   'قوله',
   'قوله و فعله',
   'قوله و فعله و تقريره',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "يصح تفسير القرآن باللغة فقط ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "فهم موضوع السورة العام مؤثر على فهم الآيات و تدبرها؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "من الكتب التي اهتمت بالتفسير بالمأثور و أقوال السلف",
    "options": [
   'تفسير السعدي',
   'تفسير الطبري',
   'أيسر التفاسير للجزائري',
    ],
    "answer_index": 1,
  },
];






















const List understandingQuranTwo =
[
  {
    "id": 1,
    "question": " بين الله للنبي صلى الله عليه و سلم معاني القرآن ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": " كل تفسير النبي للقرآن هو من قاله للصحابة من معاني القرآن فقط؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": " كيف فسر النبي عليه الصلاة و السلام قول الله تعالى ( سَيُهْزَمُ الْجَمْعُ وَيُوَلُّونَ الدُّبُرَ )؟",
    "options": [
  ' فسرها بشرحها للصحابة',
  ' فسرها على المنبر',
  ' فسرها بقراءتها يوم بدر',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "لا يمكن أن يكون الحق في التفسير مناقض لقول كل الصحابة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "يمكن أن يكون هناك قول في التفسير خارج عن قول الصحابة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "الصحابة هم الأعلم بالتفسير لأنهم",
    "options": [
   'عاصروا نزول الآيات',
   'هم الأعلم باللغة',
   'سلامة عقيدتهم و قلوبهم و فهمهم',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": " الصحابة يفسرون القرآن بالقرآن و  ...",
    "options": [
   'بالسنة',
   'باللغة',
   'بأقوال التابعين',
   'جميع ما سبق',
   '1 و 2  معآ',
   '1 و 3 معآ',
    ],
    "answer_index": 4,
  },
  {
    "id": 8,
    "question": "التابعون يفسرون القرآن بالقرآن  و .....",
    "options": [
   'بالسنة',
   'باللغة',
   'أقوال الصحابة',
   'جميع ما سبق',
      '1 و 2  معآ',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": " من أشهر المفسرين في التابعين.....",
    "options": [
   'زيد بن ثابت',
   'مجاهد',
   'أبي بن كعب',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": " خلاف التضاد هو الخلاف الذي يمكن الجمع فيه بين الأقوال بلا تعارض؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];






















const List understandingQuranThree =
[
  {
    "id": 1,
    "question": "في خلاف التنوع لابد من الترجيح ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "من المرجحات عند التعارض تقديم الأشهر في لغة العرب ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "سبب النزول يشترط أن يكون",
    "options": [
   'متزامنا مع نزول الآية أو السورة',
   'غير متزامن مع نزول الآية أو السورة',
   'كلاهما',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "قد لا تفهم الآية إلا لو عرفت سبب نزولها ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "آية ( مِّنَ الْمُؤْمِنِينَ رِجَالٌ صَدَقُوا مَا عَاهَدُوا اللَّهَ عَلَيْهِ ) سبب نزولها الحقيقي قصة أنس بن النضر ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من صيغ أسباب النزول الصريحة",
    "options": [
   'نزلت الآية في كذا',
   'حصل كذا فأنزل الله كذا',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " يشترط في سبب النزول أن يكون صحيح و لا نقبل الضعيف !",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "لا يتشدد في صحة السند في باب",
    "options": [
   'العقيدة',
   'أحكام الحلال و الحرام',
   'المعاني',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "لابد من التعامل مع أسانيد التفسير بنفس طريقة المحدثين في التعامل مع الحديث في كل المواضع؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "يتشدد في صحة الأسانيد في إثبات الغيبيات؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];






















const List understandingQuranFour =
[
  {
    "id": 1,
    "question": " تفسير الودود بأنه المحبوب من أوليائه هو تفسير",
    "options": [
 'بالمطابق',
 'بالتلازم',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "أكثر التفسير اللغوي للسلف يكون التفسير بالمطابق ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "غالب المأثور عن السلف في الخلاف هو من خلاف ",
    "options": [
   'التنوع',
   'التضاد',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "تفسير * وَكَأْسًا دِهَاقًا * بأنها صافية هو تفسير",
    "options": [
   'بالمطابق',
   'بالتلازم',
   'بجزء من المعني',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "*مُهْطِعِينَ* يعني",
    "options": [
   'مسرعين',
   'ينظرون من غير أن يطرفوا',
   'خاضعين لا يرفعوا رؤوسهم',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "تفسير الباقيات الصالحات ب ( سبحان الله و الحمد لله و لا إله إلا الله ) هو من التفسير",
    "options": [
   'بالمطابق',
   'بجزء من المعني',
   'بالمثال',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": " قوله تعالى ( وَآتَيْنَا ثَمُودَ النَّاقَةَ مُبْصِرَةً )  يصح تفسير مبصرة بأنها ترى و تنظر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": " تفسير التحرير و التنوير لابن عاشور اهتم باللغة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "*ٱنتَبَذَتْ* تأتي بمعني",
    "options": [
   'ابتعدت',
   'تنحت مضطرة',
   'اعتزلت',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 10,
    "question": "كلمة ( عِتِيًّا ) من معانيها ( يابسا )",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];






















const List understandingQuranFive =
[
  {
    "id": 1,
    "question": "هجر القرآن هو",
    "options": [
 'هجر التلاوة',
 'هجر العمل',
 'هجر التدبر',
 'جميع ما سبق',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": " حروف المباني ليس لها معني في نفسها ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "السياق يطلق على السباق فقط؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "لا يصح الاقتصار على اللغة في فهم القرآن؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "من الكتب التي اهتمت بالتفسير اللغوي؟",
    "options": [
   'تفسير السعدي',
   'تفسير ابن كثير',
   'تفسير التحرير و التنوير لابن عاشور',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "من صور تفسير النبي صلى الله عليه و سلم القرآن بأفعاله...",
    "options": [
   'تفسير معنى الكوثر',
   'تفسير معني الظلم في قوله تعالي ( الَّذِينَ آمَنُوا وَلَمْ يَلْبِسُوا إِيمَانَهُم بِظُلْمٍ )',
   'تفسير الآيات الآمرة بإقامة الصلاة',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "يصح احداث قول في التفسير بشرط ألا يناقض لمجموع أقوال السلف؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من مزايا الصحابة التي تجعلهم مقدمين في التفسير...",
    "options": [
   'معاصرتهم لنزول الوحي',
   'تميزهم عن غيرهم في اللغة',
   'سلامة مذهبهم من البدع و الأهواء',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": "يلزم الترجيح في خلاف التنوع ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "تفسير الصحابي الذي شهد الحادثة يقدم على غيره ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

  {
    "id": 11,
    "question": "لإحداث قول في التفسير يشترط ",
    "options": [
   'موافقة اللغة',
   'موافقة السياق',
   'لا يأتي البطلان على مجموع أقوال السلف',
   'جميع ما سبق',
      '2 و 3 فقط',
    ],
    "answer_index": 3,
  },
  {
    "id": 12,
    "question": " ما أجمع عليه الصحابة لا يعتبر حجة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": " شهرة الصحابي في التفسير لها تأثير عند الترجيح بين الأقوال ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": " سبب النزول الحقيقي الصريح لا يشترط أن يكون معاصر للنزول؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "عند تعدد أسباب النزول نبدأ في النظر في السند و نقدم الصحيح و نستبعد الضعيف؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 16,
    "question": " سبب النزول الحقيقي هو ",
    "options": [
   'الصحيح الغير صريح',
   'الصحيح الصريح',
   'الضعيف الصريح',
    ],
    "answer_index": 1,
  },
  {
    "id": 17,
    "question": "في باب المعاني يمكن أن نقبل التفاسير ذات الأسانيد الضعيفة؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 18,
    "question": " متى نتشدد في الأسانيد؟",
    "options": [
   'في أسباب النزول',
   'عند اثبات عقيدة',
   'لو تفسير مخالف للإجماع',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 19,
    "question": " تفسير الودود بأنه الذي يحب أولياءه؟",
    "options": [
   'تفسير بالمطابق',
   'تفسير باللازم',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "من طرق السلف في التفسير التفسير بجزء من المعني؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];






















const List understandingQuranSix =
[
  {
    "id": 1,
    "question": "حرف المبني ليس له معني في ذاته ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "حرف الباء يفيد",
    "options": [
   'الظرفية',
   'الاستعانة',
   'المصاحبة',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 3,
    "question": "قوله تعالى { فَوَيْلٌ لِّلْمُصَلِّينَ * الَّذِينَ هُمْ عَن صَلَاتِهِمْ سَاهُونَ } تعني ",
    "options": [
   'ساهون في الصلاة',
   'يخرجون الصلاة عن وقتها',
   'جميع ما سبق',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " إدراك حروف المعاني على ثلاث درجات ما هي الدرجة الأولي",
    "options": [
   'معرفة المعاني التي يدور حولها الحرف',
   'معرفة مواضع الحرف في القرآن',
   'معرفة الراجح في خلاف المفسرين حول معني الحرف',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "الفاء في قوله تعالى {فَانۢبَجَسَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا} تسمي فاء",
    "options": [
   'عطفية',
   'فصيحة',
   'ابتدائية',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " ألف لام في قوله تعالى { الْحَمْدُ لِلَّهِ رَبِّ الْعٰلَمِينَ }  تفيد",
    "options": [
   'الجنس',
   'العهد',
   'الاستغراق',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "حرف ( قد ) يفيد ",
    "options": [
   'التحقيق',
   'التقليل',
   'التكثير',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 8,
    "question": " التضمين هو إشراب فعل معني فعل آخر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "قوله تعالى { عَيْنًا يَشْرَبُ بِهَا عِبَادُ اللَّهِ } الباء أفاد أن فعل يشرب ضمن معنى",
    "options": [
   'الاستعلاء',
   'الإرواء',
   'السببية',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": " فهمك لمعاني الحروف غير مؤثر على فهمك لخلاف المفسرين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];






















const List understandingQuranSeven =
[
  {
    "id": 1,
    "question": "قوله تعالوا (اعْمَلُوا مَا شِئْتُمْ ۖ إِنَّهُۥ بِمَا تَعْمَلُونَ بَصِيرٌ )الأمر غرضه ",
    "options": [
 'التخيير',
 'الإلزام',
 'التهديد',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "الجملة الاسمية تدل على",
    "options": [
   'الثبوت و الاستقرار',
   'التجدد و الحدوث',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " الجملة الاسمية أفضل في باب الترغيب و الترهيب؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "قوله تعالي ( يَصْلَوْنَهَا يَوْمَ الدِّينِ (15) وَمَا هُمْ عَنْهَا بِغَآئِبِينَ (16)  أين نجد الدليل على تجدد عذابهم",
    "options": [
   'يصلونها',
   'يوم الدين',
   'غائبين',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " قوله تعالي عن إبراهيم عليه السلام ( { إِذْ دَخَلُوا عَلَيْهِ فَقَالُوا سَلٰمًا ) دل على أن سلامه أبلغ من سلام الملائكة بدلالة استعماله للجملة الفعلية ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من دلالات التقديم و التأخير...",
    "options": [
   'بيان الأهم',
   'الاختصاص',
   'الحصر',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": " قوله تعالى ( إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ ) أفاد التقديم الحصر و الاختصاص ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "قوله تعالي ( قُل لِّلْمُؤْمِنِينَ يَغُضُّوا مِنْ أَبْصٰرِهِمْ وَيَحْفَظُوا فُرُوجَهُمْ ) قدم غض البصر على حفظ الفرج لبيان علاقة السببية؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": " قوله تعالى ( وَاعْلَمُوٓا أَنَّمَآ أَمْوٰلُكُمْ وَأَوْلٰدُكُمْ فِتْنَةٌ وَأَنَّ اللَّهَ عِندَهُۥٓ أَجْرٌ عَظِيمٌ )  تقديم الأموال لبيان :",
    "options": [
   'الحصر',
   'السببية',
   'بيان الأخطر  للتحذير منه',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": " باب التقديم و التأخير له أثر كبير في استنباط الفوائد؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];






















const List understandingQuranEight =
[
  {
    "id": 1,
    "question": " السياق يعني اللحاق فقط ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "السياق يساعد على ",
    "options": [
   'تبيين المجمل',
   'تعيين المحتمل',
   'تخصيص العام',
   'تقييد المطلق',
   'جميع ما سبق',
    ],
    "answer_index": 4,
  },
  {
    "id": 3,
    "question": " قوله تعالى في سورة الدخان ( ذُقْ إِنَّكَ أَنتَ الْعَزِيزُ الْكَرِيمُ ) وصف العزيز الكريم غرضه",
    "options": [
   'الثناء و التعظيم',

   'السخرية التهكم',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " فهم السياق هو من المرجحات عند الخلاف",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": " السلف الأوائل كانت لهم عدة مصنفات في التفسير الموضوعي ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": " اتفق العلماء على أن هناك وجود مناسبات بين جميع الآيات و السور؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " أشهر من انتصر لعلم المناسبات بين الآيات و السور ...",
    "options": [
   'الإمام ابن كثير',
   'الإمام الشوكاني',
   'الإمام البقاعي',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "من أشهر الكتب في علم المناسبات نظم الدرر في تناسب الآيات و السور ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "سورة التوبة موضوعها يدور حول :",
    "options": [
   'النعم',
   'المنافقين',
   'التوحيد',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": " سورة النحل تدور حول موضوع ",
    "options": [
   'النعم',
   'المنافقين',
   'التوحيد',
    ],
    "answer_index": 0,
  },
];






















const List understandingQuranNine =
[
  {
    "id": 1,
    "question": "الجمع بين قوله تعالي *فَيَوْمَئِذٍ لَّا يُسْأَلُ عَن ذَنبِهِ إِنسٌ وَلَا جَانٌّ (39)* و قوله تعالي (مَاذَآ أَجَبْتُمُ الْمُرْسَلِينَ ) :",
    "options": [
 'الآية الثانية منسوخة',
 'الآية الأولي منسوخة',
 'أن يوم القيامة له أحوال يسألون في بعضها و يسكتون في بعضها',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "من أشهر الكتب في الجمع بين الآيات التي ظاهرها التعارض كتاب ( دفع إيهام الإضطراب عن آيات الكتاب ) للشيخ الشنقيطي",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "آيات الجهاد التي تكلمت عن وجوب المشركين كافة لغت العمل بآيات العفو و الصفح؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "جمع الآيات التي تكلمت في الموضوع الواحد لا يؤثر على تدبرك للآيات؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من الأمور المؤثرة في تدبر القرآن....",
    "options": [
   'فهم السياق',
   'فهم حروف المعاني',
   'معرفة مواقف السلف و أخبارهم مع آيات القرآن',
   'جميع ما سبق',
      '1 و2 فقط',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "موقف ابن عمر مع قوله تعالى *وَنادى أَصحابُ النّارِ أَصحابَ الجَنَّةِ أَن أَفيضوا عَلَينا مِنَ الماءِ أَو مِمّا رَزَقَكُمُ اللَّهُ قالوا إِنَّ اللَّهَ حَرَّمَهُما عَلَى الكافِرينَ *و قد شرب ماءً باردا ذات يوم ثم بكى اشتد بكاءه فقيل له ما يبكيك؟ قال ذكرت آية في كتاب الله تعالى يترتب عليه عندك عبادة :",
    "options": [
   'الشكر',
   'التوكل',
   'اليقين',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "قوله تعالى ( إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ ) مفيد في الرد على من أنكروا سلطان الله على أفعال العباد؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "آية كانت سبب في توبة الفضيل بن عياض ",
    "options": [
  " أَم حَسِبَ الَّذينَ اجتَرَحُوا السَّيِّئَاتِ أَن نَجعَلَهُم كَالَّذينَ آمَنوا وَعَمِلُوا الصّالِحاتِ سَواءً مَحياهُم وَمَماتُهُم ساءَ ما يَحكُمونَ",
  " بَلِ السّاعَةُ مَوعِدُهُم وَالسّاعَةُ أَدهى وَأَمَرُّ ",
  "أَلَم يَأنِ لِلَّذينَ آمَنوا أَن تَخشَعَ قُلوبُهُم لِذِكرِ اللَّهِ وَما نَزَلَ مِنَ الحَقِّ",
  ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "من الكتب الهامة في مدارسة أصول التفسير كتاب ( التحرير في أصول التفسير ) للشيخ مساعد الطيار؟",
    "options": [
  'صح',
  'خطأ',
  ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "من أشهر مختصرات تفسير ابن كثير كتاب المصباح المنير؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];






















const List understandingQuranTen =
[

  {
    "id": 1,
    "question": "هجر التفسير و التدبر لا يعتبر من هجر القرآن؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": " المؤثر في فهم التفسير هو فهم ",
    "options": [
   'حروف المعاني',
   'حروف المباني',
   'كلاهما',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "موافقة السياق تعتبر من القواعد الترجيحية عند الخلاف ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": " المرحلة الأولي من المراحل الثمان هي ",
    "options": [
   'فهم حروف المعاني',
   'معرفة دلالة الجملة',
   'الوقوف على الآثار الواردة عن الرسول صلي الله عليه و سلم و الصحابة و التابعين',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": " المرحلة الثانية في المراحل الثمان هي الإحاطة بمقصود السورة ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من كتب التفسير التي ينصح بها للمبتدئ...",
    "options": [
   'تفسير الطبري',
   'تفسير السعدي',
   'تفسير ابن عاشور',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "كتاب أضواء البيان للشنقيطي من أشهر الكتب التي اعتنت بتفسير القرآن بالقرآن؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "تفسير النبي صلى الله عليه و سلم للقرآن يكون بالقول فقط ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "يمكن إحداث قول في التفسير يأتي بالبطلان على أقوال السلف",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "خلاف التنوع ",
    "options": [
   'يلزم الترجيح فيه بين الأقوال',
   'لا يلزم الترجيح فيه بين الأقوال',
    ],
    "answer_index": 1,
  },


  {
    "id": 11,
    "question": "الصحابة يفسرون القرآن بالقرآن و  ...",
    "options": [
   'بالسنة',
   'باللغة',
   'بأقوال التابعين',
   'جميع ما سبق',
  '1 و 2',
    ],
    "answer_index": 4,
  },
  {
    "id": 12,
    "question": "من أعلم الصحابة بالتفسير",
    "options": [
   'خالد بن الوليد',
   'عمرو بن العاص',
   'عبد الله بن مسعود',
    ],
    "answer_index": 2,
  },
  {
    "id": 13,
    "question": " التفسير الذي أجمع عليه الصحابة",
    "options": [
   'يجب الأخذ به و لا تجوز مخالفته',
   'تجوز مخالفته بشرط أن يوافق القول اللغة العربية',
   'تجوز مخالفته بشرط أن يوافق القول السياق',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "لو الصحابي الذي لا يعرف عنه الأخذ من كتب أهل الكتاب تكلم في شئ من الغيبيات فإنه يأخذ حكم الرفع؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "شهود الحادثة غير مؤثر في الترجيح بين الأقوال عند التعارض؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 16,
    "question": "شرط إحداث قول في التفسير..",
    "options": [
   'موافقة اللغة',
   'موافقة السياق',
   'لا يأتي بالبطلان على أقوال السلف',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 17,
    "question": " تفسير القرء بالطهر و تفسيره بالحيض هو من خلاف ",
    "options": [
   'التنوع',
   'التضاد',
    ],
    "answer_index": 1,
  },
  {
    "id": 18,
    "question": "سبب النزول الصريح لابد أن يكون معاصر للنزول؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 19,
    "question": "من صيغ سبب النزول الغير صريح أن يقول الصحابي ",
    "options": [
   'نزلت الآية في كذا',
   'حصل كذا فأنزل الله كذا',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "عند تعارض أسباب النزول نقدم",
    "options": [
   'الصحيح على الضعيف',
   'الصريح على الغير صريح',
   'كلاهما',
    ],
    "answer_index": 2,
  },


  {
    "id": 21,
    "question": "لو كان التفسير سيترتب عليه أحكام في الحلال و الحرام فلا يلزم التشدد في السند؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 22,
    "question": "لابد من التعامل مع أسانيد التفسير بنفس طريقة المحدثين في التعامل مع الحديث في كل المواضع؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 23,
    "question": "يتشدد في السند عند ",
    "options": [
   'الحاجة للترجيح',
   'أن يكون المروي منكر',
   'أن يكون في اثبات عقائد',
   'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 24,
    "question": "غالب المأثور عن السلف في الخلاف هو من خلاف التضاد ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 25,
    "question": " التفسير الذي يركز على أصل معني الكلمة في اللغة يسمي",
    "options": [
   'التفسير بالمطابق',
   'التفسير باللازم',
   'التفسير بالمثال',
    ],
    "answer_index": 0,
  },
  {
    "id": 26,
    "question": "تفسير ( إِنَّ اللَّهَ يُحِبُّ التَّوّٰبِينَ ) تفسير يحب ب ( يرحم ) هو من التفسير بالمطابق ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 27,
    "question": " يكثر في كلام السلف التفسير بالمطابق ؟!",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 28,
    "question": "من فوائد التقديم",
    "options": [
   'بيان الأهم',
   'الحصر',
   'كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 29,
    "question": " التفسير باللازم هو تفسير بمعني زائد عن المعنى الأصلي ؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 30,
    "question": " جمع كلام السلف مع المعنى اللغوي للكلمة يضيف ثراء في فهم القرآن؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },


  {
    "id": 31,
    "question": "حرف ( في ) يفيد ",
    "options": [
   'الظرفية',
   'الاستعلاء',
   'كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 32,
    "question": " الجملة الفعلية تدل على",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 33,
    "question": "الراجح أنه لا يوجد تناسب بين الآيات و السور؟",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 34,
    "question": " التعبير عن المستقبل بحرف السين مثل ( سأفعل ) يفيد .... و بحرف ( سوف ) يفيد .....",
    "options": [
'الزمن القريب ,  الزمن البعيد',
 'الزمن البعيد , الزمن القريب',
    ],
    "answer_index": 0,
  },
  {
    "id": 35,
    "question": " ما معني التضمين",
    "options": [
   'تفسير الفعل بالمثال',
   'تفسير الفعل بالمطابق',
   'إشراب فعل معني فعل آخر',
    ],
    "answer_index": 2,
  },

  {
    "id": 36,
    "question": "قوله تعالى ( عَيْنًا يَشْرَبُ بِهَا عِبَادُ اللَّهِ يُفَجِّرُونَهَا تَفْجِيرًا )  .. فعل يشرب ضمن معني الارتواء و التلذذ",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 37,
    "question": "الأمر في قوله تعالى ( اعْمَلُوا مَا شِئْتُمْ ۖ إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ ) يفيد",
    "options": [
   'الإباحة',
   'التخيير',
   'التهديد',
    ],
    "answer_index": 2,
  },
  {
    "id": 38,
    "question": "قوله تعالى ( ءَأَمِنتُم مَّن فِى السَّمَآءِ أَن يَخْسِفَ بِكُمُ الْأَرْضَ فَإِذَا هِىَ تَمُورُ ) حرف في أفاد هنا",
    "options": [
   'الظرفية',
   'الاستعلاء',
   'المصاحبة',
    ],
    "answer_index": 1,
  },
  {
    "id": 39,
    "question": "آية ( ثُمَّ لَتُسْـَٔلُنَّ يَوْمَئِذٍ عَنِ النَّعِيمِ ) تفسير النعيم بالصحة أو الفراغ أو الماء البارد هو من باب التفسير",
    "options": [
   'بالمطابق',
   'باللازم',
   'بالمثال',

  ],
    "answer_index": 2,
  },
  {
    "id": 40,
    "question": "قوله تعالى ( أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحٰبِ الْفِيلِ  ) .. ( ال ) في كلمة الفيل هي ",
    "options": [
   'لاستغراق',
   'للعهد',
   'للجنس',
    ],
    "answer_index": 1,
  },
];






















//
// const List mohamed =
// [
//   {
//     "id": 1,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 2,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 3,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 4,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 5,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 6,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 7,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 8,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 9,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 10,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
// ];