const List fastingOne =
[
  {
    "id": 1,
    "question": " الصيام هو الركن........في الاسلام",
    "options": [
      'الثاني',
      'الثالث',
      'الرابع',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "يبدأ الصيام عند .........وينتهي عند.......",
    "options": [
      'يبدأ عند طلوع الشمس إلى غروب الشمس',
      'يبدأ من أذان الفجر إلى غروب الشمس',
      'يبدأ من منتصف الليل إلى غروب الشمس',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من فضائل شهر رمضان.......",
    "options": [
      'نزول القرآن فقط',
      'فيه ليلة القدر فقط',
      'من صام نهاره وقام ليله غفر له ما تقدم من ذنبه فقط',
      'شهر تفتح فيه أبواب الجنة فقط',
      'جميع ماسبق',
    ],
    "answer_index": 4,
  },
  {
    "id": 4,
    "question": "قال صلى الله عليه وسلم إن في الجنة بابًا يقال له....... يدخل منه الصائمون يوم القيامة لا يدخل منه أحد غيرهم.",
    "options": [
      'الصيام',
      'الريان',
      'رمضان',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من أكل أو شرب ناسياً.......",
    "options": [
      'صيامه صحيح وعليه إثم',
      'صيامه صحيح ولا إثم عليه',
      'لا يجوز أن يكمل صيامه',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من مفطرات الصيام......",
    "options": [
      'الإبر المغذية والمحاليل',
      'الإحتلام',
      'حقن الدم للمريض',
      '(1) و (3)',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "التقيؤ......",
    "options": [
      'إذا كان بدون اختياره يكمل صيامه ولا إثم عليه وإن كان عمدًا فيبطل صيامه',
      'إذا كان عمدًا لا يبطل صيامه ولا إثم عليه',
      'إذا كان ناسيًا فيبطل صيامه وعليه إثم',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "الحكمة من الصيام...........",
    "options": [
      'تحقيق المشقة على الناس',
      'تدريب على الإقلاع عن المعاصي والذنوب',
      'تذكير المحرومين ومواساتهم',
      '(2) و (3)',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": "من مفطرات الصيام........",
    "options": [
      'الجماع سواء أكان بنزول المني أم لا',
      'التدخين',
      'من نوى الإفطار وهو صائم مجرد النية بشرط أن تكون جازمة لا ينقصها إلا التطبيق',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 10,
    "question": "كفارة من جامع أهله في نهار رمضان.......",
    "options": [
      'تحرير رقبة',
      'صيام شهرين متتابعين',
      'اطعام ستين مسكيناً',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 11,
    "question": "الحامل والمرضع......",
    "options": [
      'يجوز لها الإفطار إن خافت الضرر على النفس أو الطفل',
      'لا يجوز لها الإفطار',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "المسافر في رمضان.....",
    "options": [
      'يجوز له الإفطار أثناء سفره',
      'لا يجوز له الإفطار إلا إن شق عليه السفر',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "إن صامت الحائض في رمضان.......",
    "options": [
      'لا يصح صيامها وعليها القضاء',
      'يصح صيامها إن كان الصيام لا يشق عليه',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "المريض في رمضان......",
    "options": [
      'يجوز له الافطار وعليه القضاء',
      'لا يجوز له الإفطار',
      'يجوز له الإفطار مع عدم القضاء',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "المريض مرض مزمن في رمضان مثل مرض الفشل الكلوي........",
    "options": [
      'لا يجوز له الافطار',
      'لا يجوز له الإفطار إلا إذا شق عليه المرض',
      'يجوز له الإفطار مع اطعام مسكين على كل يوم',
    ],
    "answer_index": 2,
  },
  {
    "id": 16,
    "question": "العاجز لكبر سنه......",
    "options": [
      'يجوز له الإفطار مع القضاء',
      'يجوز له الإفطار مع اطعام مسكين عن كل يوم',
      'لا يجوز له الإفطار',
    ],
    "answer_index": 1,
  },
  {
    "id": 17,
    "question": "الاستمناء (خروج المني بقصد).....",
    "options": [
      'يبطل صيامه',
      'لا يبطل الصيام',
    ],
    "answer_index": 0,
  },
  {
    "id": 18,
    "question": "من أكل أو شرب متعمداً في رمضان........",
    "options": [
      'عليه التوبة والقضاء فقط',
      'عليه التوبة والقضاء وإطعام مسكين عن كل يوم',
      'يصح صيامه ولا يقض',
    ],
    "answer_index": 0,
  },
  {
    "id": 19,
    "question": "\"يكفر السنة الماضية\"قال عن صيامه رسول صلى الله عليه وسلم :",
    "options": [
      'يوم عاشوراء',
      'يوم عرفة',
    ],
    "answer_index": 0,
  },
  {
    "id": 20,
    "question": "\"يكفر السنة الماضيةوالباقية\"قال عن صيامه رسول صلى الله عليه وسلم :",
    "options": [
      'يوم عاشوراء',
      'يوم عرفة',
    ],
    "answer_index": 1,
  },
];





const List fastingTwo =
[
  {
    "id": 1,
    "question": "ما اسم الباب الذي يدخل منه الصائمون يوم القيامة.....",
    "options": [
      'باب الصلاة',
      'باب الجهاد',
      'باب الريان',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "حكم من أكل أو شرب ناسياً......",
    "options": [
      'يبطل صيامه وعليه إثم',
      'صيامه صحيح ولا إثم عليه',
      'يبطل صيامه يلزمه التوبة والقضاء',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "حكم من أكل أو شرب متعمداً.....",
    "options": [
      'يبطل صيامه وعليه التوبة القضاء فقط',
      '	يبطل صيامه وعليه التوبة والقضاء وإطعام مسكين عن كل يوم',
      'صيامه صحيح ولا إثم عليه',
    ],
    "answer_index":0 ,
  },
  {
    "id": 4,
    "question": "الإفطار يكون عند",
    "options": [
      '	مدفع الإفطار',
      '	أذان المغرب',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "الحامل والمرضع في رمضان.....",
    "options": [
      'يجوز لهما الإفطار إن خافتا الضرر على النفس أو الطفل وتقضيان بعد رمضان',
      'لا يجوز لهما الإفطار',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "القيء عمداً في نهار رمضان....",
    "options": [
      '	يبطل صيامه وعليه القضاء',
      '	صيامه صحيح ولا إثم عليه',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "حكم التدخين في نهار رمضان.....",
    "options": [
      '	صيامه صحيح ولا إثم عليه',
      '	يبطل صيامه',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "امرأة حاضت قبل غروب الشمس بنصف ساعة",
    "options": [
      '	تكمل صيامها وصيانتها صحيح',
      '	يبطل صيامها وعليها قضاء هذا اليوم',
    ],
    "answer_index": 1,
  },

];






const List fastingThree =
[
  {
    "id": 1,
    "question": "يبدأ الصيام عند......وينتهي عند.....",
    "options": [
      '	يبدأ عند طلوع الشمس وينتهي عند غروب الشمس',
      '	يبدأ عند أذان الفجر وينتهي عند غروب الشمس',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "الحكمة من الصيام....",
    "options": [
      '	تحقيق تقوى الله',
      '	تحقيق المشقة على الناس',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من سنن الصيام....",
    "options": [
      '	تأخير السحور',
      '	تعجيل الإفطار',
      'جميع الإجابات صحيحة',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "ما حكم الإبر المغذية في نهار رمضان....",
    "options": [
      'تفطر',
      '	لا تفطر',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "من فضائل شهر رمضان....",
    "options": [
      'نزول القرآن',
      '	فيه ليلة القدر',
      'شهر تُفتح فيه أبواب الجنة',
      'جميع الإجابات صحيحة',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "حكم استعمال قطرة العين في نهار رمضان إذ لم تصل إلى الحلق...",
    "options": [
      '	تفطر',
      'لا تفطر',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "حكم استعمال قطرة الأذن إذ لم تصل إلى الحلق ....",
    "options": [
      'تفطر',
      'لا تفطر',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من مفطرات الصيام.....",
    "options": [
      'التدخين',
      '	الإبر المغذية',
      '	الجماع سواء كان بنزول المني أم لا',
      'الإستمناء (خروج المني بقصد)',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index": 4,
  },
  {
    "id": 9,
    "question": "كم رمضان صام النبي صلى الله عليه وسلم.....",
    "options": [
      '	ثلاث رمضانات',
      '	خمس رمضانات',
      '	تسع رمضانات',
    ],
    "answer_index": 2,
  },

];












// const List mohamed =
// [
//    {
//     "id": 1,
//     "question": "",
//      "options": [
//        'صح',
//        'خطأ',
//      ],
//     "answer_index": ,
//   },
//    {
//       "id": 2,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 3,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 4,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 5,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 6,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 7,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 8,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 9,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
//    {
//       "id": 10,
//       "question": "",
//       "options": [
//         'صح',
//         'خطأ',
//       ],
//       "answer_index": ,
//     },
// ];
