const List hujjOne =
[
  {
    "id": 1,
    "question": "الحج هو الركن ...... في الإسلام",
    "options": [
      'الثاني',
      'الرابع',
      'الخامس',
    ],
    "answer_index":2 ,
  },
  {
    "id": 2,
    "question": "كم مرة يجب على المسلمين تأدية الحج....",
    "options": [
      '	مرة واحدة في العمر',
      '	مرتين في العمر',
      '	ثلاث مرات',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " أركان الحج هي .......",
    "options": [
      'الاحرام والوقوف بعرفة فقط',
      'الاحرام والوقوف بعرفة والسعي بين الصفا والمروة فقط',
      '	الإحرام والوقوف بعرفة وطواف الإفاضة والسعي بين الصفا والمروة',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "من واجبات الحج.....",
    "options": [
      'السعي بين الصفا والمروة',
      '	المبيت بمزدلفة ليلة النحر',
      'استلام الحجر وتقبيله',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "من سنن الحج....",
    "options": [
      '	المبيت بمنى في اليوم الثامن',
      '	طواف القدوم',
      '	استلام الحجر وتقبيله',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "رمي الجمار من.....",
    "options": [
      'أركان الحج',
      '	واجبات الحج',
      '	سنن الحج',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "من ترك ركناً من أركان الحج....",
    "options": [
      '	لا يتم النسك إلا به',
      'يتم جبره بدم',
      '	لا شيء عليه',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من ترك واجباً من واجبات الحج.....",
    "options": [
      '	لا يتم النسك إلا به',
      'يتم جبره بدم',
      '	لا شيء عليه',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "حكم استعمال الطيب(الروائح العطرية) أثناء الإحرام....",
    "options": [
      '	جائز',
      'مكروه',
      'حرام',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "حكم صيد الحيوانات وقطع الأشجار في حرم المدينة.....",
    "options": [
      'جائز',
      'مكروه',
      '	حرام',
    ],
    "answer_index": 2,
  },

  {
    "id": 11,
    "question": "من محظورات الإحرام لدى النساء....",
    "options": [
      '	لبس النقاب والقفازين',
      '	لبس المخيط',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "لبس المخيط من.....",
    "options": [
      '	محظورات الإحرام لدى الرجال فقط',
      '	محظورات الإحرام لدى النساء فقط',
      '	محظورات الإحرام لدى الرجال والنساء',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "من محظورات الإحرام لدى الرجال والنساء.....",
    "options": [
      'الجماع ومقدماته',
      '	عقد النكاح',
      '	إزالة الشعر والأظافر',
      '	جميع الإجابات صحيحة',
    ],
    "answer_index": 3,
  },
  {
    "id": 14,
    "question": "من فعل شيئاً من محظورات الإحرام ناسياً......",
    "options": [
      '	لا شيء عليه',
      'عليه فدية ولا إثم عليه',
      '	آثم وعليه فدية',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "من فعل شيئاً من محظورات الإحرام متعمداً بدون اضطرار لفعلها......",
    "options": [
      '	لا شئ عليه',
      '	آثم وعليه فدية',
      '	عليه فدية ولا إثم عليه',
    ],
    "answer_index": 1,
  },
];





const List hujjTwo =
[
  {
    "id": 1,
    "question": " أول أيام الحج هو يوم.....",
    "options": [
      'يوم التروية (اليوم الثامن من ذي الحجة)',
      'يوم عرفة (اليوم التاسع من ذي الحجة)',
      'يوم النحر (اليوم العاشر من ذي الحجة)',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "كم نسك الحاج مخير بينهم.....",
    "options": [
      '	اثنان',
      'ثلاثة',
      'أربعة',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "ما هي صيغة التلبية التي يلقيها الحاج عند إحرامه مفرداً.....",
    "options": [
      '	لبيك اللهم عمرة',
      '	لبيك اللهم حجاً وعمرة',
      '	لبيك اللهم حجاً',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "من الذي يحرم بالعمرة في أشهر الحج.....",
    "options": [
      'القران',
      'الفرد',
      'المتمتع',
    ],
    "answer_index":2 ,
  },
  {
    "id": 5,
    "question": "من الذي يحرم بالعمرة والحج جميعاً.....",
    "options": [
      'القران',
      'الفرد',
      'المتمتع',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من الذي يحرم بالحج مفرداً....",
    "options": [
      'القِران',
      'الفرد',
      'المتمتع',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": " كم عدد الأشواط التي يرمل(يسرع في المشي) فيها الحاج أو المعتمر من الرجال أثناء الطواف.....",
    "options": [
      'ثلاثة',
      'خمسة',
      'سبعة',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "ما هي الجمرات التي يرميها الحاج يوم النحر.....",
    "options": [
      '	جمرة العقبة الكبرى',
      '	الجمرة الوسطى والكبرى',
      '	الجمرة الصغرى والوسطى والكبرى',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "ما هو آخر شيء يفعله الحاج قبل أن يرجع إلى بلده.....",
    "options": [
      '	رمي الجمار',
      '	المبيت بمنى',
      '	طواف الوداع',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": " الحائض والنفساء....",
    "options": [
      '	ليس عليهما طواف الوداع',
      '	عليهما طواف الوداع',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "أكمل من قوله تعالى (الْحَجُّ ....... مَّعْلُومَاتٌ ۚ فَمَن فَرَضَ فِيهِنَّ الْحَجَّ فَلَا رَفَثَ وَلَا فُسُوقَ وَلَا جِدَالَ فِي الْحَجِّ ۗ)",
    "options": [
      'أَيَامٌ',
      'أَشْهُرٌ',
     ],
    "answer_index":1 ,
  },
  {
    "id": 12,
    "question": "الحج هو الركن الخامس من أركان.....",
    "options": [
      'الإسلام',
      'الصيام',
      'الصلاة',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": " في أي شهر يحج المسلمون.....",
    "options": [
      'شوال',
      'ذو الحجة',
      'رجب',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "كم عدد أيام الحج....",
    "options": [
      '6',
      '12',
      '20',
    ],
    "answer_index":0 ,
  },
  {
    "id": 15,
    "question": "كم مرة يطوف الحاج حول الكعبة.....",
    "options": [
      '	ثلاثة أشواط',
      'سبعة أشواط',
      'عشرة أشواط',
    ],
    "answer_index": 1,
  },
];









const List hujjThree =
[
  {
    "id": 1,
    "question": "أركان العمرة هي ....",
    "options": [
      'الإحرام والطواف',
      '	الإحرام والطواف والسعي بين الصفا والمروة',
      '	الإحرام والوقوف بعرفة والطواف والسعي بين الصفا والمروة',
    ],
    "answer_index":1 ,
  },
  {
    "id": 2,
    "question": "من واجبات العمرة....",
    "options": [
      '	الحلف أو التقصير',
      '	التجرد من المخيط لدى الرجال',
      '	الإحرام من الميقات',
      'جميع الإجابات صحيحة',
    ],
    "answer_index": 3,
  },
  {
    "id": 3,
    "question": " أركان الحج هي ....",
    "options": [
      '	الإحرام والطواف والسعي',
      '	الإحرام والسعي بين الصفا والمروة',
      'الإحرام الوقوف بعرفة والطواف والسعي',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": " الصلاة فيه تعدل أجر عمرة....",
    "options": [
      'مسجد قباء',
      '	المسجد النبوي',
      'المسجد الأقصى',
    ],
    "answer_index":0 ,
  },
  {
    "id": 5,
    "question": "كم عدد الأشواط التي يطوفها المعتمر حول الكعبة.....",
    "options": [
      '	ثلاثة أشواط',
      '	خمسة أشواط',
      '	سبعة أشواط',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "يعتبر السعي بين الصفا والمروة ثم العودة من المروة إلى الصفا.....",
    "options": [
      '	شوطاً واحداً',
      'شوطين',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "الوقوف بعرفة من .....",
    "options": [
      '	أركان الحج',
      '	أركان العمرة',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "حكم من ترك شيئاً من أركان العمرة....",
    "options": [
      'تتم عمرته مع فدية',
      '	لم تتم عمرته سواء كان تاركه جاهلاً أم متعمداً أم ناسياً',
      '	تتم عمرته ولا شيء عليه',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": " حك من ترك واجباً من واجبات العمرة ناسياً",
    "options": [
      'لا شيء عليه',
      '	عليه فدية ويأثم',
      '	عليه فدية ولا إثم عليه',
    ],
    "answer_index": 2,
  },
];















// const List mohamed =
// [
//   {
//     "id": 1,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index":0 ,
//   },
//   {
//     "id": 2,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 3,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 4,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index":0 ,
//   },
//   {
//     "id": 5,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 6,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 7,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 8,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 9,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 10,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//
//   {
//     "id": 11,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 12,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 13,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 14,
//     "question": "",
//     "options": [
//       'صح',
//       'خطأ',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 15,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 16,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index":0 ,
//   },
//   {
//     "id": 17,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 18,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 19,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
//   {
//     "id": 20,
//     "question": "",
//     "options": [
//       'صح',
//       'صح',
//       'خطأ',
//     ],
//     "answer_index": 0,
//   },
// ];