
const List lectureOne =
[
  {
    "id": 1,
    "question": "دراسة العقيدة مهمة للمسلمين الجدد فقط أما أهل الإسلام فلا يحتاجون لدراسة العقيدة",
    "options": ['صح', 'خطأ',],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "كل ما يحدث لأهل السنة من اليهود والنصاري والشيعة هي في الحقيقة تطبيقات لاعتقاداتهم",
    "options": ['صح', 'خطأ',],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " لما أرسل النبي صلي الله عليه وسلم معاذ إلي اليمن أمره أن يدعوهم إلي",
    "options": [
      'أن يعرفوا الله ويفردوه بالعبادة ثم يعلمهم الصلاة ثم يعلمهم الزكاة',
      'يعلمهم الصلاة أولا ثم يعلمهم أحكام الزكاة فقط',
      ' يعلمهم الصلاة ثم يعرفهم بالله وبتوحيده ثم يعلمهم الزكاة',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": " افترقت اليهود علي .. وافترقت النصاري علي .. وستفترق أمتي علي .. كلهم في النار إلا واحدة",
    "options": [
      '٧٣  - ٧٢  -  ٧١',
      '٧١  -  ٧٢  - ٧٣',
      '٧٢  -  ٧٣  - ٧١',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " عقيدة الصحابة هي العقيدة الصحيحة .. لماذا ؟",
    "options": [
      'لأن الله زكاهم في كتابه',
      ' لأن عاصروا تنزيل الوحي',
      'لأن النبي عليه الصلاة والسلام زكاهم',
      ' جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": " من مات علي شرك أكبر وهو يعلم لا تنفعه يوم القيامة صلاته ولا صيامه",
    "options": ['صح', 'خطأ',],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "الإيمان الصحيح بالقدر واليوم الآخر يحمي الإنسان من القلق الزائد واحتمالات الانتحار",
    "options": ['صح', 'خطأ',],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": " دراسة العقيدة الصحيحة هي السبيل لحماية الأجيال من خطر ",
    "options": [
      ' التكفير الغير منضبط',
      'الإلحاد',
      'التشيع',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": " الدراسة الصحيحة للعقيدة تقوي القلب تجاه المخاوف من السحر والشياطين والجن",
    "options": ['صح', 'خطأ',],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "قوله تعالي الذين آمنوا ولم يلبسوا إيمانهم بظلم .. ما معني الظلم ؟",
    "options": [
      ' المعاصي كلها',
      'الكبائر',
      'الشرك',
    ],
    "answer_index": 2,
  },
];




const List lectureTwo =
[
  {
    "id": 1,
    "question": " توحيد الربوبية هو ",
    "options": [
      'توحيد الرب بأفعال العباد',
      'توحيد الرب بأفعال الرب',
      ' الإيمان بالأسماء الحسني علي الوجه الصحيح',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "تقسيم التوحيد إلي توحيد ربوبية و توحيد ألوهية و توحيد أسماء و صفات هو مجرد تقسيم اصطلاحي لتسهيل الفهم و الدراسة و ليس تقسيما شرعيا",
    "options": ['صح', 'خطأ',],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": " كلمة الرب في اللغة تأتي بمعني",
    "options": [
      'المالك فقط',
      ' المدبر و المتصرف و المصلح فقط',
      'السيد الآمر المطاع فقط',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 4,
    "question": " اعتقاد بعض المتصوفة أن الأولياء لهم تصرف في الكون يتعارض مع توحيد الربوبية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "من مظاهر الشرك في توحيد الربوبية",
    "options": [
      'الذبح لغير الله',
      'السجود لغير الله',
      ' اعتقاد أن الأسباب و الطبيعة هي التي تنفع أو تضر بذاتها',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": " اعتقاد الإنسان أن الله هو المالك ملكا تاما علي الحقيقة من ثمراته ",
    "options": [
      ' ألا يعتقد أنه حر حرية مطلقة',
      'أنه يتصرف في ملك الله من مال و غيره بأمر الله',
      ' ألا يستعمل جوارحه في معصية الله',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "علم الإنسان أن الله هو الذي يرزق و ينفع و يضر و يدبر من ثمراته",
    "options":
    [
      ' السكينة و الطمأنينة',
      'عدم التعلق بالأسباب',
      'صدق التوكل علي الله',
      ' جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 8,
    "question": " قول الله تعالي ( إِنِ الْحُكْمُ إِلَّا لِلَّـهِ. ..  ) دال علي معني من معاني توحيد الربوبية و هو",
    "options": [
      ' التدبير',
      'الملك',
      'السيادة',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "اعتقاد أن الشعوب لها الحق أن تضع القوانين التي تشاء و لو كانت مصادمة لشرع الله هو كفر بالربوبية",
    "options": ['صح', 'خطأ',],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": " قوله تعالي ( اتَّخَذُوا أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَابًا مِّن دُونِ اللَّهِ .. ) ... معني الاتخاذ أرباب في هذه الآية",
    "options": [
      'كانوا يعتقدون أن لهم الحق أن يحلوا لهم الحرام و يحرموا عليهم الحلال',
      'كانوا يعتقدون أنهم آلهة',
      'كانوا يركعون لهم و يسجدون',
    ],
    "answer_index": 0,
  },
];



const List lectureThree =
[
  {
    "id": 1,
    "question": "عامة المشركين الأوائل لم يكن عندهم شك في وجود الله",
    "options": [
      'خطأ',
      'صح',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "العلم قد يتعارض مع الدين في حالات",
    "options": [
      'أن يكون هذا الدين أصلا محرف مثل دين النصاري',
      'أن يتعارض مع أدلة في الدين الإسلامي لم تثبت',
      'أن يتعارض مع أدلة في الدين الإسلامي تم فهمها فهما خاطئا',
      'أن يكون العلم نفسه مجرد نظرية لم تثبت بعد',
      'جميع ما سبق',
    ],
    "answer_index": 4,
  },
  {
    "id": 3,
    "question": " لا يمكن أن تتعارض حقائق علمية ثابتة بيقين مع أدلة الدين الصحيحة",
    "options": [
      'خطأ',
      'صح',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": " في الحديث ( ما من مولود إلا يولد علي .... )",
    "options": [
      'التوحيد',
      'الفطرة',
      'الإسلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": " الإلحاد لا يستقيم مع العقل السليم بسبب",
    "options": [
      'العقل السليم يقر بحقيقة أن مادام هناك خلق فلابد من وجود خالق',
      'العقل السليم يقر أن الصدفة لا تحدث اتقانا',
      'العقل السليم يقر أنه لا يمكن أن يوجد شئ من العدم بنفسه',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "يلزم لكي أثبت وجود شئ أن أراه بعيني",
    "options": [
      'خطأ',
      'صح',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "مصدر العلم الصحيح هو الحس فقط",
    "options":
    [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من مصادر العلم الصحيح",
    "options": [
      ' الحس',
      ' العقل السليم',
      ' الخبر الصحيح',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": "من أهم الأدلة القرآنية في باب الرد علي الملحدين قوله تعالي",
    "options": [
      'لوْ كَانَ فِيهِمَا آلِهَةٌ إِلَّا اللَّهُ لَفَسَدَتَا ۚ فَسُبْحَانَ اللَّهِ رَبِّ الْعَرْشِ عَمَّا يَصِفُونَ (22) الأنبياء',
      ' وَهُوَ الَّذِي فِي السَّمَاءِ إِلَٰهٌ وَفِي الْأَرْضِ إِلَٰهٌ ۚ وَهُوَ الْحَكِيمُ الْعَلِيمُ (84) الزخرف',
      'أمْ خُلِقُوا مِنْ غَيْرِ شَيْءٍ أَمْ هُمُ الْخَالِقُونَ (35) الطور',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": " من الأدلة الحسية علي وجود الله إجابة الدعوات",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": " من القواعد الهامة في مناقشة الإلحاد",
    "options": [
      'فاقد الشئ لا يعطيه فالمخلوق لا يمكن أن يكون خالق نفسه',
      ' الخالق لابد أن يكون أكمل من المخلوق فلا يمكن أن تكون الطبيعة خالقة للإنسان',
      ' الصدفة لا تحدث إتقانا',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 12,
    "question": "تفسير الخلق بالقوانين الطبيعية خطأ لأن القوانين تجيب علي سؤال ( ... ) و ليس سؤال ( .... )",
    "options":
    [
      'لماذا / من',
      'كيف / من',
      'من / كيف',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "نظرية دارون أنكرها علماء الهندسة الوراثية و اتهموها بالسخف و الضلال",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "من يثبت وجود خالق للكون لكن ينكر أن له علاقة به بعد الخلق يكفي أن نثبت له أن القرآن من عند الله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":0,
  },
  {
    "id": 15,
    "question": "من أدلة أن القرآن من عند الله",
    "options": [
      ' وجود الأخبار الغيبية في القرآن و التي وقعت بدقة',
      ' آيات العتاب للنبي عليه الصلاة و السلام التي في القرآن',
      'صدق النبي عليه الصلاة و السلام و عبادته لربه',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
];



const List lectureFour =
[
  {
    "id": 1,
    "question": "معني الإله",
    "options": [
      'السيد الملك',
      'الرب المدبر',
      'المعبود المطاع',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "ما اسم الصحابي الذي قال له رسول الله صلي الله عليه و سلم ) إنك تقدم قوما أهل كتاب فليكن أول ما تدعوهم إليه أن يوحدوا الله ... (",
    "options": [
      'حذيفة بن اليمان',
      'معاذ بن جبل',
      'أبو موسي الأشعري',
    ],
    "answer_index":1 ,
  },
  {
    "id": 3,
    "question": "أكمل بكلمة واحدة فقط :\nأركان العبادة هي كمال .... مع كمال الرجاء و الخوف",
    "options": [
      'الصدق',
      'الامانه',
      'الحب والمحبه',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "آيات جمعت أركان العبادة الثلاثة",
    "options": [
      'يرجون رحمته و يخافون عذابه',
      'والذين آمنوا أشد حبا لله',
      'الْحَمْدُ اِ لِلَِ رَبِِّ الْعَالَمِينَ ) 2 ( ال ا رحْمَنِ ال ا رحِيمِ ) 3 ( مَالِكِ يَوْمِ الدِِّينِ ) 4',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "توحيد الألوهية هو المقصود الأساسي من بعثة الرسل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": 'في تفسير قوله تعالي ) الاذِي خَلَقَ الْمَوْتَ وَالْحَيَاةَ لِيَبْلُوَكُمْ أَيُّكُمْ أَحْسَنُ عَمَلًا وَهُوَ الْعَزِيزُ ا لْغَفُورُ ( 2 ) )\nقال فضيل بن عياض  أحسن عملا  أخلصه وأصوبه\nما معني أصوبه :',
    "options": [
      'ما كان موافقا للعرف',
      'ما كان علي هدي النبي صلي الله عليه و سلم',
      'ما كان لله وحده',
    ],
    "answer_index":1 ,
  },
  {
    "id": 7,
    "question": "لو أن إنسانا تعبد لله ببدعة و لكن كانت نيته خالصة لله",
    "options": [
      'له أجر النية',
      'عليه وزر و عمله مردود',
      'لا أجر و لا وزر',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من دخل في الصلاة يريد بذلك وجه الناس و لكن صلي علي هدي النبي عليه الصلاة و السلام",
    "options": [
      'له أجر المتابعة',
      'ليس له أي أجر في صلاته بل يأثم',
      'له أجر المتابعة و عليه وزر الرياء',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "نعتقد أن الله لا يغفر لمن مات كافرا و أنه لا يصح أن نترحم عليه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "المحور الرئيسي للخصومة بين الأنبياء و أقوامهم",
    "options": [
      'تأسيس استحقاق الله للعبادة',
      'تأسيس استحقاق الله وحده للإفراد بالعبادة',
      'تأسيس الاعتقاد بأن الله هو الخالق الرزاق',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "لو دخل إنسان الصلاة مخلصا لله ثم عرص له الرياء فدفعه و جاهده",
    "options": [
      'صلاته باطلة',
      'صلاته صحيحة و له أجر المجاهدة',
      'صلاته مكروهة',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "العبادة يدخل في معناها كل قول و فعل يحبه الله و يرضاه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];




const List lectureFive =
[
  {
    "id": 1,
    "question": "الشرك الأكبر في باب الألوهية هو صرف العبادة لغير الله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "من صور الشرك في الدعاء",
    "options": [
      'أن يسأل الميت الشفاء أو تيسير زواج',
      'أن يطلب من شخص حي حاضر أن يطعمه أو يسقي',
      'جميع ما سبق',
      '',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": ") لا إله إلا أنت سبحان إني كنت من الظالمين ( هو نوع من الدعاء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 4,
    "question": "الحب الطبيعي للزوجة و الأولاد هو من المحبة الشركية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":1 ,
  },
  {
    "id": 5,
    "question": "من أحب أحد كحب الله التعبدي فهو مشرك",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من صور الشرك في الخوف",
    "options": [
      'الخوف من الأولياء علي الغيب',
      'الخوف من أسد حاضر',
      'جميع ما سبق',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "تحل الذبيحة في اي حالة من الحالات الآتية",
    "options": [
      'لو ذكر غير اسم الله عليها',
      'لو قصد بها إكرام ضيف',
      'لو قصد بها التقرب للجن',
      'لو ذبح تقربا لمقبور',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من شروط جواز الرقية أن لا يعتقد أنها تنفع لذاتها دون الله",
    "options": [
      'صح',
      'خطأ',
      '',
      '',
    ],
    "answer_index":0 ,
  },
  {
    "id": 9,
    "question": "يجوز استعمال الكلمات الغير مفهومة في الرقية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "متي يكون تعليق التميمة شرك أكبر",
    "options": [
      'إذا اعتقد أنها تنفع أو تضر بذاتها دونا عن الله',
      'إذا اعتقد أنها فقط سببب لجلب النفع أو دفع الضر مع اعتقاده أن الله هو النافع الضار',
      'جميع ما سبق',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "هناك إجماع علي عدم جواز تعليق التمائم المكتوب عليها قرآن كريم",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },

];




const List lectureSix =
[
  {
    "id": 1,
    "question": "لا يجتمع قبر و مسجد في دين الإسلام",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "المقصد الأساسي لزيارة القبور",
    "options": [
      ' الدعاء للميت والاعتبار والاتعاظ',
      'طلب الدعاء من الميت',
      'نقل أخبار الأحياء للميت',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "الأصل أن الموتي لا يسمعون كلام الأحياء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "لما مات رسول الله صلي الله عليه و سلم دفنه الصحابة في مسجده",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "قصة أصحاب الكهف لا تصلح دليلا علي جواز بناء المساجد علي القبور",
    "options": [
      'لأنها تعارض الأحادبث الثابتة في ديننا بالنهي عن ذلك',
      'لأن الظاهر أن هذا الفعل كان فعل أهل الغلبة و لم يكن فعل الصالحين',
      'لأن القصة في شرع من قبلنا و أتي شرعنا بخلافها',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "من ذبح تقربا لمقبور فذبيحته تعتبر ميتة لا يحل أكلها و هذا الفعل شرك أكبر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "لا تشد الرحال إلا للمسجد الحرام و المسجد النبوي فقط",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "من الأمور المسموح بها فيما بتعلق بالقبور",
    "options": [
      'الجلوس علي القبر',
      'الصلاة إلي القبر',
      'البناء علي القبور',
      'السلام علي أهل القبور',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": "دعاء الله عند قبور الصالحين أرجي للقبول",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "الوسيلة هي الواسطة بينك و بين الله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "ليس من أنواع التوسل المشروع",
    "options": [
      'التوسل إلي الله بأسمائه و صفاته',
      'التوسل إلي الله بدعاء المقبورين',
      'التوسل إلي الله بعمل صالح قام به العبد',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "يستحب التوسل إلي الله بدعاء الرجل الصالح الحي",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

];



const List lectureSeven =
[
  {
    "id": 1,
    "question": "النبي صلي الله عليه و سلم واسطة بيننا و بين الله في الدعاء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "لو الفعل شرك أكبر فلا يلزم أن الفاعل كافر لأن هناك ما يسمي بموانع التكفير",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "في الحديث ( لا تطروني كما أطرت النصاري عيسي بن مريم )\nتطروني معناها:",
    "options": [
      'تحترموني',
      'تبالغوا في مدحي',
      'تطيعوني',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "من صور الشرك الأكبر في الدعاء",
    "options": [
      'أن يقول للمقبور اشفيني يا سيدي فلان',
      'أن يطلب من المقبور أن يدعو له',
      'أن يدعو الله عند قبر ولي من الأولياء',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "من صور الشرك الأصغر في الدعاء",
    "options": [
      'أن يقول للمقبور اشفيني يا سيدي فلان',
      'أن يطلب من المقبور أن يدعو له',
      'جميع ما سبق',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "حديث ( توسلوا بجاهي فإن جاهي عند الله عظيم )",
    "options": [
      'حديث صحيح',
      'حديث حسن',
      'حديث باطل',
    ],
    "answer_index":2 ,
  },
  {
    "id": 7,
    "question": "قول إخوة يوسف لأبيهم ( يا أبانا استغفر لنا ذنوبنا  ) دليل علي مشروعية",
    "options": [
      'التوسل بالأسماء و الصفات',
      'التوسل بالعمل الصالح',
      'التوسل بدعاء الرجل الصالح',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "توسل عمر بن الخطاب بالعباس رضي الله عنها عند القحط كان",
    "options": [
      'توسلا بجاه العباس',
      'توسلا بدعاء العباس',
      'توسلا بمنزلة العباس عند الله لأنه من آل البيت',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "التوسل بجاه النبي صلي الله عليه وسلم مسألة خلافية بين أهل العلم و الراجح أنها",
    "options": [
      'سنة',
      'بدعة',
    ],
    "answer_index":1 ,
  },
  {
    "id": 10,
    "question": "لو قال قائل ( اللهم إني أتوسل إليك بحبي لنبيك ) فهذا من صور",
    "options": [
      'التوسل بجاه النبي صلي الله عليه و سلم',
      'التوسل بدعاء الرجل الصالح',
      'التوسل بالعمل الصالح',
    ],
    "answer_index": 2,
  },
];



const List lectureEight =
[
  {
    "id": 1,
    "question": "شخص كانت له أعمال خيرية كثيرة لكنه مات نصرانيا ... فهناك احتمال أن يدخل الجنة لما قدم من أعمال خيرية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "المؤمن العاصي قد يدخل النار ... لكن لابد أن يخرج منها يوما من الأيام و إن طال مكثه فيها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من أعتقد أن أحدا له أن يحلل و يحرم و يشرع للناس قوانين مضاهية لشرع الله فقد جعل لله ندا و وقع في شرك أكبر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "الشرك الأصغر هو كل ذريعة تؤدي للشرك الأكبر و وسيلة للوقوع فيه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "فاعل الشرك الأصغر حكمه كحكم مرتكب الكبيرة أمره إلي الله إن شاء عذبه و إن شاء غفر له",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من اعتقد أن أحدا غير الله له شئ من تدبير الكون فقد أشرك بالله في",
    "options": [
      'الربوبية',
      'الألوهية',
      'الأسماء و الصفات',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "من اعتقد أن أحدا له سمع محيط مثل سمع الله أو أن له يدا مثل يد الله فقد أشرك بالله في",
    "options": [
      'الربوبية',
      'الألوهية',
      'الأسماء و الصفات',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "من دعا غير الله أو ذبح لغير الله فقد أشرك بالله في",
    "options": [
      'الربوبية',
      'الألوهية',
      'الأسماء و الصفات',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من أسباب الشرك",
    "options": [
      'الغلو في الصالحين',
      'بناء المساجد علي القبور',
      'الصلاة في المساجد التي بها قبور',
      'جميع ما سبق',
      '1 و 2 فقط',
    ],
    "answer_index": 3,
  },
  {
    "id": 10,
    "question": "من قال للمقبور ) اشفيني يا سيدي فلان ( فقد وقع في شرك",
    "options": [
      'أكبر',
      'أصغر',
    ],
    "answer_index": 0,
  },
  {
    "id": 11,
    "question": "من صلي يريد وجه الناس فقد وقع في شرك ..... و من قال كلمة التوحيد يريد بها وجه الناس فقد وقع في شرك ....",
    "options": [
      'أكبر ، أكبر',
      'أصغر ، أصغر',
      'أصغر ، أكبر',
      'أكبر ، أصغر',
    ],
    "answer_index": 2,
  },
  {
    "id": 12,
    "question": "من صور الشرك الأصغر",
    "options": [
      'قول ) لولا الله و فلان .. (',
      'الذبح لغير الله',
      'جميع ما سبق',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "من الفروق بين الشرك الأكبر و الشرك الأصغر",
    "options": [
      'الشرك الأكبر محبط لجميع الأعمال و أما الأصغر فلا يحبط إلا العمل الذي قارنه',
      'الشرك الأكبر صاحبة تحت المشيئة و أما الشرك الأصغر فصاحبه لا يدخل تحت المشيئة',
    ],
    "answer_index": 0,
  },
];


const List lectureNine =
[
  {
    "id": 1,
    "question": "كفر إبليس و فرعون كان كفر",
    "options": [
      'كفر تكذيب',
      'كفر إباء و استكبار',
      'كفر شك',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "أول درجات الإيمان أن يزول الشك من قلبك ... و أما الشاك و المتردد فلا يعد مؤمنا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "الجهل المعتبر الذي يعذر به الإنسان هو الجهل الناشئ عن عدم البلاغ ... أما الجهل الناشئ عن الإعراض فلا يعذر به",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "لو أن نصرانيا شهد أن لا إله إلا الله فقط و اكتفي بالإيمان بعيسي عبدا و رسولا و لم يؤمن بمحمد صلي الله عليه و سلم ... فهذا الإيمان ينجيه يوم القيامة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من أنواع النفاق العملي الذي لا يخرج من الملة",
    "options": [
      'بغض الرسول صلي الله عليه و سلم',
      'الفجر في الخصومة',
      'كراهية انتصار دين الإسلام',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "يجوز حل السحر بالسحر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "الساحر يكون كافرا كفر أكبر إذا",
    "options": [
      'استحل السحر',
      'كان سحره مجرد خفة يد و خدع بصرية',
      'جميع ما سبق',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "مجرد سؤال الكاهن عن الغيب المطلق حتي لو لم تصدقه يجعل صلاتك لا تقبل أربعين يوما فإن صدقته كفرت",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "يدخل في معني ادعاء علم الغيب :",
    "options": [
      'معرفة أحداث حياتك عن طريق قراءة الكف و الفنجان',
      'تعلم علوم الفلك و الفضاء',
      'جميع ما سبق',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "التشاؤم بالبومة يعد من الشرك الأصغر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];


const List lectureTen =
[
  {
    "id": 1,
    "question": "حب الآيات و السور المتضمنة للأسماء و الصفات سبب لدخول الجنة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "تحديد التسعة و تسعين اسم المشار إليهم في الحديث ) إن لله تسعة و تسعين اسما من أحصاها دخل الجنة ( هو مسألة اجتهادية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من عقائد اليهود الفاسدة اعتقادهم",
    "options": [
      'أن الملائكة بنات الله',
      'أن الله تعب من خلق السموات و الأرض فاستراح في اليوم السابع',
      'جميع ما سبق',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "لا فرق بين عقيدة المسلمين و بين عقيدة النصاري في قضية الأسماء و الصفات",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "كل اسم لله يدل علي صفة و لكن ليس كل صفة لله يمكن أن نشتق منها اسما",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "التعطيل : هو اعتقاد كيفية لصفات الله تعالي",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "التكييف دائرة أوسع من التمثيل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من وقع في التأويل المذموم بغرض التنزيه إنما سبب ذلك أنه وقع أولا في",
    "options": [
      'التعطيل',
      'التشبيه',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من أصول أهل السنة تقديم العقل علي النصوص الشرعية",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];


const List lectureEleven =
[
  {
    "id": 1,
    "question": "نحن نجهل كيفية صفات الله لكن لا نجهل معناها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "تأويل معني استوى في قوله تعالي (.. استوى على العرش .. ) إلي استولى هو تأويل صحيح قام عليه الدليل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "يمكن اختصار عقيدة أهل السنة في الأسماء و الصفات في عبارة",
    "options": [
      'إثبات بلا تشبيه و تنزيه بلا تعطيل',
      'إثبات بلا تعطيل و تنزيه بلا تشبيه',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "دليل من القرآن اشتمل على إثبات الصفات مع نفي المشابهة",
    "options": [
      'قوله تعالي  هل تعلم له سميا',
      'قوله تعالي  ليس كمثله شئ و هو السميع البصير',
      'قوله تعالي  هو الأول و الآخر و الظاهر و الباطن',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "قوله تعالي (لا تدركه الأبصار ..) دل على أن الرب جل و علا لا يري في الآخرة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "الصفة الذاتية هي",
    "options": [
      'الصفة الملازمة لذات الله لا تنفك عنه',
      'الصفة المتعلقة بمشيئة الله و قدرته إن شاء فعلها و إن شاء لم يفعلها',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "صفة العلو صفة ... و صفة الاستواء صفة .....",
    "options": [
      'ذاتية ، فعلية',
      'فعلية ، ذاتية',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "الله تعالي يتكلم كلاما حقيقيا بصوت و حرف",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "إثبات اليدين لله يلزم منه تشبيه الله بمخلوقاته",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "طريقة الخلف في فهم الصفات أعلم و أحكم من طريقة السلف",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];



const List lectureTwelve =
[
  {
    "id": 1,
    "question": "الأشاعرة يثبتون لله ٧ صفات و باقي الصفات يحرفونها عن معناها الذي دلت عليه بسبب شبهة التشبيه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "اعتقاد المعتزلة في الأسماء و الصفات",
    "options": [
      'يثبتون الأسماء و الصفات',
      'يثبتون الأسماء فقط و ينكرون الصفات',
      'لا يثبتون الأسماء و لا الصفات',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "أهل السنة يثبتون الأسماء و الصفات و في نفس الوقت ينفون مشابهة الله لخلقه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "من أثبت لله ذاتا لزمه أن يثبت كل الصفات لله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "قاعدة القول \"في بعض الصفات كالقول في بعضها الآخر\" نرد بها علي",
    "options": [
      'الشيعة',
      'الأشاعرة',
      'الخوارج',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "العقل السليم لا يتعارض مع الدليل الصحيح",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "عدد أسماء الله تعالي 99 اسم فقط",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "مسألة جواز اشتقاق أسماء لله تعالي من صفاته",
    "options": [
      'كل العلماء علي جواز الاشتقاق',
      'كل العلماء علي عدم جواز الاشتقاق',
      'مسألة خلاف سائغ بين أهل العلم',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "لا يجوز أن نصف الله تعالي بما لم يصف به نفسه فمن الخطأ أن نقول",
    "options": [
      'ربنا وقف معي',
      'حضن ربنا',
      'ربنا بيطبطب عليا',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 10,
    "question": "من ثمرات الإيمان الصحيح بالأسماء و الصفات",
    "options": [
      'يزيد في قلبك الخوف و الرجاء',
      'تنال سعادة الدنيا و طمأنينة القلب',
      'تجد أثر ذلك في زيادة الطاعة و حسن أدائها',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
];



const List lectureThirteen =
[
  {
    "id": 1,
    "question": "خلقت الملائكة من ....",
    "options": [
      'نار',
      'نور',
      'تراب',
      'جميع ما سبق',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "كل الملائكة متساوون في القوة و عدد الأجنحة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":1 ,
  },
  {
    "id": 3,
    "question": "الملائكة لا توصف بالأنوثة و لا بالذكورة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "الملائكة ....",
    "options": [
      'لا يأكلون و لا يشربون و لكن يتناكحون',
      'يأكلون و يشربون و لكن لا يتناكحون',
      'لا يأكلون و لا يشربون و لا يتناكحون',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "من زعم أن الملائكة و الشياطين هي مجرد أمور معنوية و ليس مخلوقات حسية فهو كافر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "الملائكة خلق كثير جدا يدخل كل يوم ..... ملك إلي البيت المعمور فإذا خرجزا لم يعودوا",
    "options": [
      'ستون ألف',
      'سبعون ألف',
      'ثمانون ألف',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "الملائكة كلهم كرام و لكن منزلتهم عند الله مختلفة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "أفضل الملائكة علي الإطلاق هو",
    "options": [
      'ميكائيل',
      'إسرافيل',
      'جبريل',
    ],
    "answer_index": 2,
  },
  {
    "id": 9,
    "question": "الله تعالي يفوض للملائكة تدبير بعض الأمور و هذا معني قوله تعالي ) و المدبرات أمرا (",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "جبريل عليه السلام وظيفته الوحيدة هي النزول بالوحي",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "الموكل بالقطر و النبات هو",
    "options": [
      'جبريل',
      'ميكائيل',
      'إسرافيل',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "الموكل بقبض الأرواح هو ملك الموت وحده و ليس له أعوان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "اسم خازن النار .....",
    "options": [
      'رضوان',
      'مالك',
      'عزرائيل',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "ينبغي شكر الله تعالي علي خلق الملائكة لأن ذلك دليل علي لطف الله و عنايته بالخلق",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 15,
    "question": "من أحب الملائكة بصدق ينبغي أن يتشبه بهم في",
    "options": [
      'خوفهم من الله',
      'همتم في العبادة بدون سأم',
      'يجتهد ألا يعصي الله تعالي ما أمره قدر ما يستطيع',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },

];



const List lectureFourteen =
[
  {
    "id": 1,
    "question": "التوراة و الإنجيل من كلام الله تعالي حقيقة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 2,
    "question": "كتب الله تعالي لااختلاف بينها في الأخبار و العقائد و كذلك لا تختلف في الشرائع",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "أعظم كتب بني إسرائيل علي الإطلاق",
    "options": [
      'الإنجيل',
      'التوراة',
      'الزبور',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "أنزل الله علي سيدنا داود",
    "options": [
      'التوراة',
      'الإنجيل',
      'الزبور',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "ما في الكتب السابقة من أخبار ينقسم إلي",
    "options": [
      'ما جاء دليل صدقه في ديننا فهذا نصدقه',
      'ما جاء دليل كذبه في ديننا فهذا نكذبه',
      'ما لم يأت دليل علي صدقه أو كذبه فهذا لا نصدقه و لا نكذبه و يجوز أن نحدث به',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 6,
    "question": "الإنجيل رسالة مكملة للتوراة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "النصاري المعاصرون لو آمنوا بوحدانية الله تعالي و بشرية عيسي عليه السلام و تحاكموا للإنجيل دون القرآن فهم مؤمنون",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "أنواع التحريف التي حصلت في كتب أهل الكتاب",
    "options": [
      'تحريف الكتابة',
      'تحريف اللسان',
      'تحريف المعني',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": 'قوله تعالي \" فويل للذين يكتبون الكتاب بأيديهم ثم يقول هذا من عند الله .... \" دل علي حصول التحريف في كتابة التوراة و الإنجيل :',
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "تكفل الله بحفظ القرآن و التوراة و الإنجيل من التحريف",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "الحديث القدسي",
    "options": [
      'يجوز مسه علي غير وضوء',
      'يجوز روايته بالمعني',
      'يجوز التعبد بتلاوته في الصلاة',
      'جميع ما سبق',
      '1 و 2 فقط',
    ],
    "answer_index": 4,
  },
  {
    "id": 12,
    "question": "الحديث النبوي هو من كلام النبي صلي الله عليه و سلم لفظا و معني",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "النسخ حق و قد وقع في القرآن و في كتب أهل الكتاب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },

];




const List lectureFifteen =
[
  {
    "id": 1,
    "question": "الرسل جميعا دعوا إلي عقيدة واحدة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "يصح إيمان من كذب بنبي واحد فقط بشرط أن يؤمن بالنبي الذي أرسل إليه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":1 ,
  },
  {
    "id": 3,
    "question": "اختر الإجابة الصحيحة",
    "options": [
      'الرسول أرسل بشرع جديد لقوم كافرين ، و النبي أرسل تابعا لشرع قبله يأمر به مؤمنين',
      'النبي أرسل بشرع جديد لقوم كافرين ، و الرسول أرسل تابعا لشرع قبله يأمر به مؤمنين',
      'لا فرق ب ين الرسول و النبي',
    ],
    "answer_index":0 ,
  },
  {
    "id": 4,
    "question": "اختر الإجابة الصحيحة",
    "options": [
      'نحن لا نفضل بين الرسل و لكن نفرق بينهم',
      'نحن لا نفرق بين الرسل لكن نفضل بينهم إذا دل علي ذلك دليل',
      'نحن لا نفضل بين الرسل و لا نفرق بينهم',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "الرسل بشر ينامون و يأكلون و يمرضون و لم يخلقوا من نور",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "فضل الله موسى عليه السلام ب ..... ، و فضل إبراهيم عليه السلام ب .....",
    "options": [
      'الخُلة ، التكليم',
      'التكليم ، الخُلة',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "ذكر الله تعالي جميع الرسل في القرآن",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "منزلة النبوة و الرسالة لا يمكن الوصول لها بكسب أو اجتهاد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "بعض الأولياء قد يكون أفضل من بعض الأنبياء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "لو سمع يهودي أو نصراني بالنبي صلي الله عليه و سلم و بلغته دعوته ثم لم يؤمن به فهو",
    "options": [
      'في مشيئة الله تعالي إن شاء عذبه و إن شاء غفر له',
      'في الجنة بشرط أن يؤمن بموسى و عيسى',
      'في النار',
    ],
    "answer_index": 2,
  },
  {
    "id": 11,
    "question": "قوله تعالي ) ما كان محمد أبا أحد من رجالكم ولكن رسول الله وخاتم النبيين ( ... ما معني خاتم النبيين :",
    "options": [
      'أفضلهم',
      'آخرهم',
    ],
    "answer_index": 1,
  },
  {
    "id": 12,
    "question": "من ادعي النبوة بعد النبي عليه الصلاة و السلام كافر و من صدقه كافر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 13,
    "question": "الوسيلة هي منزلة في الجنة لا تنبغي إلا لعبد واحد من عباد الله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "ما هو المقام المحمود",
    "options": [
      'فتح باب الجنة',
      'الشفاعة العظمي',
      'منزلة في الجنة',
    ],
    "answer_index": 1,
  },

];


const List lectureSixteen =
[
  {
    "id": 1,
    "question": "رسالة النبي عليه الصلاة و السلام نسخت الرسالات التي قبله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "من آمن بالله ربنا و بمحمد رسولا لكن اعتقد أن شريعته غير ملزمة له بل يجوز اتباع شريعة أخري فهو",
    "options": [
      'عاصي',
      'مبتدع',
      'كافر',
    ],
    "answer_index": 2,
  },
  {
    "id": 3,
    "question": "حين ينزل عيسي بن مريم في آخر الزمان سيتبع شريعة الإنجيل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "لا يؤمن أحدكم حتي أكون أحب إليه من ولده و والده و الناس أجمعين \nمعني لا يؤمن",
    "options": [
      'أنه كافر',
      'أن ايمانه ناقص عن الإيمان الواجب',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "النبي صلي الله عليه و سلم ليس له شئ في تدبير الكون",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من صور الغلو في النبي صلي الله عليه و سلم",
    "options": [
      'قول ) مدد يا رسول الله (',
      'تعمد استقبال قبره بالصلاة',
      'التمسح بقبره',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "قول النبي عليه الصلاة و السلام ) من رآني في المنام فسيراني في اليقظة ( معناه",
    "options": [
      'أنها علي التشبيه و التمثيل يعني كأنما رآني في اليقظة',
      'أنها خاصة بأهل عصره ممن آمن به قبل أن يراه',
      'أنها تكون يوم القيامة و يكون لمن رآه مزيد خصوصية',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 8,
    "question": "من رأي النبي صلي الله عليه و سلم في المنام بدون لحية فقد رآه حقا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "في الحديث ) و إنه سيكون في أمتي ..... كذابون كلهم يزعم أنه نبي، و أنا خاتم النبيين، لا نبي بعدي (",
    "options": [
      'عشرون',
      'ثلاثون',
      'أربعون',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من ادعي النبوة فيجب أن نكذبه بدون أي بحث و لا نظر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];




const List lectureSeventeen =
[
  {
    "id": 1,
    "question": "حادثة الإسراء و المعراج كانت بعد الهجرة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "الإسراء و المعراج كان",
    "options": [
      'بالروح فقط',
      'بالروح و الجسد',
      'مناما',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "رأى النبي صلى الله عليه و سلم جبريل في رحلة ال معراج علي صورته التي خلقه الله عليها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index":0 ,
  },
  {
    "id": 4,
    "question": "رأى النبي صلى الله عليه و سلم .... عليه السلام في السماء الأولي و ..... عليه السلام في السماء الثانية و ..... عليه السلام في السماء الثالثة",
    "options": [
      'آدم , يوسف , عيسى',
      'آدم , عيسى ، يوسف',
      'عيسى ، آدم ، يوسف',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "من السنة تخصيص إحياء ليلة الإسراء و المعراج بالقيام و نهارها بالصيام",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "الصحيح في رؤية النبي عليه الصلاة و السلام لربه ليلة المعراج",
    "options": [
      'رآه رؤية عينيه',
      'لم يره قط لا بعينه و لا بقلبه',
      'رآه رؤية قلبية و لم يره بعينه',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "عيسى عليه السلام لم يمت و هو حي في السماء و لكنه سيموت في آخر الزمان بعد نزوله وانقضاء فترة مكثه في الأرض",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "كيف رأى النبي عليه الصلاة و السلام الأنبياء في رحلة الإسراء و المعراج",
    "options": [
      'أحياهم الله تعالي',
      'كانت أرواحهم مصورة في صورة أبدانهم',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من شروط اثبات الكرامة لشخص",
    "options": [
      'أن يكون معروفا بالصلاح و الاستقامة علي المنهج الصحيح',
      'ألا تكون مقرونة بدعوى النبوة',
      'أن يكون أمر خارق للعادة',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 10,
    "question": "من علامات الولاية العصمة و الإخبار بعض الغيبيات",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];



const List lectureEighteen =
[
  {
    "id": 1,
    "question": "من زعم معرفة وقت قيام الساعة فهو ضال كذاب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "هناك ارتباط بين أشراط الساعة الصغرى و بين زيادة اليقين في نبوة النبي صلى الله عليه وسلم",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "لا يوجد أحكام شرعية مرتبطة بمعرفة أشراط الساعة الصغرى",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "من أشراط الساعة الصغرى",
    "options": [
      'غزوة بدر',
      'فتح بيت المقدس',
      'خلافة أبي بكر الصديق',
      'جميع ما سبق',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "كل العلامات الصغرى وقت بالفعل",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من علامات الساعة الصغرى",
    "options": [
      'التطاول في البنيان',
      'كثرة الهرج',
      'توسيد الأمر إلي غير أهله',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "علامة خروج نار من أرض الحجاز تضئ لها أعناق الإبل ببصري لم تحدث بعد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "علامة انحسار الفرات عن جبل من ذهب لم تحدث بعد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "انشقاق القمر هو",
    "options": [
      'من معجزات النبي صلى الله عليه و سلم',
      'من أشراط الساعة الصغرى',
      'كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "لا تقوم الساعة حتي تعود أرض العرب مروجا و أنهارا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];




const List lectureNineteen =
[
  {
    "id": 1,
    "question": "المهدي من نسل الحسين رضي الله عنه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "كم يمكث الدجال في الأرض",
    "options": [
      'ثلاثين يوما',
      'أربعين يوماً',
      'خمسين يوما',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "الملحمة مع اليهود قبل الملحمة مع النصارى",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "الدجال معه جنة و نار لكن ناره جنة و جنته نار",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "ينزل عيسى بن مريم عليه السلام في فلسطين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "عيسي بن مريم بعد نزوله",
    "options": [
      'سيكسر الصليب',
      'يقتل الخنزير',
      'لا يقبل إلا الاسلام',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "عيسي بن مريم يواجه يأجوج و مأجوج بجيش عظيم من خير الناس",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "ستهدم الكعبة قبل قيام الساعة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "طلوع الشمس من مغربها و خروج الدابة علامتان متلازمتان في التوقيت",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "أول العلامات الكبري نار تخرج من اليمن تحشر الناس",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];



const List lectureTwenty =
[
  {
    "id": 1,
    "question": "القبر هو المثوى الأخير للإنسان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "قوله تعالي عن آل فرعون ) الناارُ يُعْرَضُونَ عَلَيْهَا غُدُوًّا وَعَشِيًّا وَيَوْمَ تَقُومُ السااعَةُ أَدْخِلُوا آلَ فِرْعَوْنَ أَشَ ا د الْعَذَابِ ) 46 )\nأين هذه النار ؟",
    "options": [
      'في الدنيا',
      'في القبر',
      'في الآخرة',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من أدلة السنة علي عذاب القبر",
    "options": [
      'استعاذة النبي صلى الله عليه و سلم من عذاب القبر',
      'اخباره عن قبرين أنهما يعذبان و ما يعذبان في كبير',
      '1 و 2 معا',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "في غالب الأحوال نعيم القبر و عذابه يقع علي",
    "options": [
      'الروح فقط',
      'الجسد فقط',
      'الروح و الجسد معا',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "عذاب القبر يحصل",
    "options": [
      'للكافرين فقط',
      'لعصاة المؤمنين فقط',
      'للكافرين و لعصاة المؤمنين',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "الملكان الموكلان بسؤال الميت في قبره",
    "options": [
      'هاروت و ماروت',
      'منكر و نكير',
      'جبريل و ميكائيل',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "- الكافر و المنافق تلتئم عليه الأرض في قبره حتي تختلف أضلاعه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "من أدلة البعث",
    "options": [
      'خلق السموات و الأرض',
      'خلق الإنسان الأول',
      'إحياء الأرض بعد موتها',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 9,
    "question": "العقل السليم يرشد إلي ضرورة البعث و الحساب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "يحشر الناس يوم القيامة في ثيابهم التي ماتوا فيها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];




const List lectureTwentyOne =
[
  {
    "id": 1,
    "question": "حوض النبي عليه الصلاة و السلام هو أمر معنوي و ليس أمرا حسيا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "الحوض يكون في .....",
    "options": [
      'أرض المحشر',
      'بعد الصراط',
      'قبل دخول الجن',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "الأعمال تجسم يوم القيامة و توضع في الميزان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "ما الذي يوضع في الميزان",
    "options": [
      'الأعمال',
      'العامل نفسه',
      'صحف الأعمال',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 5,
    "question": "يؤتي بالرجل السمين العظيم فلا يزن عند الله جناح بعوضة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "من حكم الشفاعة",
    "options": [
      'إظهار كرامة الشافع',
      'إظهار الرحمة بالمشفوع فيهم',
      '1 , 2 ( كلاهما)',
    ],
    "answer_index": 2,
  },
  {
    "id": 7,
    "question": "- لابد أن يكون الله راضيا عن المشفوع فيه حتي تحصل الشفاعة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "الشفاعة تكون لأهل التوحيد فقط",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "إنكار الشفاعة مسألة خلافية بين أهل العلم",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "من الشفاعات الخاصة بالنبي عليه الصلاة و السلام",
    "options": [
      'الشفاعة العظمى في أهل الموقف ليقضي الله بينهم',
      'شفاعته في عمه أبي طالب',
      'الشفاعة في أهل الكبائر ممن دخلوا النار أن يخرجوا منها',
      '1 و 2 فقط',
    ],
    "answer_index": 3,
  },
  {
    "id": 11,
    "question": "الشفاعة ليست فيمن دخل النار فقط بل هي في أهل الجنة أيضا لترتفع منازلهم",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "الصراط طريق واسع لكن تزل عليه الأقدام",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 13,
    "question": "الجنة و النار سيخلقا يوم القيامة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 14,
    "question": "نار الكفار ستفنى بمن فيها حين يشاء الله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 15,
    "question": "نار الدنيا جزء من ..... جزء من نارجهنم",
    "options": [
      'خمسين',
      'ستين',
      'سبعين',
    ],
    "answer_index": 2,
  },

];



const List lectureTwentyTwo =
[
  {
    "id": 1,
    "question": "الله هو خالق الخير و خالق الشر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "علم الله تعالي يشمل الكليات دون الجزئيات",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "علم الله بأن الغلام في قصة الخضر لو عاش لكان كافرا هو من باب",
    "options": [
      'علم الله بما كان',
      'علم الله بما سيكون',
      'علم الله بما لم يكن لو كان كيف يكون',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "من أنكر مرتبة العلم فهو كافر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "كتب الله مقادير الخلائق قبل أن يخلق السموات و الأرض ب",
    "options": [
      'أربعين ألف سنة',
      'خمسين ألف سنة',
      'ستين ألف سنة',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "من الكتابات الأخري خلاف اللوح المحفوظ",
    "options": [
      'الكتابة و هو في بطن الأم',
      'الكتابة في ليلة القدر',
      'الكتابة يوم أخرج الله ذرية آدم من ظهره ) يوم الميثاق (',
      'جميع ما سبق',
    ],
    "answer_index": 3,
  },
  {
    "id": 7,
    "question": "الله تعالي خلق",
    "options": [
      'ذوات العباد',
      'أفعال العباد',
      'كلاهما',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "يمحو الله ما يشاء و يثبت و عنده أم الكتاب\nأم الكتاب هو",
    "options": [
      'القرآن',
      'اللوح المحفوظ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "العقيدة الجبرية يلزم منها اتهام الله بالظلم و العبث",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "يلزم من سبق مشيئة الله لمشيئة العباد أن الله أجبر العباد علي أفعالهم",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 11,
    "question": "يلزم من انكار خلق الله لأفعال العباد عدم فائدة الاستعانة بالله",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 12,
    "question": "الخلاصة في القدر أن الإنسان",
    "options": [
      'مسير',
      'مخير',
      'ميسر',
    ],
    "answer_index": 2,
  },
  {
    "id": 13,
    "question": "أول مرتبتين في الإيمان بالقدر",
    "options": [
      'الإيمان بالعلم',
      'الإيمان بخلق أفعال العباد',
      'الإيمان بمشيئة الله النافذة',
    ],
    "answer_index": 0,
  },
  {
    "id": 14,
    "question": "المرتبة الثالثة و الرابعة في الإيمان بالقدر",
    "options": [
      'الإيمان بالعلم',
      'الإيمان بخلق أفعال العباد',
      'الإيمان بالكتابة',
    ],
    "answer_index": 1,
  },

];




const List lectureTwentyThree =
[
  {
    "id": 1,
    "question": "قول القلب هو",
    "options": [
      'أعمال القلوب',
      'التصديق',
      'الحب',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "قول اللسان هو",
    "options": [
      'الأذكار',
      'النطق بالشهادتين',
      'قراءة القرآن',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "قول القلب و عمل القلب و قول اللسان و عمل اللسان و عمل الجوارح كلها داخلة في مسمى الإيمان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "أصل الإيمان ) الركن ( هو",
    "options": [
      'اللسان و عمل الجوارح',
      'قول القلب و قول اللسا ن و أصل أعمال القلب',
      'قول القلب فقط',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "كل أعمال الجوارح ركن في الإيمان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "هناك خلاف في المباني الأربعة ) الصلاة و الزكاة و الصوم و الحج ( هل هي من أركان الإيمان أم لا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "مان في القلب ثابت لا يزيد و لا ينقص",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 8,
    "question": "الإيمان يزيد كما و كيفا",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "أول فرقة خالفت في مسائل الإيمان و الكفر",
    "options": [
      'الشيعة',
      'القدرية',
      'الخوارج',
    ],
    "answer_index": 2,
  },
  {
    "id": 10,
    "question": "من رجحت سيئاته على حسناته لابد أن يدخل النار",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
];




const List lectureTwentyFour =
[
  {
    "id": 1,
    "question": "يثبت الإسلام في الدنيا للشخص لو نطق الشهادتين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 2,
    "question": "لو ولد لأبوين مسلمين فلا يثبت إسلامه حتي يبلغ و ينطق الشهادتين",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 3,
    "question": "من فعل معصية استكبارا علي أمر الله فقد كفر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "لا يجوز تكفير أحد حتي تستوفى الشروط و تنتفي موانع التكفير",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "من موانع التكفير",
    "options": [
      'الخطأ',
      'العمد',
      'الإكراه',
      'الاختيار',
      'جميع ما سبق',
      '1 و 3 فقط',
      '2 و 4 فقط',
    ],
    "answer_index": 5,
  },
  {
    "id": 6,
    "question": "لو الفعل كفر فيلزم أن الفاعل كافر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "الرجل الذي أمر أبناءه أن يحرقوا جثته معتقدا عدم قدرة الله عليه لم يكفر بسبب",
    "options": [
      'النسيان',
      'الخطأ',
      'الجهل',
    ],
    "answer_index": 2,
  },
  {
    "id": 8,
    "question": "عمار بن ياسر سب النبي عليه الصلاة و السلام و لم يكفر بسبب",
    "options": [
      'الجهل',
      'الإكراه',
      'الخطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "من قال كلمة الكفر و هو نائم فلا يعذر بذلك و حكمه أنه كا فر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "الذي قال اللهم أنت عبدي و أنا ربك لم يكفر بسبب",
    "options": [
      'الجهل',
      'الإكراه',
      'الخطأ',
    ],
    "answer_index": 2,
  },
];



const List lectureTwentyFive =
[
  {
    "id": 1,
    "question": "المداراة هي مصانعة الكفار و التنازل عن الثوابت و المداهنة هي درء المفسدة بالقول اللين والإعراض عن صاحب الشر إذا خيف شره",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "من معاني الولاء النصرة و المحبة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "من معاني الولاء البيع و الشراء و الإجارة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 4,
    "question": "من خرج في جيش الكافرين المحاربين للمسلمين لإسلامهم فهو",
    "options": [
      'جائز',
      'عاصي',
      'كافر',
    ],
    "answer_index": 2,
  },
  {
    "id": 5,
    "question": "يجوز نصرة الكافر لو كان مظلوما",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 6,
    "question": "يجوز تهنئة الكافرين بأعيادهم الدينية و هو من البر و الإحسان",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 7,
    "question": "يجوز تعزية الكافر في مصابه و يجوز تهنئته بالزواج",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "لم يكن النبي صلى الله عليه و سلم يقبل الهدايا من المشركين قط",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "يجوز أن تؤجر كافر ليعمل عندك",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "مقاطعة بضائع الكافرين أحيانا هو فتوي ترجع إلي موازنة المصالح و المفاسد",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];





const List lectureTwentySix =
[
  {
    "id": 1,
    "question": "الصحابي هو كل من لقي النبي صلى الله عليه و سلم",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 2,
    "question": "العقيدة في الصحابة لها ارتباط وثيق بالإيمان بالقرآن",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "الصحيح في القتال الذي وقع بين الصحابة أن",
    "options": [
      'كان هناك فريق علي الحق و فريق تعمد الباطل',
      'كلاهما كان على باطل',
      'كلا الفريقين كان مجتهد و كان فريق علي رضي الله عنه أقرب للحق من الفريق الآخر',
      'كلا الفريقين كان مجتهد و كان فريق معاوية رضي الله عنه أقرب للحق من الفريق الآخر',
    ],
    "answer_index": 2,
  },
  {
    "id": 4,
    "question": "موقفنا مما شجر بين الصحابة",
    "options": [
      'نكف ألسنتنا عن ذلك و نترضى عنهم',
      'نوالي الفريق المحق و نعادي الفريق الآخر',
    ],
    "answer_index": 0,
  },
  {
    "id": 5,
    "question": "من سب عائشة رضى الله عنها بالزنا خصوصا فهو",
    "options": [
      'عاصى',
      'مرتكب كبيرة',
      'كافر',
    ],
    "answer_index": 2,
  },
  {
    "id": 6,
    "question": "زوجات النبي عليه الصلاة و السلام يعتبرن من آل البيت",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "أفضل زوجات النبي صلى الله عليه و سلم",
    "options": [
      'خديجة رضي الله عنها',
      'عائشة رضي الله عنها',
      'حفصة رضي الله عنها',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "خالد بن الوليد رضي الله عنه أفضل من سعيد بن زيد رضي الله عنه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 9,
    "question": "عثمان رضي الله عنه أفضل من علي بن أبي طالب رضي الله عنه",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 10,
    "question": "في الحديث ) قد كان في الأمم قبلكم محدثون، فإن يكن في أمتي أحد فإن ...... منهم (",
    "options": [
      'حذيفة بن اليمان',
      'أبو عبيدة بن الجراح',
      'عمر بن الخطاب',
    ],
    "answer_index": 2,
  },
];




const List lectureTwentySeven =
[
  {
    "id": 1,
    "question": "الشيعة الإمامية يعتقدون بوجود ... إمام",
    "options": [
      '15',
      '14',
      '12',
    ],
    "answer_index": 2,
  },
  {
    "id": 2,
    "question": "مازال الشيعة سبب في هزيمة الأمة بخيانتهم لها",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 3,
    "question": "الشيعة الإمامية يعتقدون أن أئمتهم يعلمون الغيب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 4,
    "question": "الشيعة الإمامية الإثني عشرية يرون أن الأئمة عندهم أقل درجة من الأنبياء",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 5,
    "question": "عقيدة البداءة يلزم منها",
    "options": [
      'أن الله يعلم ما سيكون',
      'أن الله لا يعلم ما سيكون',
    ],
    "answer_index": 1,
  },
  {
    "id": 6,
    "question": "الشيعة الإثنى عشرية يعتقدون أن القرآن الذي بين أيدينا هو جزء من القرآن الحقيقي الذي مع الإمام",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 7,
    "question": "نكاح المتعة منسوخ في الإسلام و هو حرام بإجماع علماء السنة",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 8,
    "question": "الشيعة الزيدية لا يكفرون أبا بكر و عمر",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
  {
    "id": 9,
    "question": "يتفق أهل السنة و الشيعة في العقيدة في المهدي",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 1,
  },
  {
    "id": 10,
    "question": "علي ضوء فهمك للدرس التقارب المقبول الوحيد بين السنة و الشيعة هو أن يتوب الشيعة و يعودوا لمنهج أهل السنة و لا توجد بين السنة و الشيعة منطقة وسط للتقارب",
    "options": [
      'صح',
      'خطأ',
    ],
    "answer_index": 0,
  },
];
